lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
constexpr uint32_t kBluefruitBleIdleDiagStageIdleDisabled = 1U;
constexpr uint32_t kBluefruitBleIdleDiagStagePendingConnect = 2U;
constexpr uint32_t kBluefruitBleIdleDiagStageScanSleeping = 3U;
constexpr uint32_t kBluefruitBleIdleDiagStageScanRunning = 4U;
constexpr uint32_t kBluefruitBleIdleDiagStageActiveScan = 5U;
constexpr uint32_t kBluefruitBleIdleDiagStagePassiveScan = 6U;
constexpr uint32_t kBluefruitBleIdleDiagStageDisconnectEdge = 7U;
constexpr uint32_t kBluefruitBleIdleDiagStageConnectedIdle = 8U;

static uint8_t normalizeBluefruitPhy(uint8_t phy) {
  switch (phy) {
    case BLE_GAP_PHY_1MBPS:
    case BLE_GAP_PHY_2MBPS:
    case BLE_GAP_PHY_CODED:
      return phy;
    default:
      return BLE_GAP_PHY_AUTO;
  }
}

static bool isPrimaryAdvertisingChannel(BleAdvertisingChannel channel) {
  return (channel == BleAdvertisingChannel::k37) ||
         (channel == BleAdvertisingChannel::k38) ||
         (channel == BleAdvertisingChannel::k39);
}

uint8_t hid_ascii_to_keycode[128][2] = {};
uint8_t hid_keycode_to_ascii[128][2] = {};

void setHidAsciiMapping(char ascii, bool shift, uint8_t keycode) {
  const uint8_t asciiIndex = static_cast<uint8_t>(ascii);
  hid_ascii_to_keycode[asciiIndex][0] = shift ? 1U : 0U;
  hid_ascii_to_keycode[asciiIndex][1] = keycode;

  if (keycode < 128U) {
    hid_keycode_to_ascii[keycode][shift ? 1U : 0U] = asciiIndex;
  }
}

void initHidAsciiTables() {
  static bool initialized = false;
  if (initialized) {
    return;
  }
  initialized = true;

  memset(hid_ascii_to_keycode, 0, sizeof(hid_ascii_to_keycode));
  memset(hid_keycode_to_ascii, 0, sizeof(hid_keycode_to_ascii));

  setHidAsciiMapping('\b', false, HID_KEY_BACKSPACE);
  setHidAsciiMapping('\t', false, HID_KEY_TAB);
  setHidAsciiMapping('\n', false, HID_KEY_ENTER);
  setHidAsciiMapping('\r', false, HID_KEY_ENTER);
  setHidAsciiMapping(0x1BU, false, HID_KEY_ESCAPE);
  setHidAsciiMapping(' ', false, HID_KEY_SPACE);

  for (char ch = 'a'; ch <= 'z'; ++ch) {
    setHidAsciiMapping(ch, false, static_cast<uint8_t>(HID_KEY_A + (ch - 'a')));
  }
  for (char ch = 'A'; ch <= 'Z'; ++ch) {
    setHidAsciiMapping(ch, true, static_cast<uint8_t>(HID_KEY_A + (ch - 'A')));
  }
  for (char ch = '1'; ch <= '9'; ++ch) {
    setHidAsciiMapping(ch, false, static_cast<uint8_t>(HID_KEY_1 + (ch - '1')));
  }
  setHidAsciiMapping('0', false, HID_KEY_0);

  setHidAsciiMapping('!', true, HID_KEY_1);
  setHidAsciiMapping('@', true, HID_KEY_2);
  setHidAsciiMapping('#', true, HID_KEY_3);
  setHidAsciiMapping('$', true, HID_KEY_4);
  setHidAsciiMapping('%', true, HID_KEY_5);
  setHidAsciiMapping('^', true, HID_KEY_6);
  setHidAsciiMapping('&', true, HID_KEY_7);
  setHidAsciiMapping('*', true, HID_KEY_8);
  setHidAsciiMapping('(', true, HID_KEY_9);
  setHidAsciiMapping(')', true, HID_KEY_0);
  setHidAsciiMapping('-', false, HID_KEY_MINUS);
  setHidAsciiMapping('_', true, HID_KEY_MINUS);
  setHidAsciiMapping('=', false, HID_KEY_EQUAL);
  setHidAsciiMapping('+', true, HID_KEY_EQUAL);
  setHidAsciiMapping('[', false, HID_KEY_BRACKET_LEFT);
  setHidAsciiMapping('{', true, HID_KEY_BRACKET_LEFT);
  setHidAsciiMapping(']', false, HID_KEY_BRACKET_RIGHT);
  setHidAsciiMapping('}', true, HID_KEY_BRACKET_RIGHT);
  setHidAsciiMapping('\\', false, HID_KEY_BACKSLASH);
  setHidAsciiMapping('|', true, HID_KEY_BACKSLASH);
  setHidAsciiMapping(';', false, HID_KEY_SEMICOLON);
  setHidAsciiMapping(':', true, HID_KEY_SEMICOLON);
  setHidAsciiMapping('\'', false, HID_KEY_APOSTROPHE);
  setHidAsciiMapping('"', true, HID_KEY_APOSTROPHE);
  setHidAsciiMapping('`', false, HID_KEY_GRAVE);
  setHidAsciiMapping('~', true, HID_KEY_GRAVE);
  setHidAsciiMapping(',', false, HID_KEY_COMMA);
  setHidAsciiMapping('<', true, HID_KEY_COMMA);
  setHidAsciiMapping('.', false, HID_KEY_PERIOD);
  setHidAsciiMapping('>', true, HID_KEY_PERIOD);
  setHidAsciiMapping('/', false, HID_KEY_SLASH);
  setHidAsciiMapping('?', true, HID_KEY_SLASH);

  hid_keycode_to_ascii[HID_KEY_KEYPAD_DIVIDE][0] = '/';
  hid_keycode_to_ascii[HID_KEY_KEYPAD_DIVIDE][1] = '/';
  hid_keycode_to_ascii[HID_KEY_KEYPAD_MULTIPLY][0] = '*';
  hid_keycode_to_ascii[HID_KEY_KEYPAD_MULTIPLY][1] = '*';
  hid_keycode_to_ascii[HID_KEY_KEYPAD_SUBTRACT][0] = '-';
  hid_keycode_to_ascii[HID_KEY_KEYPAD_SUBTRACT][1] = '-';
  hid_keycode_to_ascii[HID_KEY_KEYPAD_ADD][0] = '+';
  hid_keycode_to_ascii[HID_KEY_KEYPAD_ADD][1] = '+';
  hid_keycode_to_ascii[HID_KEY_KEYPAD_ENTER][0] = '\r';
  hid_keycode_to_ascii[HID_KEY_KEYPAD_ENTER][1] = '\r';
  hid_keycode_to_ascii[HID_KEY_KEYPAD_1][0] = '1';
  hid_keycode_to_ascii[HID_KEY_KEYPAD_2][0] = '2';
  hid_keycode_to_ascii[HID_KEY_KEYPAD_3][0] = '3';
  hid_keycode_to_ascii[HID_KEY_KEYPAD_4][0] = '4';
  hid_keycode_to_ascii[HID_KEY_KEYPAD_5][0] = '5';
  hid_keycode_to_ascii[HID_KEY_KEYPAD_5][1] = '5';
  hid_keycode_to_ascii[HID_KEY_KEYPAD_6][0] = '6';
  hid_keycode_to_ascii[HID_KEY_KEYPAD_7][0] = '7';
  hid_keycode_to_ascii[HID_KEY_KEYPAD_8][0] = '8';
  hid_keycode_to_ascii[HID_KEY_KEYPAD_9][0] = '9';
  hid_keycode_to_ascii[HID_KEY_KEYPAD_0][0] = '0';
  hid_keycode_to_ascii[HID_KEY_KEYPAD_DECIMAL][0] = '.';
}

struct HidAsciiTableInit {
  HidAsciiTableInit() { initHidAsciiTables(); }
} g_hid_ascii_table_init;

uint16_t readLe16(const uint8_t* data) {
  if (data == nullptr) {
    return 0U;
  }
  return static_cast<uint16_t>(data[0]) |
         (static_cast<uint16_t>(data[1]) << 8U);
}

constexpr uint16_t kAttDiscoveryListPrefixLength = 6U;

constexpr bool validAttDiscoveryListLayout(uint16_t payloadLength,
                                           uint8_t entryLength,
                                           uint8_t shortEntryLength,
                                           uint8_t longEntryLength) {
  if (entryLength != shortEntryLength && entryLength != longEntryLength) {
    return false;
  }
  if (payloadLength <
      static_cast<uint16_t>(kAttDiscoveryListPrefixLength + entryLength)) {
    return false;
  }
  return ((payloadLength - kAttDiscoveryListPrefixLength) % entryLength) == 0U;
}

constexpr bool validAttFixedListLayout(uint16_t payloadLength,
                                       uint16_t prefixLength,
                                       uint8_t entryLength) {
  return entryLength != 0U &&
         payloadLength >= static_cast<uint16_t>(prefixLength + entryLength) &&
         ((payloadLength - prefixLength) % entryLength) == 0U;
}

constexpr bool validAttOrderedHandle(uint16_t handle, uint16_t requestStart,
                                     uint16_t requestEnd,
                                     uint16_t previousHandle) {
  return requestStart != 0U && requestStart <= requestEnd &&
         handle >= requestStart && handle <= requestEnd &&
         handle > previousHandle;
}

constexpr bool validAttServiceGroupEntry(uint16_t startHandle,
                                         uint16_t endHandle,
                                         uint16_t requestStart,
                                         uint16_t requestEnd,
                                         uint16_t previousEndHandle) {
  return validAttOrderedHandle(startHandle, requestStart, requestEnd,
                               previousEndHandle) &&
         endHandle >= startHandle && endHandle <= requestEnd;
}

constexpr bool validAttCharacteristicEntry(uint16_t declarationHandle,
                                           uint16_t valueHandle,
                                           uint16_t requestStart,
                                           uint16_t requestEnd,
                                           uint16_t previousValueHandle) {
  return validAttOrderedHandle(declarationHandle, requestStart, requestEnd,
                               previousValueHandle) &&
         valueHandle > declarationHandle && valueHandle <= requestEnd;
}

static_assert(validAttDiscoveryListLayout(12U, 6U, 6U, 20U),
              "a complete 16-bit service entry must be accepted");
static_assert(validAttDiscoveryListLayout(46U, 20U, 6U, 20U),
              "complete 128-bit service entries must be accepted");
static_assert(!validAttDiscoveryListLayout(11U, 6U, 6U, 20U),
              "a truncated service entry must be rejected");
static_assert(!validAttDiscoveryListLayout(13U, 6U, 6U, 20U),
              "a partial service-entry tail must be rejected");
static_assert(!validAttDiscoveryListLayout(14U, 8U, 6U, 20U),
              "an illegal service entry length must be rejected");
static_assert(validAttDiscoveryListLayout(13U, 7U, 7U, 21U),
              "a complete 16-bit characteristic entry must be accepted");
static_assert(validAttDiscoveryListLayout(48U, 21U, 7U, 21U),
              "complete 128-bit characteristic entries must be accepted");
static_assert(!validAttDiscoveryListLayout(12U, 7U, 7U, 21U),
              "a truncated characteristic entry must be rejected");
static_assert(!validAttDiscoveryListLayout(14U, 7U, 7U, 21U),
              "a partial characteristic-entry tail must be rejected");
static_assert(!validAttDiscoveryListLayout(14U, 8U, 7U, 21U),
              "an illegal characteristic entry length must be rejected");
static_assert(validAttFixedListLayout(9U, 5U, 4U),
              "a complete service range must be accepted");
static_assert(validAttFixedListLayout(13U, 5U, 4U),
              "complete service ranges must be accepted");
static_assert(!validAttFixedListLayout(8U, 5U, 4U),
              "a truncated service range must be rejected");
static_assert(!validAttFixedListLayout(10U, 5U, 4U),
              "a partial service-range tail must be rejected");
static_assert(validAttServiceGroupEntry(1U, 5U, 1U, 0xFFFFU, 0U),
              "an ordered service group must be accepted");
static_assert(!validAttServiceGroupEntry(4U, 3U, 1U, 0xFFFFU, 0U),
              "a reversed service group must be rejected");
static_assert(!validAttServiceGroupEntry(5U, 8U, 6U, 0xFFFFU, 5U),
              "a service group below the requested range must be rejected");
static_assert(validAttCharacteristicEntry(2U, 3U, 1U, 10U, 0U),
              "an ordered characteristic must be accepted");
static_assert(!validAttCharacteristicEntry(2U, 2U, 1U, 10U, 0U),
              "a characteristic value must follow its declaration");
static_assert(!validAttCharacteristicEntry(5U, 6U, 6U, 10U, 5U),
              "a characteristic below the requested range must be rejected");
static_assert(!validAttCharacteristicEntry(3U, 4U, 1U, 10U, 3U),
              "a characteristic declaration must follow the prior value");
static_assert(validAttOrderedHandle(7U, 6U, 10U, 5U),
              "an ordered descriptor handle must be accepted");
static_assert(!validAttOrderedHandle(5U, 6U, 10U, 5U),
              "a non-progressing descriptor handle must be rejected");

void writeLe16(uint8_t* data, uint16_t value) {
  if (data == nullptr) {
    return;
  }
  data[0] = static_cast<uint8_t>(value & 0xFFU);
  data[1] = static_cast<uint8_t>((value >> 8U) & 0xFFU);
}

uint16_t clampValueLen(uint16_t len) {
  if (len > BleRadio::kCustomGattMaxValueLength) {
    return BleRadio::kCustomGattMaxValueLength;
  }
  return len;
}

