lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
constexpr uint8_t securityModeNumber(SecureMode_t mode) {
  return static_cast<uint8_t>(mode) & 0x0FU;
}

constexpr uint8_t securityModeLevel(SecureMode_t mode) {
  return static_cast<uint8_t>(mode) >> 4U;
}

constexpr bool securityModesCanInherit(SecureMode_t characteristic,
                                       SecureMode_t service) {
  return characteristic == SECMODE_NO_ACCESS || service == SECMODE_NO_ACCESS ||
         characteristic == SECMODE_OPEN || service == SECMODE_OPEN ||
         securityModeNumber(characteristic) == securityModeNumber(service);
}

constexpr SecureMode_t inheritServiceSecurity(SecureMode_t characteristic,
                                              SecureMode_t service) {
  if (characteristic == SECMODE_NO_ACCESS || service == SECMODE_NO_ACCESS) {
    return SECMODE_NO_ACCESS;
  }
  if (characteristic == SECMODE_OPEN) {
    return service;
  }
  if (service == SECMODE_OPEN) {
    return characteristic;
  }
  if (securityModeNumber(characteristic) != securityModeNumber(service)) {
    return SECMODE_NO_ACCESS;
  }
  return (securityModeLevel(service) > securityModeLevel(characteristic))
             ? service
             : characteristic;
}

static_assert(inheritServiceSecurity(SECMODE_OPEN, SECMODE_ENC_NO_MITM) ==
                  SECMODE_ENC_NO_MITM,
              "service security must raise an open characteristic");
static_assert(inheritServiceSecurity(SECMODE_ENC_WITH_MITM,
                                     SECMODE_ENC_NO_MITM) ==
                  SECMODE_ENC_WITH_MITM,
              "a stronger characteristic permission must be preserved");
static_assert(inheritServiceSecurity(SECMODE_NO_ACCESS,
                                     SECMODE_ENC_WITH_MITM) ==
                  SECMODE_NO_ACCESS,
              "service inheritance must not open a disabled operation");
static_assert(inheritServiceSecurity(SECMODE_OPEN, SECMODE_NO_ACCESS) ==
                  SECMODE_NO_ACCESS,
              "a disabled service operation must remain disabled");
static_assert(!securityModesCanInherit(SECMODE_SIGNED_NO_MITM,
                                       SECMODE_ENC_WITH_LESC_MITM),
              "signed and encrypted requirements must not be ordered");
static_assert(inheritServiceSecurity(SECMODE_SIGNED_NO_MITM,
                                     SECMODE_ENC_WITH_LESC_MITM) ==
                  SECMODE_NO_ACCESS,
              "incompatible security modes must fail closed");

class ScopedBluefruitUserCallback {
 public:
  ScopedBluefruitUserCallback() { ++depth(); }

  ~ScopedBluefruitUserCallback() {
    if (depth() != 0U) {
      --depth();
    }
  }

  ScopedBluefruitUserCallback(const ScopedBluefruitUserCallback&) = delete;
  ScopedBluefruitUserCallback& operator=(const ScopedBluefruitUserCallback&) = delete;

  static bool active() { return depth() != 0U; }

 private:
  static uint8_t& depth() {
    static uint8_t value = 0U;
    return value;
  }
};

template <typename Callback, typename... Args>
void invokeBluefruitUserCallback(Callback callback, Args&&... args) {
  if (callback == nullptr) {
    return;
  }
  ScopedBluefruitUserCallback scope;
  callback(std::forward<Args>(args)...);
}

bool timeReachedUs(uint64_t now, uint64_t target) {
  return static_cast<int64_t>(now - target) >= 0;
}

uint8_t gapAddressTypeForRandomAddress(const uint8_t address[6]) {
  if (address == nullptr) {
    return BLE_GAP_ADDR_TYPE_RANDOM_STATIC;
  }
  const uint8_t topBits = static_cast<uint8_t>(address[5] & 0xC0U);
  if (topBits == 0x40U) {
    return BLE_GAP_ADDR_TYPE_RANDOM_PRIVATE_RESOLVABLE;
  }
  if (topBits == 0x00U) {
    return BLE_GAP_ADDR_TYPE_RANDOM_PRIVATE_NON_RESOLVABLE;
  }
  return BLE_GAP_ADDR_TYPE_RANDOM_STATIC;
}

bool isNonZeroAddress(const uint8_t address[6]) {
  if (address == nullptr) {
    return false;
  }
  for (uint8_t i = 0U; i < 6U; ++i) {
    if (address[i] != 0U) {
      return true;
    }
  }
  return false;
}

void copyBondAddressToGapAddress(const uint8_t address[6], bool random,
                                 ble_gap_addr_t* outAddress) {
  if (address == nullptr || outAddress == nullptr) {
    return;
  }
  memcpy(outAddress->addr, address, sizeof(outAddress->addr));
  outAddress->addr_type =
      random ? gapAddressTypeForRandomAddress(address) : BLE_GAP_ADDR_TYPE_PUBLIC;
}

void copyHalBondInfoToBluefruit(const xiao_nrf54l15::BleBondInfo& source,
                                ble_gap_bond_info_t* destination) {
  if (destination == nullptr) {
    return;
  }
  ble_gap_bond_info_t info{};
  info.bond_id = source.id;
  copyBondAddressToGapAddress(source.peerAddress,
                              source.peerAddressRandom != 0U,
                              &info.peer_addr);
  copyBondAddressToGapAddress(source.peerIdentityAddress,
                              source.peerIdentityAddressRandom != 0U,
                              &info.peer_identity_addr);
  info.flags = source.flags;
  info.last_used_generation = source.lastUsedGeneration;
  info.schema_fingerprint = source.schemaFingerprint;
  info.service_changed_start_handle = source.serviceChangedStartHandle;
  info.service_changed_end_handle = source.serviceChangedEndHandle;
  memcpy(destination, &info, sizeof(*destination));
}

uint8_t bluefruitAddressTypeFromHal(xiao_nrf54l15::BleAddressType type,
                                    const uint8_t address[6]) {
  (void)address;
  switch (type) {
    case xiao_nrf54l15::BleAddressType::kRandomStatic:
      return BLE_GAP_ADDR_TYPE_RANDOM_STATIC;
    case xiao_nrf54l15::BleAddressType::kRandomPrivateResolvable:
      return BLE_GAP_ADDR_TYPE_RANDOM_PRIVATE_RESOLVABLE;
    case xiao_nrf54l15::BleAddressType::kRandomPrivateNonResolvable:
      return BLE_GAP_ADDR_TYPE_RANDOM_PRIVATE_NON_RESOLVABLE;
    case xiao_nrf54l15::BleAddressType::kPublic:
    default:
      return BLE_GAP_ADDR_TYPE_PUBLIC;
  }
}

xiao_nrf54l15::BleAddressType halAddressTypeFromBluefruit(uint8_t type) {
  switch (type) {
    case BLE_GAP_ADDR_TYPE_RANDOM_STATIC:
      return xiao_nrf54l15::BleAddressType::kRandomStatic;
    case BLE_GAP_ADDR_TYPE_RANDOM_PRIVATE_RESOLVABLE:
      return xiao_nrf54l15::BleAddressType::kRandomPrivateResolvable;
    case BLE_GAP_ADDR_TYPE_RANDOM_PRIVATE_NON_RESOLVABLE:
      return xiao_nrf54l15::BleAddressType::kRandomPrivateNonResolvable;
    case BLE_GAP_ADDR_TYPE_PUBLIC:
    default:
      return xiao_nrf54l15::BleAddressType::kPublic;
  }
}

