lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
bool bluefruitGapAddressValid(const ble_gap_addr_t& address) {
  const uint8_t randomTypeBits = static_cast<uint8_t>(address.addr[5] & 0xC0U);
  switch (address.addr_type) {
    case BLE_GAP_ADDR_TYPE_PUBLIC:
      return true;
    case BLE_GAP_ADDR_TYPE_RANDOM_STATIC:
      return randomTypeBits == 0xC0U;
    case BLE_GAP_ADDR_TYPE_RANDOM_PRIVATE_RESOLVABLE:
      return randomTypeBits == 0x40U;
    case BLE_GAP_ADDR_TYPE_RANDOM_PRIVATE_NON_RESOLVABLE:
      return randomTypeBits == 0x00U;
    default:
      return false;
  }
}

bool bluefruitAdvertisingTypeIsDirected(uint8_t type) {
  return type ==
             BLE_GAP_ADV_TYPE_CONNECTABLE_NONSCANNABLE_DIRECTED_HIGH_DUTY_CYCLE ||
         type == BLE_GAP_ADV_TYPE_CONNECTABLE_NONSCANNABLE_DIRECTED;
}

bool bluefruitAdvertisingTypeIsHighDutyDirected(uint8_t type) {
  return type ==
         BLE_GAP_ADV_TYPE_CONNECTABLE_NONSCANNABLE_DIRECTED_HIGH_DUTY_CYCLE;
}

bool bluefruitAdvertisingTypeToHal(uint8_t type,
                                   xiao_nrf54l15::BleAdvPduType* outType) {
  if (outType == nullptr) {
    return false;
  }
  switch (type) {
    case BLE_GAP_ADV_TYPE_CONNECTABLE_SCANNABLE_UNDIRECTED:
      *outType = xiao_nrf54l15::BleAdvPduType::kAdvInd;
      return true;
    case BLE_GAP_ADV_TYPE_CONNECTABLE_NONSCANNABLE_DIRECTED_HIGH_DUTY_CYCLE:
    case BLE_GAP_ADV_TYPE_CONNECTABLE_NONSCANNABLE_DIRECTED:
      *outType = xiao_nrf54l15::BleAdvPduType::kAdvDirectInd;
      return true;
    case BLE_GAP_ADV_TYPE_NONCONNECTABLE_SCANNABLE_UNDIRECTED:
      *outType = xiao_nrf54l15::BleAdvPduType::kAdvScanInd;
      return true;
    case BLE_GAP_ADV_TYPE_NONCONNECTABLE_NONSCANNABLE_UNDIRECTED:
      *outType = xiao_nrf54l15::BleAdvPduType::kAdvNonConnInd;
      return true;
    default:
      return false;
  }
}

unsigned long schedulerTimeMs() {
  return static_cast<unsigned long>(nrf54l15_core_monotonic_time_ms());
}

uint64_t schedulerTimeUs() { return nrf54l15_core_monotonic_time_us(); }

uint16_t byteSwap16(uint16_t value) {
  return static_cast<uint16_t>((value >> 8U) | (value << 8U));
}

bool uuidMatches(const BLEUuid& uuid, const uint8_t* data, uint8_t dataLen) {
  if (data == nullptr) {
    return false;
  }
  if (uuid.size() == 2U && dataLen == 2U) {
    return uuid.uuid16() == readLe16(data);
  }
  if (uuid.size() == 16U && dataLen == 16U) {
    if (memcmp(uuid.uuid128(), data, 16U) == 0) {
      return true;
    }
    const uint8_t* expected = uuid.uuid128();
    for (uint8_t i = 0U; i < 16U; ++i) {
      if (expected[i] != data[15U - i]) {
        return false;
      }
    }
    return true;
  }
  return false;
}

bool adDataHasUuid(const uint8_t* data, uint16_t len, const BLEUuid& uuid) {
  if (data == nullptr || len == 0U || !uuid.begin()) {
    return false;
  }

  uint16_t offset = 0U;
  while (offset < len) {
    const uint8_t fieldLen = data[offset];
    if (fieldLen == 0U || static_cast<uint16_t>(offset + fieldLen) >= (len + 1U)) {
      break;
    }

    const uint8_t type = data[offset + 1U];
    const uint8_t valueLen = static_cast<uint8_t>(fieldLen - 1U);
    const uint8_t* value = &data[offset + 2U];
    if ((type == BLE_GAP_AD_TYPE_16BIT_SERVICE_UUID_MORE_AVAILABLE ||
         type == BLE_GAP_AD_TYPE_16BIT_SERVICE_UUID_COMPLETE) &&
        uuid.size() == 2U) {
      for (uint8_t pos = 0U; (pos + 2U) <= valueLen; pos = static_cast<uint8_t>(pos + 2U)) {
        if (uuidMatches(uuid, &value[pos], 2U)) {
          return true;
        }
      }
    }
    if ((type == BLE_GAP_AD_TYPE_128BIT_SERVICE_UUID_MORE_AVAILABLE ||
         type == BLE_GAP_AD_TYPE_128BIT_SERVICE_UUID_COMPLETE) &&
        uuid.size() == 16U) {
      for (uint8_t pos = 0U; (pos + 16U) <= valueLen;
           pos = static_cast<uint8_t>(pos + 16U)) {
        if (uuidMatches(uuid, &value[pos], 16U)) {
          return true;
        }
      }
    }
    offset = static_cast<uint16_t>(offset + fieldLen + 1U);
  }
  return false;
}

bool adDataHasMsdCompany(const uint8_t* data, uint16_t len, uint16_t companyId) {
  if (data == nullptr || len == 0U) {
    return false;
  }

  uint16_t offset = 0U;
  while (offset < len) {
    const uint8_t fieldLen = data[offset];
    if (fieldLen == 0U || static_cast<uint16_t>(offset + fieldLen) >= (len + 1U)) {
      break;
    }
    const uint8_t type = data[offset + 1U];
    if (type == BLE_GAP_AD_TYPE_MANUFACTURER_SPECIFIC_DATA && fieldLen >= 3U &&
        readLe16(&data[offset + 2U]) == companyId) {
      return true;
    }
    offset = static_cast<uint16_t>(offset + fieldLen + 1U);
  }
  return false;
}

int copyAdFieldByType(const uint8_t* data, uint16_t len, uint8_t type,
                      void* buffer, uint8_t bufferLen) {
  if (data == nullptr || buffer == nullptr || bufferLen == 0U) {
    return 0;
  }

  uint16_t offset = 0U;
  while (offset < len) {
    const uint8_t fieldLen = data[offset];
    if (fieldLen == 0U || static_cast<uint16_t>(offset + fieldLen) >= (len + 1U)) {
      break;
    }
    const uint8_t fieldType = data[offset + 1U];
    if (fieldType == type) {
      const uint8_t valueLen = static_cast<uint8_t>(fieldLen - 1U);
      const uint8_t copyLen = min<uint8_t>(valueLen, bufferLen);
      memcpy(buffer, &data[offset + 2U], copyLen);
      return copyLen;
    }
    offset = static_cast<uint16_t>(offset + fieldLen + 1U);
  }
  return 0;
}

int hexDigitValue(char c) {
  if (c >= '0' && c <= '9') {
    return c - '0';
  }
  if (c >= 'a' && c <= 'f') {
    return 10 + (c - 'a');
  }
  if (c >= 'A' && c <= 'F') {
    return 10 + (c - 'A');
  }
  return -1;
}

bool parseUuidString(const char* str, uint8_t outUuid[16], uint8_t* outSize,
                     uint16_t* outUuid16) {
  if (str == nullptr || outSize == nullptr || outUuid16 == nullptr) {
    return false;
  }

  const size_t len = strlen(str);
  if (len == 4U) {
    char* end = nullptr;
    const unsigned long value = strtoul(str, &end, 16);
    if (end == nullptr || *end != '\0' || value > 0xFFFFUL) {
      return false;
    }
    *outSize = 2U;
    *outUuid16 = static_cast<uint16_t>(value);
    return true;
  }

  char hex[32] = {0};
  size_t used = 0U;
  for (size_t i = 0U; i < len; ++i) {
    const char c = str[i];
    if (c == '-') {
      continue;
    }
    if (hexDigitValue(c) < 0 || used >= sizeof(hex)) {
      return false;
    }
    hex[used++] = c;
  }
  if (used != 32U) {
    return false;
  }

  uint8_t bigEndian[16] = {0};
  for (size_t i = 0U; i < 16U; ++i) {
    const int hi = hexDigitValue(hex[i * 2U]);
    const int lo = hexDigitValue(hex[i * 2U + 1U]);
    if (hi < 0 || lo < 0) {
      return false;
    }
    bigEndian[i] = static_cast<uint8_t>((hi << 4) | lo);
  }
  for (size_t i = 0U; i < 16U; ++i) {
    outUuid[i] = bigEndian[15U - i];
  }
  *outSize = 16U;
  *outUuid16 = 0U;
  return true;
}

void bleUuid128ToCanonical(const uint8_t littleEndian[16],
                           uint8_t canonical[16]) {
  if (littleEndian == nullptr || canonical == nullptr) {
    return;
  }
  for (size_t i = 0U; i < 16U; ++i) {
    canonical[i] = littleEndian[15U - i];
  }
}

uint8_t mapProperties(uint8_t properties) {
  uint8_t mapped = 0U;
  if ((properties & CHR_PROPS_READ) != 0U) {
    mapped |= xiao_nrf54l15::kBleGattPropRead;
  }
  if ((properties & CHR_PROPS_WRITE_WO_RESP) != 0U) {
    mapped |= xiao_nrf54l15::kBleGattPropWriteNoRsp;
  }
  if ((properties & CHR_PROPS_WRITE) != 0U) {
    mapped |= xiao_nrf54l15::kBleGattPropWrite;
  }
  if ((properties & CHR_PROPS_NOTIFY) != 0U) {
    mapped |= xiao_nrf54l15::kBleGattPropNotify;
  }
  if ((properties & CHR_PROPS_INDICATE) != 0U) {
    mapped |= xiao_nrf54l15::kBleGattPropIndicate;
  }
  if ((properties & CHR_PROPS_AUTH_SIGNED_WRITES) != 0U) {
    mapped |= xiao_nrf54l15::kBleGattPropAuthenticatedSignedWrites;
  }
  return mapped;
}

static uint16_t preferredBleDataLengthFromMtu(uint16_t mtu_max);

uint8_t disconnectReasonToHci(const BleDisconnectDebug& debug) {
  switch (static_cast<BleDisconnectReason>(debug.reason)) {
    case BleDisconnectReason::kApi:
      return BLE_HCI_LOCAL_HOST_TERMINATED_CONNECTION;
    case BleDisconnectReason::kSupervisionTimeout:
      return BLE_HCI_CONNECTION_TIMEOUT;
    case BleDisconnectReason::kPeerTerminate:
      return (debug.errorCode != 0U) ? debug.errorCode
                                     : BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION;
    case BleDisconnectReason::kMicFailure:
      return BLE_HCI_CONNECTION_TERMINATED_DUE_TO_MIC_FAILURE;
    case BleDisconnectReason::kInternalTerminate:
      return (debug.errorCode != 0U) ? debug.errorCode
                                     : BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION;
    case BleDisconnectReason::kNone:
    default:
      return BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION;
  }
}

bool disconnectDebugRemoteTerminated(const BleDisconnectDebug& debug) {
  return static_cast<BleDisconnectReason>(debug.reason) ==
         BleDisconnectReason::kPeerTerminate;
}

