lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
const char* disconnectReasonNameFromHci(uint8_t reason) {
  switch (reason) {
    case BLE_HCI_STATUS_CODE_SUCCESS:
      return "success";
    case BLE_HCI_CONNECTION_TIMEOUT:
      return "connection timeout";
    case BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION:
      return "remote user terminated";
    case BLE_HCI_REMOTE_DEV_TERMINATION_DUE_TO_LOW_RESOURCES:
      return "remote low resources";
    case BLE_HCI_REMOTE_DEV_TERMINATION_DUE_TO_POWER_OFF:
      return "remote power off";
    case BLE_HCI_LOCAL_HOST_TERMINATED_CONNECTION:
      return "local host terminated";
    case BLE_HCI_CONNECTION_TERMINATED_DUE_TO_MIC_FAILURE:
      return "MIC failure";
    case BLE_HCI_CONNECTION_FAILED_TO_BE_ESTABLISHED:
      return "connection failed";
    default:
      return "unknown";
  }
}

class BluefruitCompatManager;
static BluefruitCompatManager* g_bluefruitCompatManager = nullptr;

class BluefruitCompatManager {
 public:
  static constexpr uint32_t kBleActiveIdleSleepCapUs = 1000UL;
  static constexpr unsigned long kBleNoWfiDuringSetupMs = 2000UL;
  static constexpr uint32_t kBleIdleConnectionPollBudgetUs = 0UL;
  static constexpr uint32_t kBleScannerPrewarmLeadUs = 650UL;
  static constexpr uint32_t kBleScannerReadyLeadUs = 80UL;
  static constexpr uint16_t kDirectedHighDutyMaxIntervalUnits = 6U;
  static constexpr uint64_t kDirectedHighDutyMaxDurationUs = 1280000ULL;

  BluefruitCompatManager()
      : started_(false),
        last_connected_(false),
        last_connection_role_(BleConnectionRole::kNone),
        connection_generation_(0U),
        last_connection_edge_ms_(0UL),
        next_adv_due_us_(0U),
        armed_adv_wake_us_(0U),
        next_scan_due_us_(0U),
        armed_scan_wake_us_(0U),
        scan_start_last_us_(0U),
        scan_prewarm_active_(false),
        adv_random_state_(0U),
        adv_started_ms_(0UL),
        directed_high_duty_deadline_us_(0U),
        scan_rsp_name_added_(false),
        gatt_schema_hash_(2166136261UL),
        gatt_schema_hash_finalized_(false),
        characteristic_count_(0U),
        client_service_count_(0U),
        client_characteristic_count_(0U),
        scan_report_data_{},
        scan_report_len_(0U),
        scan_report_channel_valid_(false),
        scan_report_channel_(BleAdvertisingChannel::k37),
        pending_connect_valid_(false),
        pending_connect_channel_valid_(false),
        pending_connect_channel_(BleAdvertisingChannel::k37),
        pending_connect_report_us_(0U),
        pending_connect_random_(0U),
        client_sync_procedure_depth_(0U),
        central_data_length_request_pending_(false),
        central_mtu_request_pending_(false),
        central_explicit_data_length_request_(false),
        central_explicit_mtu_request_valid_(false),
        central_explicit_requested_mtu_(kDefaultAttMtu),
        deferred_connection_phy_request_pending_(false),
        deferred_connection_data_length_request_pending_(false),
        deferred_connection_mtu_request_pending_(false),
        deferred_connection_requested_phy_(BLE_GAP_PHY_AUTO),
        deferred_connection_requested_mtu_(kDefaultAttMtu),
        deferred_connection_phy_next_ms_(0UL),
        deferred_connection_data_length_next_ms_(0UL),
        deferred_connection_mtu_next_ms_(0UL),
        deferred_connection_phy_attempts_(0U),
        deferred_connection_data_length_attempts_(0U),
        deferred_connection_mtu_attempts_(0U),
        central_connect_callback_pending_(false),
        central_connect_callback_not_before_ms_(0UL),
        central_link_config_not_before_ms_(0UL),
        last_connect_attempt_ms_(0UL),
        rssi_monitor_enabled_(false),
        rssi_monitor_threshold_(0xFFU),
        last_reported_rssi_dbm_(0),
        last_reported_rssi_valid_(false),
        security_pairing_in_progress_(false),
        security_secured_callback_pending_(false),
        security_secured_callback_fired_(false),
        security_seen_procedure_active_(false),
        security_last_encrypted_(false),
        security_passkey_request_callback_id_(0UL),
        security_secured_callback_timeout_ms_(0UL),
        deferred_client_value_event_head_(0U),
        deferred_client_value_event_tail_(0U),
        deferred_client_value_event_count_(0U) {
    memset(characteristics_, 0, sizeof(characteristics_));
    memset(client_services_, 0, sizeof(client_services_));
    memset(client_characteristics_, 0, sizeof(client_characteristics_));
    memset(&scan_report_, 0, sizeof(scan_report_));
    memset(pending_connect_address_, 0, sizeof(pending_connect_address_));
    g_bluefruitCompatManager = this;
  }

  ~BluefruitCompatManager() {
    if (g_bluefruitCompatManager == this) {
      g_bluefruitCompatManager = nullptr;
    }
  }

  bool begin(uint8_t prph_count, uint8_t central_count) {
    (void)prph_count;
    (void)central_count;
    if (started_) {
      return true;
    }

    if (!radio_.begin()) {
      return false;
    }
    if (Serial.isConfigured()) {
      Serial.forceReInit();
    }
    if (Serial1.isConfigured()) {
      Serial1.forceReInit();
    }
    radio_.loadAddressFromFicr();
    radio_.setAdvertisingPduType(xiao_nrf54l15::BleAdvPduType::kAdvInd);
    radio_.setAdvertisingChannelSelectionAlgorithm2(false);
    radio_.clearCustomGatt();
    radio_.setGattDeviceName(Bluefruit.device_name_);
    radio_.setGattAppearance(Bluefruit.appearance_);
    radio_.setSecurityIoCapabilities(Bluefruit.Security.io_caps_);
    radio_.setPreferredConnectionParameters(Bluefruit.Periph.conn_interval_min_,
                                            Bluefruit.Periph.conn_interval_max_,
                                            Bluefruit.Periph.conn_latency_,
                                            Bluefruit.Periph.conn_supervision_timeout_);
    // Bluefruit defaults to a 23-byte ATT MTU and 27-byte LL data length
    // unless the sketch explicitly chooses a wider bandwidth profile.
    radio_.setPeripheralPreferredAttMtu(Bluefruit.periph_requested_mtu_);
    radio_.setPeripheralPreferredDataLength(
        preferredBleDataLengthFromMtu(Bluefruit.periph_requested_mtu_));
    radio_.setCentralPreferredAttMtu(Bluefruit.central_requested_mtu_);
    radio_.setCentralPreferredDataLength(
        preferredBleDataLengthFromMtu(Bluefruit.central_requested_mtu_));
    radio_.setCustomGattWriteCallback(&BluefruitCompatManager::gattWriteThunk, this);
    radio_.setGattServiceChangedEnabled(Bluefruit.service_changed_enabled_);
    resetGattSchemaHash();
    (void)Bluefruit.Security.refreshBondedPeerResolving();

    if (Bluefruit.auto_conn_led_) {
      pinMode(LED_BUILTIN, OUTPUT);
      digitalWrite(LED_BUILTIN, kLedOffState);
    }

    started_ = true;
    last_connected_ = radio_.isConnected();
    last_connection_role_ = radio_.connectionRole();
    return true;
  }

  BleRadio& radio() { return radio_; }
  const BleRadio& radio() const { return radio_; }
  uint32_t connectionGeneration() const { return connection_generation_; }

  void beginClientSyncProcedure() {
    if (client_sync_procedure_depth_ < 0xFFU) {
      ++client_sync_procedure_depth_;
    }
  }

