lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
  void endClientSyncProcedure() {
    if (client_sync_procedure_depth_ > 0U) {
      --client_sync_procedure_depth_;
    }
  }

  bool clientSyncProcedureActive() const {
    return client_sync_procedure_depth_ != 0U;
  }

  void clearCentralScannerTransientState() {
    pending_connect_valid_ = false;
    pending_connect_channel_valid_ = false;
    pending_connect_report_us_ = 0U;
    scan_report_channel_valid_ = false;
    last_connect_attempt_ms_ = 0UL;
  }

  bool stopScanner() {
    const bool wasActive = Bluefruit.Scanner.running_ ||
                           Bluefruit.Scanner.paused_ ||
                           pending_connect_valid_;
    Bluefruit.Scanner.running_ = false;
    Bluefruit.Scanner.paused_ = false;
    Bluefruit.Scanner.timeout_s_ = 0U;
    clearCentralScannerTransientState();
    if (scan_prewarm_active_ && !radio_.isConnected()) {
      radio_.endForegroundUnconnectedRadioActivity();
      scan_prewarm_active_ = false;
    }
    nrf54l15_ble_idle_wake_cancel();
    armed_scan_wake_us_ = 0U;
    next_scan_due_us_ = 0U;
    return wasActive;
  }

  void resetScannerSchedule() {
    if (scan_prewarm_active_ && !radio_.isConnected()) {
      radio_.endForegroundUnconnectedRadioActivity();
      scan_prewarm_active_ = false;
    }
    nrf54l15_ble_idle_wake_cancel();
    armed_scan_wake_us_ = 0U;
    next_scan_due_us_ = 0U;
  }

  bool deferConnectionPhyRequest(uint8_t phy) {
    if (!radio_.isConnected()) {
      return false;
    }
    const uint8_t normalized = normalizeBluefruitPhy(phy);
    if (normalized == BLE_GAP_PHY_AUTO) {
      return false;
    }
    deferred_connection_requested_phy_ = normalized;
    deferred_connection_phy_request_pending_ = true;
    deferred_connection_phy_attempts_ = 0U;
    deferred_connection_phy_next_ms_ =
        millis() + kDeferredPhyRequestInitialDelayMs;
    return true;
  }

  bool deferConnectionDataLengthUpdate() {
    if (!radio_.isConnected()) {
      return false;
    }
    deferred_connection_data_length_request_pending_ = true;
    deferred_connection_data_length_attempts_ = 0U;
    deferred_connection_data_length_next_ms_ =
        millis() + kDeferredLinkRequestInitialDelayMs;
    return true;
  }

  bool deferConnectionMtuExchange(uint16_t mtu) {
    if (!radio_.isConnected()) {
      return false;
    }
    if (mtu < kDefaultAttMtu) {
      mtu = kDefaultAttMtu;
    }
    deferred_connection_requested_mtu_ = mtu;
    deferred_connection_mtu_request_pending_ = true;
    deferred_connection_mtu_attempts_ = 0U;
    deferred_connection_mtu_next_ms_ =
        millis() + kDeferredLinkRequestInitialDelayMs;
    return true;
  }

  void noteExplicitDataLengthRequest() {
    if (!radio_.isConnected()) {
      return;
    }
    const BleConnectionRole role = radio_.connectionRole();
    if (role == BleConnectionRole::kCentral) {
      central_explicit_data_length_request_ = true;
      radio_.setCentralPreferredDataLength(251U);
    } else if (role == BleConnectionRole::kPeripheral) {
      radio_.setPeripheralPreferredDataLength(251U);
    }
  }

  void noteExplicitCentralMtuRequest(uint16_t mtu) {
    if (!radio_.isConnected() ||
        radio_.connectionRole() != BleConnectionRole::kCentral) {
      return;
    }
    if (mtu < kDefaultAttMtu) {
      mtu = kDefaultAttMtu;
    } else if (mtu > 247U) {
      mtu = 247U;
    }
    central_explicit_mtu_request_valid_ = true;
    central_explicit_requested_mtu_ = mtu;
  }

  uint16_t centralAutomaticMtuCeiling() const {
    uint16_t mtu = central_explicit_mtu_request_valid_
                       ? central_explicit_requested_mtu_
                       : Bluefruit.central_requested_mtu_;
    if (mtu < kDefaultAttMtu) {
      mtu = kDefaultAttMtu;
    } else if (mtu > 247U) {
      mtu = 247U;
    }
    return mtu;
  }

  uint16_t centralAutomaticDataLengthCeiling() const {
    if (central_explicit_data_length_request_) {
      return 251U;
    }
    return preferredBleDataLengthFromMtu(centralAutomaticMtuCeiling());
  }

  uint16_t clientAutomaticMtuCeiling() const {
    if (radio_.connectionRole() == BleConnectionRole::kPeripheral) {
      return min<uint16_t>(247U, max<uint16_t>(23U,
                                               Bluefruit.periph_requested_mtu_));
    }
    return centralAutomaticMtuCeiling();
  }

  uint16_t clientAutomaticDataLengthCeiling() const {
    if (radio_.connectionRole() == BleConnectionRole::kPeripheral) {
      return preferredBleDataLengthFromMtu(clientAutomaticMtuCeiling());
    }
    return centralAutomaticDataLengthCeiling();
  }

  bool registerCharacteristic(BLECharacteristic* characteristic) {
    if (characteristic == nullptr || characteristic_count_ >= kMaxCharacteristics) {
      return false;
    }
    characteristics_[characteristic_count_++] = characteristic;
    return true;
  }

  void noteGattService(const BLEService* service) {
    if (service == nullptr) {
      return;
    }
    gattSchemaHashByte(0x53U);
    gattSchemaHashU16(service->_handle);
    gattSchemaHashUuid(service->uuid);
    gatt_schema_hash_finalized_ = false;
  }

  void noteGattCharacteristic(
      const BLECharacteristic* characteristic, SecureMode_t readPermission,
      SecureMode_t writePermission, SecureMode_t reportReferenceReadPermission,
      const BleRadio::BleCustomGattDescriptorHandles& descriptorHandles) {
    if (characteristic == nullptr) {
      return;
    }
    gattSchemaHashByte(0x43U);
    gattSchemaHashU16(characteristic->_service != nullptr
                          ? characteristic->_service->_handle
                          : 0U);
    gattSchemaHashUuid(characteristic->uuid);
    gattSchemaHashByte(characteristic->_properties);
    gattSchemaHashByte(static_cast<uint8_t>(readPermission));
    gattSchemaHashByte(static_cast<uint8_t>(writePermission));
    gattSchemaHashByte(static_cast<uint8_t>(reportReferenceReadPermission));
    gattSchemaHashU16(characteristic->_max_len);
    gattSchemaHashByte(characteristic->_fixed_len ? 1U : 0U);
    gattSchemaHashU16(characteristic->_handles.decl_handle);
    gattSchemaHashU16(characteristic->_handles.value_handle);
    gattSchemaHashU16(characteristic->_handles.cccd_handle);
    gattSchemaHashU16(characteristic->_handles.user_desc_handle);
    gattSchemaHashU16(descriptorHandles.presentationFormatHandle);
    gattSchemaHashU16(descriptorHandles.reportReferenceHandle);
    gattSchemaHashByte(characteristic->_usr_descriptor != nullptr &&
                               characteristic->_usr_descriptor[0] != '\0'
                           ? 1U
                           : 0U);
    gattSchemaHashByte(characteristic->_presentation_format_valid ? 1U : 0U);
    gattSchemaHashByte(characteristic->_report_ref_valid ? 1U : 0U);
    gatt_schema_hash_finalized_ = false;
  }

  bool finalizeGattSchema() {
    const uint32_t fingerprint =
        (gatt_schema_hash_ != 0U) ? gatt_schema_hash_ : 1U;
    radio_.setGattServiceChangedEnabled(Bluefruit.service_changed_enabled_);
    if (!radio_.commitGattSchemaFingerprint(fingerprint)) {
      return false;
    }
    gatt_schema_hash_finalized_ = true;
    return true;
  }

  void configureServiceChanged(bool enabled) {
    radio_.setGattServiceChangedEnabled(enabled);
    if (started_ && gatt_schema_hash_finalized_) {
      const uint32_t fingerprint =
          (gatt_schema_hash_ != 0U) ? gatt_schema_hash_ : 1U;
      (void)radio_.commitGattSchemaFingerprint(fingerprint);
    }
  }

  bool registerClientCharacteristic(BLEClientCharacteristic* characteristic) {
    if (characteristic == nullptr) {
      return false;
    }
    for (uint8_t i = 0U; i < client_characteristic_count_; ++i) {
      if (client_characteristics_[i] == characteristic) {
        return true;
      }
    }
    if (client_characteristic_count_ >= kMaxClientCharacteristics) {
      return false;
    }
    client_characteristics_[client_characteristic_count_++] = characteristic;
    return true;
  }

