lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
  bool registerClientService(BLEClientService* service) {
    if (service == nullptr) {
      return false;
    }
    for (uint8_t i = 0U; i < client_service_count_; ++i) {
      if (client_services_[i] == service) {
        return true;
      }
    }
    if (client_service_count_ >= kMaxClientServices) {
      return false;
    }
    client_services_[client_service_count_++] = service;
    return true;
  }

  void unregisterClientCharacteristic(
      BLEClientCharacteristic* characteristic) {
    if (characteristic == nullptr) {
      return;
    }
    clearDeferredClientValueEvents(characteristic);
    for (uint8_t i = 0U; i < client_characteristic_count_; ++i) {
      if (client_characteristics_[i] != characteristic) {
        continue;
      }
      for (uint8_t next = static_cast<uint8_t>(i + 1U);
           next < client_characteristic_count_; ++next) {
        client_characteristics_[next - 1U] = client_characteristics_[next];
      }
      --client_characteristic_count_;
      client_characteristics_[client_characteristic_count_] = nullptr;
      break;
    }
    characteristic->resetDiscovery();
    characteristic->service_ = nullptr;
    characteristic->begun_ = false;
  }

  void unregisterClientService(BLEClientService* service) {
    if (service == nullptr) {
      return;
    }

    // Characteristics cannot outlive an implicit or explicit parent service.
    // Detach them from both callback dispatch and future discovery so begin()
    // can bind them to a live service again.
    uint8_t characteristicIndex = 0U;
    while (characteristicIndex < client_characteristic_count_) {
      BLEClientCharacteristic* characteristic =
          client_characteristics_[characteristicIndex];
      if (characteristic != nullptr && characteristic->service_ == service) {
        unregisterClientCharacteristic(characteristic);
      } else {
        ++characteristicIndex;
      }
    }

    for (uint8_t i = 0U; i < client_service_count_; ++i) {
      if (client_services_[i] != service) {
        continue;
      }
      for (uint8_t next = static_cast<uint8_t>(i + 1U);
           next < client_service_count_; ++next) {
        client_services_[next - 1U] = client_services_[next];
      }
      --client_service_count_;
      client_services_[client_service_count_] = nullptr;
      break;
    }

    service->resetDiscovery();
    service->begun_ = false;
    if (BLEClientService::lastService == service) {
      BLEClientService::lastService =
          (client_service_count_ > 0U)
              ? client_services_[client_service_count_ - 1U]
              : nullptr;
    }
  }

  void resetClientDiscoveryState() {
    clearDeferredClientValueEvents();
    for (uint8_t i = 0U; i < client_characteristic_count_; ++i) {
      if (client_characteristics_[i] != nullptr) {
        client_characteristics_[i]->resetDiscovery();
      }
    }
    for (uint8_t i = 0U; i < client_service_count_; ++i) {
      if (client_services_[i] != nullptr) {
        client_services_[i]->resetDiscovery();
      }
    }
    for (uint8_t i = 0U; i < BLEClientUart::instance_count_; ++i) {
      BLEClientUart* uart = BLEClientUart::instances_[i];
      if (uart != nullptr) {
        uart->discovered_ = false;
        uart->rx_head_ = 0U;
        uart->rx_tail_ = 0U;
        uart->rx_count_ = 0U;
      }
    }
  }

  bool enqueueDeferredClientValueEvent(
      BLEClientCharacteristic* characteristic, const uint8_t* data,
      uint16_t len, uint8_t attOpcode, uint32_t connectionGeneration) {
    if (characteristic == nullptr || (data == nullptr && len != 0U) ||
        (attOpcode != kAttOpHandleValueNtf &&
         attOpcode != kAttOpHandleValueInd) ||
        connectionGeneration == 0U ||
        connectionGeneration != connection_generation_ ||
        deferred_client_value_event_count_ >=
            kDeferredClientValueEventQueueDepth) {
      return false;
    }

    DeferredClientValueEvent& event =
        deferred_client_value_events_[deferred_client_value_event_head_];
    event.characteristic = characteristic;
    event.att_opcode = attOpcode;
    event.connection_generation = connectionGeneration;
    event.len = min<uint16_t>(len, sizeof(event.data));
    if (event.len > 0U) {
      memcpy(event.data, data, event.len);
    }
    deferred_client_value_event_head_ = static_cast<uint8_t>(
        (deferred_client_value_event_head_ + 1U) %
        kDeferredClientValueEventQueueDepth);
    ++deferred_client_value_event_count_;
    return true;
  }

  void clearDeferredClientValueEvents(
      BLEClientCharacteristic* characteristic = nullptr) {
    uint8_t retained = 0U;
    for (uint8_t i = 0U; i < deferred_client_value_event_count_; ++i) {
      const uint8_t sourceIndex = static_cast<uint8_t>(
          (deferred_client_value_event_tail_ + i) %
          kDeferredClientValueEventQueueDepth);
      if (characteristic == nullptr ||
          deferred_client_value_events_[sourceIndex].characteristic ==
              characteristic) {
        continue;
      }
      const uint8_t destinationIndex = static_cast<uint8_t>(
          (deferred_client_value_event_tail_ + retained) %
          kDeferredClientValueEventQueueDepth);
      if (destinationIndex != sourceIndex) {
        deferred_client_value_events_[destinationIndex] =
            deferred_client_value_events_[sourceIndex];
      }
      ++retained;
    }
    deferred_client_value_event_count_ = retained;
    deferred_client_value_event_head_ = static_cast<uint8_t>(
        (deferred_client_value_event_tail_ + retained) %
        kDeferredClientValueEventQueueDepth);
  }

  void markAdvertisingDirty() {
    Bluefruit.Advertising.dirty_ = true;
    Bluefruit.ScanResponse.dirty_ = true;
  }

  void advertisingStarted() {
    adv_started_ms_ = schedulerTimeMs();
    directed_high_duty_deadline_us_ =
        bluefruitAdvertisingTypeIsHighDutyDirected(
            Bluefruit.Advertising.adv_type_)
            ? schedulerTimeUs() + kDirectedHighDutyMaxDurationUs
            : 0ULL;
    next_adv_due_us_ = 0U;
    nrf54l15_ble_idle_wake_cancel();
    armed_adv_wake_us_ = 0U;
    nrf54l15_ble_background_radio_release();
    adv_random_state_ = 0U;
  }

