lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
    const uint64_t remainingUs64 = next_scan_due_us_ - nowUs;
    const uint32_t remainingUs =
        (remainingUs64 > 0xFFFFFFFFULL)
            ? 0xFFFFFFFFUL
            : static_cast<uint32_t>(remainingUs64);
    const uint32_t wakeLeadUs =
        scan_prewarm_active_ ? kBleScannerReadyLeadUs
                             : kBleScannerPrewarmLeadUs;
    const bool allowed = remainingUs > wakeLeadUs;
    if (allowed) {
      ++g_bluefruitBleIdleDiagIdleYieldAllowCount;
    } else {
      ++g_bluefruitBleIdleDiagIdleYieldDenyCount;
    }
    updateBleIdleDiagSnapshot(nowUs, kBluefruitBleIdleDiagStageScanSleeping,
                              remainingUs);
    return allowed;
  }

  void dispatchDeferredUserCallbacks() {
    if (ScopedBluefruitUserCallback::active()) {
      return;
    }
    dispatchGattAuthorizationRequest();
    while (deferred_client_value_event_count_ > 0U) {
      DeferredClientValueEvent& event =
          deferred_client_value_events_[deferred_client_value_event_tail_];
      BLEClientCharacteristic* characteristic = event.characteristic;
      const uint16_t len = event.len;
      const uint8_t attOpcode = event.att_opcode;
      const uint32_t eventGeneration = event.connection_generation;
      const bool current =
          eventGeneration != 0U && eventGeneration == connection_generation_ &&
          radio_.isConnected() &&
          radio_.connectionRole() == BleConnectionRole::kCentral &&
          characteristic != nullptr && characteristic->discovered_ &&
          characteristic->conn_handle_ == 0U &&
          characteristic->discovery_generation_ == eventGeneration;
      if (current && len > 0U) {
        memcpy(characteristic->last_value_, event.data, len);
      }
      deferred_client_value_event_tail_ = static_cast<uint8_t>(
          (deferred_client_value_event_tail_ + 1U) %
          kDeferredClientValueEventQueueDepth);
      --deferred_client_value_event_count_;

      if (!current) {
        continue;
      }
      characteristic->last_value_len_ = len;
      characteristic->dispatchValueEventCallback(attOpcode);
    }
  }

  void dispatchGattAuthorizationRequest() {
    if (ScopedBluefruitUserCallback::active()) {
      return;
    }

    BleGattAuthorizeRequest request{};
    if (!radio_.consumeCustomGattAuthorizeRequest(&request)) {
      return;
    }

    BLECharacteristic* characteristic = nullptr;
    for (uint8_t i = 0U; i < characteristic_count_; ++i) {
      BLECharacteristic* candidate = characteristics_[i];
      if (candidate != nullptr &&
          candidate->_handles.value_handle == request.handle) {
        characteristic = candidate;
        break;
      }
    }

    const auto rejectMissingCallback = [&]() {
      (void)radio_.replyCustomGattAuthorization(
          request.type, BLE_GATT_STATUS_ATTERR_INSUF_AUTHORIZATION, false,
          0U, nullptr, 0U);
    };
    if (characteristic == nullptr) {
      rejectMissingCallback();
      return;
    }

    ble_uuid_t eventUuid{};
    if (request.uuidSize == 2U) {
      eventUuid.uuid = readLe16(request.uuid);
      eventUuid.type = BLE_UUID_TYPE_BLE;
    } else if (request.uuidSize == 16U) {
      eventUuid.uuid = readLe16(&request.uuid[12]);
      eventUuid.type = BLE_UUID_TYPE_VENDOR_BEGIN;
    }

    if (request.type == BleGattAuthorizeType::kRead) {
      if (characteristic->_rd_authorize_cb == nullptr) {
        rejectMissingCallback();
        return;
      }
      ble_gatts_evt_read_t event{};
      event.handle = request.handle;
      event.uuid = eventUuid;
      event.offset = request.offset;
      invokeBluefruitUserCallback(characteristic->_rd_authorize_cb, 0U,
                                  characteristic, &event);
      return;
    }

    if (request.type == BleGattAuthorizeType::kWrite) {
      if (characteristic->_wr_authorize_cb == nullptr) {
        rejectMissingCallback();
        return;
      }
      alignas(ble_gatts_evt_write_t) uint8_t eventStorage[
          sizeof(ble_gatts_evt_write_t) +
          BleRadio::kCustomGattMaxValueLength - 1U] = {0};
      auto* event =
          reinterpret_cast<ble_gatts_evt_write_t*>(eventStorage);
      event->handle = request.handle;
      event->uuid = eventUuid;
      event->op = request.operation;
      event->auth_required = 1U;
      event->offset = request.offset;
      event->len = request.valueLength;
      if (event->len > 0U) {
        memcpy(event->data, request.value, event->len);
      }
      invokeBluefruitUserCallback(characteristic->_wr_authorize_cb, 0U,
                                  characteristic, event);
      return;
    }

    rejectMissingCallback();
  }

  void maybeDispatchCentralConnectCallback() {
    if (!central_connect_callback_pending_ ||
        Bluefruit.Central.connect_callback_ == nullptr ||
        !radio_.isConnected() ||
        radio_.connectionRole() != BleConnectionRole::kCentral) {
      return;
    }
    if (static_cast<int32_t>(millis() - central_connect_callback_not_before_ms_) < 0) {
      return;
    }

    central_connect_callback_pending_ = false;
    central_connect_callback_not_before_ms_ = 0UL;
    invokeBluefruitUserCallback(Bluefruit.Central.connect_callback_, 0U);
    // After the user callback (which may stall for seconds), resynchronize
    // the central's event counter/channel with the peripheral. The callback
    // blocks polling, so the central falls behind and ends up on the wrong
    // channel. Poll until we get a CRC-OK event to confirm alignment.
    // Do NOT pre-advance the counter — the central's timer drifts from the
    // peripheral's, so a calculated catch-up can overshoot. Instead, walk
    // through events one at a time; pollCentralConnectionEvent waits for
    // each event (advancing 1/event) so the central naturally locks on.
    if (radio_.isConnected() && radio_.connectionRole() == BleConnectionRole::kCentral) {
      const unsigned long resyncStartMs = millis();
      while (radio_.isConnected() && (millis() - resyncStartMs) < 5000UL) {
        BleConnectionEvent event{};
        if (radio_.pollConnectionEvent(&event, 120000UL)) {
          handleClientConnectionEvent(event);
          if (event.terminateInd) break;
          if (event.eventStarted && event.crcOk && event.packetReceived) {
            break;  // Channel aligned
          }
        }
        // No delay needed — pollCentralConnectionEvent already waits for the
        // next event when late, advancing the counter 1/event to match the
        // peripheral's rate. Adding delay would make the central lag behind.
      }
    }
  }

