lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
 private:
  static constexpr uint8_t kMaxCharacteristics = 24U;
  static constexpr uint8_t kMaxClientServices = 20U;
  static constexpr uint8_t kMaxClientCharacteristics = 40U;
  static constexpr uint8_t kDeferredClientValueEventQueueDepth = 8U;
  struct DeferredClientValueEvent {
    BLEClientCharacteristic* characteristic;
    uint8_t att_opcode;
    uint32_t connection_generation;
    uint16_t len;
    uint8_t data[BLUEFRUIT_GATT_VALUE_MAX_LEN];
  };

  void advanceConnectionGeneration() {
    ++connection_generation_;
    if (connection_generation_ == 0U) {
      ++connection_generation_;
    }
  }

  void gattSchemaHashByte(uint8_t value) {
    gatt_schema_hash_ ^= value;
    gatt_schema_hash_ *= 16777619UL;
  }

  void gattSchemaHashU16(uint16_t value) {
    gattSchemaHashByte(static_cast<uint8_t>(value & 0xFFU));
    gattSchemaHashByte(static_cast<uint8_t>((value >> 8U) & 0xFFU));
  }

  void gattSchemaHashUuid(const BLEUuid& uuid) {
    const size_t uuidSize = uuid.size();
    gattSchemaHashByte(static_cast<uint8_t>(uuidSize));
    if (uuidSize == 2U) {
      gattSchemaHashU16(uuid.uuid16());
    } else if (uuidSize == 16U) {
      const uint8_t* bytes = uuid.uuid128();
      if (bytes != nullptr) {
        for (uint8_t i = 0U; i < 16U; ++i) {
          gattSchemaHashByte(bytes[i]);
        }
      }
    }
  }

  void resetGattSchemaHash() {
    static constexpr uint8_t kBuiltInGattSchemaVersion[] = {
        'G', 'A', 'T', 'T', '-', 'R', 'C', '-', '2'};
    gatt_schema_hash_ = 2166136261UL;
    for (uint8_t value : kBuiltInGattSchemaVersion) {
      gattSchemaHashByte(value);
    }
    gatt_schema_hash_finalized_ = false;
  }

  static constexpr uint16_t kDefaultDataLength = 27U;
  static constexpr uint16_t kDefaultAttMtu = 23U;
  static constexpr uint32_t kScannerMinIntervalUs = 2500UL;
  static constexpr uint32_t kScannerMinWindowUs = 2500UL;
  static constexpr uint32_t kScannerMinRestUs = 1000UL;
  static constexpr uint32_t kScannerMinDwellBudgetUs = 2500UL;
  static constexpr uint32_t kScannerMaxDwellBudgetUs = 30000UL;
  static constexpr uint32_t kScannerScanRspBudgetUs = 2500UL;
  static constexpr uint32_t kCentralConnectCandidateMaxAgeUs = 200000UL;
  static constexpr uint32_t kCentralConnectMinBudgetUs = 180000UL;
  static constexpr uint32_t kCentralConnectMaxBudgetUs = 220000UL;
  static constexpr uint16_t kDeferredDataLengthTarget =
      static_cast<uint16_t>(BleRadio::kCustomGattMaxValueLength + 7U);
  static constexpr unsigned long kDeferredPhyRequestInitialDelayMs = 1500UL;
  static constexpr unsigned long kDeferredLinkRequestInitialDelayMs = 250UL;
  static constexpr unsigned long kDeferredLinkRequestRetryMs = 500UL;
  static constexpr uint8_t kDeferredLinkRequestMaxAttempts = 20U;

  uint32_t foregroundAdvertisingRandomDelayUs() {
    if (adv_random_state_ == 0U) {
      adv_random_state_ =
          static_cast<uint32_t>(schedulerTimeUs()) ^ 0x5A17B1E5UL;
    }
    adv_random_state_ = adv_random_state_ * 1103515245UL + 12345UL;
    return adv_random_state_ % 10001UL;
  }

  static uint32_t scannerUnitsToUs(uint16_t units) {
    const uint32_t us = static_cast<uint32_t>(units) * 625UL;
    return (us < kScannerMinIntervalUs) ? kScannerMinIntervalUs : us;
  }

  uint32_t scannerIntervalUs() const {
    const bool useLowPower =
        Bluefruit.Scanner.low_power_after_ms_ != 0U &&
        Bluefruit.Scanner.low_power_interval_ != 0U &&
        ((schedulerTimeMs() - Bluefruit.Scanner.started_ms_) >=
         Bluefruit.Scanner.low_power_after_ms_);
    return scannerUnitsToUs(useLowPower ? Bluefruit.Scanner.low_power_interval_
                                        : Bluefruit.Scanner.interval_);
  }

  uint32_t scannerWindowUs(uint32_t intervalUs) const {
    const bool useLowPower =
        Bluefruit.Scanner.low_power_after_ms_ != 0U &&
        Bluefruit.Scanner.low_power_window_ != 0U &&
        ((schedulerTimeMs() - Bluefruit.Scanner.started_ms_) >=
         Bluefruit.Scanner.low_power_after_ms_);
    uint32_t windowUs = scannerUnitsToUs(useLowPower ? Bluefruit.Scanner.low_power_window_
                                                     : Bluefruit.Scanner.window_);
    if (windowUs > intervalUs) {
      windowUs = intervalUs;
    }
    return (windowUs < kScannerMinWindowUs) ? kScannerMinWindowUs : windowUs;
  }

  uint32_t scannerDwellBudgetUs(uint32_t windowUs) const {
    // The budgeted scan path listens on one advertising channel per scheduled
    // window and rotates channels. Keep the dwell aligned to the configured
    // Bluefruit scan window instead of approximating it with spin loops.
    uint32_t dwellUs = windowUs;
    if (dwellUs < kScannerMinDwellBudgetUs) {
      dwellUs = kScannerMinDwellBudgetUs;
    } else if (dwellUs > kScannerMaxDwellBudgetUs) {
      dwellUs = kScannerMaxDwellBudgetUs;
    }
    return dwellUs;
  }

  uint32_t scannerScanRspBudgetUs(uint32_t dwellBudgetUs) const {
    return (dwellBudgetUs < kScannerScanRspBudgetUs) ? dwellBudgetUs
                                                     : kScannerScanRspBudgetUs;
  }

  uint32_t centralConnectBudgetUs() const {
    const uint32_t intervalUs = scannerIntervalUs();
    const uint32_t windowUs = scannerWindowUs(intervalUs);
    uint32_t budgetUs = windowUs;
    if (budgetUs < kCentralConnectMinBudgetUs) {
      budgetUs = kCentralConnectMinBudgetUs;
    } else if (budgetUs > kCentralConnectMaxBudgetUs) {
      budgetUs = kCentralConnectMaxBudgetUs;
    }
    return budgetUs;
  }

  BleRadio radio_;
  bool started_;
  bool last_connected_;
  BleConnectionRole last_connection_role_;
  uint32_t connection_generation_;
  unsigned long last_connection_edge_ms_;
  uint64_t next_adv_due_us_;
  uint64_t armed_adv_wake_us_;
  uint64_t next_scan_due_us_;
  uint64_t armed_scan_wake_us_;
  uint64_t scan_start_last_us_;
  bool scan_prewarm_active_;
  uint32_t adv_random_state_;
  unsigned long adv_started_ms_;
  uint64_t directed_high_duty_deadline_us_;
  bool scan_rsp_name_added_;
  uint32_t gatt_schema_hash_;
  bool gatt_schema_hash_finalized_;
  BLECharacteristic* characteristics_[kMaxCharacteristics];
  uint8_t characteristic_count_;
  BLEClientService* client_services_[kMaxClientServices];
  uint8_t client_service_count_;
  BLEClientCharacteristic* client_characteristics_[kMaxClientCharacteristics];
  uint8_t client_characteristic_count_;
  BLEConnection connection_;
  ble_gap_evt_adv_report_t scan_report_;
  uint8_t scan_report_data_[31];
  uint8_t scan_report_len_;
  bool scan_report_channel_valid_;
  BleAdvertisingChannel scan_report_channel_;
  bool pending_connect_valid_;
  uint8_t pending_connect_address_[6];
  bool pending_connect_channel_valid_;
  BleAdvertisingChannel pending_connect_channel_;
  uint64_t pending_connect_report_us_;
  uint8_t pending_connect_random_;
  uint8_t client_sync_procedure_depth_;
  bool central_data_length_request_pending_;
  bool central_mtu_request_pending_;
  bool central_explicit_data_length_request_;
  bool central_explicit_mtu_request_valid_;
  uint16_t central_explicit_requested_mtu_;
  bool deferred_connection_phy_request_pending_;
  bool deferred_connection_data_length_request_pending_;
  bool deferred_connection_mtu_request_pending_;
  uint8_t deferred_connection_requested_phy_;
  uint16_t deferred_connection_requested_mtu_;
  unsigned long deferred_connection_phy_next_ms_;
  unsigned long deferred_connection_data_length_next_ms_;
  unsigned long deferred_connection_mtu_next_ms_;
  uint8_t deferred_connection_phy_attempts_;
  uint8_t deferred_connection_data_length_attempts_;
  uint8_t deferred_connection_mtu_attempts_;
  bool central_connect_callback_pending_;
  unsigned long central_connect_callback_not_before_ms_;
  unsigned long central_link_config_not_before_ms_;
  unsigned long last_connect_attempt_ms_;
  bool rssi_monitor_enabled_;
  uint8_t rssi_monitor_threshold_;
  int8_t last_reported_rssi_dbm_;
  bool last_reported_rssi_valid_;
  bool security_pairing_in_progress_;
  bool security_secured_callback_pending_;
  bool security_secured_callback_fired_;
  bool security_seen_procedure_active_;
  bool security_last_encrypted_;
  uint32_t security_passkey_request_callback_id_;
  unsigned long security_secured_callback_timeout_ms_;
  DeferredClientValueEvent deferred_client_value_events_[
      kDeferredClientValueEventQueueDepth];
  uint8_t deferred_client_value_event_head_;
  uint8_t deferred_client_value_event_tail_;
  uint8_t deferred_client_value_event_count_;

