lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
BluefruitCompatManager& manager() {
  static BluefruitCompatManager instance;
  return instance;
}

static BluefruitCompatManager* managerIfAlive() {
  return g_bluefruitCompatManager;
}

extern "C" uint8_t nrf54l15_clean_ble_idle_yield_wfi_allowed(void) {
  return manager().idleYieldWfiAllowed() ? 1U : 0U;
}

BLESecurity::BLESecurity()
    : secured_callback_(nullptr),
      pair_passkey_callback_(nullptr),
      pair_passkey_request_callback_(nullptr),
      pair_complete_callback_(nullptr),
      io_caps_(0x03U),
      fixed_pin_valid_(false),
      fixed_pin_{0},
      oob_enabled_(false),
      oob_local_valid_(false),
      oob_remote_valid_(false),
      oob_local_r_{0},
      oob_local_c_{0},
      oob_remote_r_{0},
      oob_remote_c_{0},
      oob_data_request_callback_(nullptr),
      auto_bonded_peer_resolving_(false),
      auto_bonded_peer_irk_owned_(false),
      auto_bonded_peer_irk_{0},
      resolving_list_count_(0),
      resolving_list_irks_{{0}},
      resolving_list_sources_{0} {}

void BLESecurity::setSecuredCallback(secured_callback_t fp) {
  secured_callback_ = fp;
}

bool BLESecurity::setPairPasskeyCallback(pair_passkey_callback_t fp) {
  pair_passkey_callback_ = fp;
  setMITM(true);
  return true;
}

void BLESecurity::setPairPasskeyRequestCallback(pair_passkey_req_cb_t fp) {
  pair_passkey_request_callback_ = fp;
  setMITM(true);
}

void BLESecurity::setPairCompleteCallback(pair_complete_callback_t fp) {
  pair_complete_callback_ = fp;
}

void BLESecurity::setIOCaps(uint8_t ioCaps) {
  if (ioCaps > 0x04U) {
    ioCaps = 0x03U;
  }
  io_caps_ = ioCaps;
  manager().radio().setSecurityIoCapabilities(ioCaps);
}

void BLESecurity::setIOCaps(bool display, bool yesNo, bool keyboard) {
  uint8_t ioCaps = 0x03U;
  if (display && keyboard) {
    ioCaps = 0x04U;
  } else if (keyboard) {
    ioCaps = 0x02U;
  } else if (display && yesNo) {
    ioCaps = 0x01U;
  } else if (display) {
    ioCaps = 0x00U;
  }
  setIOCaps(ioCaps);
}

void BLESecurity::setMITM(bool enabled) {
  BleSecurityPolicy policy = manager().radio().getSecurityPolicy();
  policy.mitmRequired = enabled;
  (void)manager().radio().setSecurityPolicy(policy);
}

bool BLESecurity::setBondingEnabled(bool enabled) {
  BleSecurityPolicy policy = manager().radio().getSecurityPolicy();
  policy.bondingEnabled = enabled;
  return manager().radio().setSecurityPolicy(policy);
}

bool BLESecurity::setSecureConnectionsEnabled(bool enabled) {
  BleSecurityPolicy policy = manager().radio().getSecurityPolicy();
  if (!enabled && policy.secureConnectionsRequired) {
    return false;
  }
  policy.secureConnectionsEnabled = enabled;
  return manager().radio().setSecurityPolicy(policy);
}

bool BLESecurity::setSecureConnectionsRequired(bool required) {
  BleSecurityPolicy policy = manager().radio().getSecurityPolicy();
  policy.secureConnectionsRequired = required;
  if (required) {
    policy.secureConnectionsEnabled = true;
  }
  return manager().radio().setSecurityPolicy(policy);
}

bool BLESecurity::setEncryptionKeySize(uint8_t min_size, uint8_t max_size) {
  if (min_size < 7U || max_size > 16U || min_size > max_size) {
    return false;
  }
  BleSecurityPolicy policy = manager().radio().getSecurityPolicy();
  policy.minEncryptionKeySize = min_size;
  policy.maxEncryptionKeySize = max_size;
  return manager().radio().setSecurityPolicy(policy);
}

bool BLESecurity::setPIN(const char* pin) {
  if (pin == nullptr || strlen(pin) != 6U) {
    return false;
  }
  for (size_t i = 0; i < 6U; ++i) {
    if (pin[i] < '0' || pin[i] > '9') {
      return false;
    }
  }

  memcpy(fixed_pin_, pin, 6U);
  fixed_pin_[6] = '\0';
  fixed_pin_valid_ = true;
  manager().radio().setSecurityFixedPasskey(fixed_pin_);
  setMITM(true);
  if (io_caps_ == 0x03U) {
    setIOCaps(0x00U);
  }
  return true;
}

bool BLESecurity::getPendingPairingPasskey(uint8_t passkey[6],
                                           bool* match_request) const {
  return manager().radio().getPendingPairingPasskey(passkey, match_request);
}

bool BLESecurity::replyPendingPairingPasskey(bool accept) const {
  return manager().radio().replyPendingPairingPasskey(accept);
}

bool BLESecurity::getPendingPairingPasskeyRequest(
    uint32_t* request_id) const {
  return manager().radio().getPendingPairingPasskeyRequest(request_id);
}

bool BLESecurity::replyPendingPairingPasskey(
    uint32_t request_id, const uint8_t passkey[6]) const {
  if (!isValidSixDigitPasskey(passkey)) {
    return false;
  }
  return manager().radio().replyPendingPairingPasskey(request_id, passkey);
}

bool BLESecurity::generateOobData(uint8_t oob_r[16], uint8_t oob_c[16]) {
  if (oob_r == nullptr || oob_c == nullptr) {
    return false;
  }
  if (!manager().radio().generateSecurityOobData(oob_r, oob_c)) {
    return false;
  }
  memcpy(oob_local_r_, oob_r, 16);
  memcpy(oob_local_c_, oob_c, 16);
  oob_local_valid_ = true;
  oob_enabled_ = true;
  return true;
}

bool BLESecurity::setOobData(const uint8_t oob_r[16], const uint8_t oob_c[16]) {
  if (oob_r == nullptr || oob_c == nullptr ||
      !manager().radio().setSecurityOobLocalData(oob_r, oob_c)) {
    return false;
  }
  memcpy(oob_local_r_, oob_r, 16);
  memcpy(oob_local_c_, oob_c, 16);
  oob_local_valid_ = true;
  oob_enabled_ = true;
  return true;
}

bool BLESecurity::setOobRemoteData(const uint8_t oob_r[16], const uint8_t oob_c[16]) {
  if (oob_r == nullptr || oob_c == nullptr ||
      !manager().radio().setSecurityOobRemoteData(oob_r, oob_c)) {
    return false;
  }
  memcpy(oob_remote_r_, oob_r, 16);
  memcpy(oob_remote_c_, oob_c, 16);
  oob_remote_valid_ = true;
  oob_enabled_ = true;
  return true;
}

bool BLESecurity::getOobData(uint8_t oob_r[16], uint8_t oob_c[16]) const {
  if (oob_r == nullptr || oob_c == nullptr || !oob_local_valid_) {
    return false;
  }
  memcpy(oob_r, oob_local_r_, 16);
  memcpy(oob_c, oob_local_c_, 16);
  return true;
}

bool BLESecurity::getOobRemoteData(uint8_t oob_r[16], uint8_t oob_c[16]) const {
  if (oob_r == nullptr || oob_c == nullptr || !oob_remote_valid_) {
    return false;
  }
  memcpy(oob_r, oob_remote_r_, 16);
  memcpy(oob_c, oob_remote_c_, 16);
  return true;
}

