lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
bool BLESecurity::setOobFlag(bool enable) {
  if (!enable) {
    clearOobData();
    return true;
  }
  if (!oob_local_valid_ && !oob_remote_valid_) {
    return false;
  }

  manager().radio().setSecurityOobEnabled(true);
  if (oob_local_valid_ &&
      !manager().radio().setSecurityOobLocalData(oob_local_r_, oob_local_c_)) {
    return false;
  }
  if (oob_remote_valid_ &&
      !manager().radio().setSecurityOobRemoteData(oob_remote_r_, oob_remote_c_)) {
    return false;
  }
  oob_enabled_ = true;
  return true;
}

void BLESecurity::clearOobData() {
  manager().radio().setSecurityOobEnabled(false);
  oob_enabled_ = false;
  oob_local_valid_ = false;
  oob_remote_valid_ = false;
  memset(oob_local_r_, 0, sizeof(oob_local_r_));
  memset(oob_local_c_, 0, sizeof(oob_local_c_));
  memset(oob_remote_r_, 0, sizeof(oob_remote_r_));
  memset(oob_remote_c_, 0, sizeof(oob_remote_c_));
}

void BLESecurity::retireOobData() {
  manager().radio().retireSecurityOobData();
  oob_local_valid_ = false;
  oob_remote_valid_ = false;
  memset(oob_local_r_, 0, sizeof(oob_local_r_));
  memset(oob_local_c_, 0, sizeof(oob_local_c_));
  memset(oob_remote_r_, 0, sizeof(oob_remote_r_));
  memset(oob_remote_c_, 0, sizeof(oob_remote_c_));
}

bool BLESecurity::requestPairing() const {
  if (oob_enabled_ && oob_local_valid_ &&
      oob_data_request_callback_ != nullptr) {
    invokeBluefruitUserCallback(oob_data_request_callback_, 0U, oob_local_r_,
                                oob_local_c_);
  }
  return manager().radio().requestPairing();
}

bool BLESecurity::isEncrypted(uint16_t conn_hdl) const {
  serviceBluefruitBeforePollingState();
  return conn_hdl == 0U && manager().radio().isConnectionEncrypted();
}

bool BLESecurity::isAuthenticated(uint16_t conn_hdl) const {
  serviceBluefruitBeforePollingState();
  return conn_hdl == 0U && manager().radio().isConnectionAuthenticated();
}

bool BLESecurity::hasBond() const {
  return manager().radio().hasBondRecord();
}

uint8_t BLESecurity::bondCount() const {
  return manager().radio().bondCount();
}

uint8_t BLESecurity::enumerateBonds(ble_gap_bond_info_t* out_bonds,
                                    uint8_t capacity) const {
  const uint8_t count = manager().radio().bondCount();
  if (out_bonds == nullptr || capacity == 0U) {
    return count;
  }
  xiao_nrf54l15::BleBondInfo bonds[xiao_nrf54l15::BleRadio::kBleMaxBonds]{};
  const uint8_t copied = manager().radio().enumerateBonds(bonds, capacity);
  for (uint8_t i = 0U; i < copied; ++i) {
    copyHalBondInfoToBluefruit(bonds[i], &out_bonds[i]);
  }
  return copied;
}

bool BLESecurity::getBondInfo(uint8_t bond_id,
                              ble_gap_bond_info_t* out_info) const {
  if (out_info == nullptr) {
    return false;
  }
  xiao_nrf54l15::BleBondInfo info{};
  if (!manager().radio().getBondInfo(bond_id, &info)) {
    return false;
  }
  copyHalBondInfoToBluefruit(info, out_info);
  return true;
}

bool BLESecurity::deleteBond(uint8_t bond_id) {
  if (!manager().radio().deleteBond(bond_id)) {
    return false;
  }
  (void)refreshBondedPeerResolving();
  return true;
}

bool BLESecurity::clearBonds() {
  if (!manager().radio().clearBondRecord(true)) {
    return false;
  }
  (void)refreshBondedPeerResolving();
  return true;
}

uint8_t BLESecurity::activeBondId() const {
  return manager().radio().activeBondId();
}

bool BLESecurity::bondAuthenticated() const {
  xiao_nrf54l15::BleBondRecord record{};
  if (!manager().radio().getBondRecord(&record)) {
    return false;
  }
  return (record.reserved[0] & 0x01U) != 0U;
}

bool BLESecurity::getBondPeerAddress(ble_gap_addr_t* outAddress) const {
  if (outAddress == nullptr) {
    return false;
  }
  xiao_nrf54l15::BleBondRecord record{};
  if (!manager().radio().getBondRecord(&record)) {
    return false;
  }
  copyBondAddressToGapAddress(record.peerAddress,
                              (record.peerAddressRandom & 0x01U) != 0U,
                              outAddress);
  return true;
}

bool BLESecurity::getBondPeerIdentityAddress(ble_gap_addr_t* outAddress) const {
  if (outAddress == nullptr) {
    return false;
  }
  xiao_nrf54l15::BleBondRecord record{};
  if (!manager().radio().getBondRecord(&record) ||
      !isNonZeroAddress(record.peerIdentityAddress)) {
    return false;
  }
  copyBondAddressToGapAddress(
      record.peerIdentityAddress,
      (record.peerIdentityAddressRandom & 0x01U) != 0U, outAddress);
  return true;
}

bool BLESecurity::getBondPeerIrk(uint8_t outIrk[16]) const {
  if (outIrk == nullptr) {
    return false;
  }
  xiao_nrf54l15::BleBondRecord record{};
  if (!manager().radio().getBondRecord(&record) || record.peerIrkValid == 0U) {
    return false;
  }
  memcpy(outIrk, record.peerIrk, sizeof(record.peerIrk));
  return true;
}

bool BLESecurity::getBondPeerIrk(uint8_t bond_id,
                                 uint8_t outIrk[16]) const {
  if (outIrk == nullptr) {
    return false;
  }
  xiao_nrf54l15::BleBondRecord record{};
  if (!manager().radio().getBondRecord(bond_id, &record) ||
      record.peerIrkValid == 0U) {
    return false;
  }
  memcpy(outIrk, record.peerIrk, sizeof(record.peerIrk));
  return true;
}

bool BLESecurity::getLocalIdentityAddress(ble_gap_addr_t* outAddress) const {
  if (outAddress == nullptr) {
    return false;
  }
  xiao_nrf54l15::BleAddressType type =
      xiao_nrf54l15::BleAddressType::kPublic;
  if (!manager().radio().getLocalIdentityAddress(outAddress->addr, &type)) {
    return false;
  }
  outAddress->addr_type =
      bluefruitAddressTypeFromHal(type, outAddress->addr);
  return true;
}

bool BLESecurity::getLocalIdentityRoot(uint8_t root[16]) const {
  if (root == nullptr) return false;
  xiao_nrf54l15::Ficr::identityRoot(root);
  return true;
}

bool BLESecurity::getLocalIdentityIrk(uint8_t irk[16]) const {
  return manager().radio().getLocalIdentityIrk(irk);
}

bool BLESecurity::setPrivacyEnabled(bool enabled, uint32_t intervalMs,
                                    bool rotateNow) {
  if (manager().radio().isConnected()) {
    return false;
  }
  if (!enabled) {
    if (!manager().radio().restoreLocalIdentityAddress()) {
      return false;
    }
    removeAutoBondedPeerResolvingIrk();
    auto_bonded_peer_resolving_ = false;
    return true;
  }

  uint8_t irk[16] = {};
  if (!getLocalIdentityIrk(irk) ||
      !manager().radio().enableResolvablePrivateAddressRotation(
          irk, intervalMs, rotateNow)) {
    return false;
  }
  auto_bonded_peer_resolving_ = true;
  (void)refreshBondedPeerResolving();
  return true;
}

bool BLESecurity::privacyEnabled() const {
  return manager().radio().isResolvablePrivateAddressRotationEnabled();
}

