lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
bool BLESecurity::generateResolvablePrivateAddress(const uint8_t irk[16],
                                                   uint8_t addressOut[6]) const {
  return manager().radio().generateResolvablePrivateAddress(irk, addressOut);
}

bool BLESecurity::setResolvablePrivateAddress(const uint8_t irk[16],
                                              uint8_t addressOut[6]) const {
  return manager().radio().setResolvablePrivateAddress(irk, addressOut);
}

bool BLESecurity::enableResolvablePrivateAddressRotation(
    uint32_t intervalMs, bool rotateNow, uint8_t addressOut[6]) const {
  uint8_t irk[16] = {};
  if (!getLocalIdentityIrk(irk)) {
    return false;
  }
  return enableResolvablePrivateAddressRotation(irk, intervalMs, rotateNow,
                                                addressOut);
}

bool BLESecurity::enableResolvablePrivateAddressRotation(
    const uint8_t irk[16], uint32_t intervalMs, bool rotateNow,
    uint8_t addressOut[6]) const {
  return manager().radio().enableResolvablePrivateAddressRotation(
      irk, intervalMs, rotateNow, addressOut);
}

void BLESecurity::disableResolvablePrivateAddressRotation() const {
  manager().radio().disableResolvablePrivateAddressRotation();
}

bool BLESecurity::serviceResolvablePrivateAddressRotation(
    uint8_t addressOut[6]) const {
  return manager().radio().serviceResolvablePrivateAddressRotation(addressOut);
}

bool BLESecurity::resolvablePrivateAddressRotationEnabled() const {
  return manager().radio().isResolvablePrivateAddressRotationEnabled();
}

bool BLESecurity::resolveResolvablePrivateAddress(const uint8_t address[6],
                                                  const uint8_t* irks,
                                                  size_t irkCount,
                                                  bool* outResolved,
                                                  uint16_t* outIndex) const {
  return manager().radio().resolveResolvablePrivateAddress(address, irks,
                                                           irkCount,
                                                           outResolved,
                                                           outIndex);
}

void BLESecurity::clearResolvingList() {
  resolving_list_count_ = 0U;
  memset(resolving_list_irks_, 0, sizeof(resolving_list_irks_));
  memset(resolving_list_sources_, 0, sizeof(resolving_list_sources_));
  auto_bonded_peer_irk_owned_ = false;
  memset(auto_bonded_peer_irk_, 0, sizeof(auto_bonded_peer_irk_));
}

uint8_t BLESecurity::resolvingListCount() const {
  return resolving_list_count_;
}

uint8_t BLESecurity::resolvingListCapacity() const {
  return kResolvingListMaxEntries;
}

bool BLESecurity::addResolvingIrk(const uint8_t irk[16]) {
  if (irk == nullptr) {
    return false;
  }

  for (uint8_t i = 0U; i < resolving_list_count_; ++i) {
    if (memcmp(resolving_list_irks_[i], irk, 16U) == 0) {
      resolving_list_sources_[i] |= kResolvingSourceManual;
      return true;
    }
  }

  if (resolving_list_count_ >= kResolvingListMaxEntries) {
    return false;
  }

  memcpy(resolving_list_irks_[resolving_list_count_], irk, 16U);
  resolving_list_sources_[resolving_list_count_] = kResolvingSourceManual;
  ++resolving_list_count_;
  return true;
}

bool BLESecurity::addBondedPeerIrkToResolvingList() {
  uint8_t irk[16] = {0};
  if (!getBondPeerIrk(irk)) {
    return false;
  }
  for (uint8_t i = 0U; i < resolving_list_count_; ++i) {
    if (memcmp(resolving_list_irks_[i], irk, sizeof(irk)) == 0) {
      resolving_list_sources_[i] |= kResolvingSourceBond;
      return true;
    }
  }
  if (resolving_list_count_ >= kResolvingListMaxEntries) {
    return false;
  }
  memcpy(resolving_list_irks_[resolving_list_count_], irk, sizeof(irk));
  resolving_list_sources_[resolving_list_count_] = kResolvingSourceBond;
  ++resolving_list_count_;
  return true;
}

bool BLESecurity::setBondedPeerResolvingEnabled(bool enabled) {
  if (!enabled) {
    removeAutoBondedPeerResolvingIrk();
  }
  auto_bonded_peer_resolving_ = enabled;
  if (!enabled) {
    return true;
  }
  (void)refreshBondedPeerResolving();
  return true;
}

bool BLESecurity::bondedPeerResolvingEnabled() const {
  return auto_bonded_peer_resolving_;
}

bool BLESecurity::refreshBondedPeerResolving() {
  removeAutoBondedPeerResolvingIrk();
  if (!auto_bonded_peer_resolving_) {
    return true;
  }

  xiao_nrf54l15::BleBondInfo bonds[xiao_nrf54l15::BleRadio::kBleMaxBonds]{};
  const uint8_t count = manager().radio().enumerateBonds(
      bonds, xiao_nrf54l15::BleRadio::kBleMaxBonds);
  bool addedAny = false;
  for (uint8_t bond = 0U; bond < count; ++bond) {
    uint8_t irk[16] = {0};
    if (!getBondPeerIrk(bonds[bond].id, irk)) {
      continue;
    }
    bool present = false;
    for (uint8_t i = 0U; i < resolving_list_count_; ++i) {
      if (memcmp(resolving_list_irks_[i], irk, sizeof(irk)) == 0) {
        resolving_list_sources_[i] |= kResolvingSourceBond;
        present = true;
        addedAny = true;
        break;
      }
    }
    if (present || resolving_list_count_ >= kResolvingListMaxEntries) {
      continue;
    }
    memcpy(resolving_list_irks_[resolving_list_count_], irk, sizeof(irk));
    resolving_list_sources_[resolving_list_count_] = kResolvingSourceBond;
    ++resolving_list_count_;
    addedAny = true;
  }
  auto_bonded_peer_irk_owned_ = addedAny;
  return addedAny || count == 0U;
}

void BLESecurity::removeAutoBondedPeerResolvingIrk() {
  uint8_t i = 0U;
  while (i < resolving_list_count_) {
    resolving_list_sources_[i] &=
        static_cast<uint8_t>(~kResolvingSourceBond);
    if (resolving_list_sources_[i] == 0U) {
      (void)removeResolvingIrk(i);
    } else {
      ++i;
    }
  }
  auto_bonded_peer_irk_owned_ = false;
  memset(auto_bonded_peer_irk_, 0, sizeof(auto_bonded_peer_irk_));
}

bool BLESecurity::removeResolvingIrk(uint8_t index) {
  if (index >= resolving_list_count_) {
    return false;
  }

  for (uint8_t i = index; (i + 1U) < resolving_list_count_; ++i) {
    memcpy(resolving_list_irks_[i], resolving_list_irks_[i + 1U], 16U);
    resolving_list_sources_[i] = resolving_list_sources_[i + 1U];
  }
  --resolving_list_count_;
  memset(resolving_list_irks_[resolving_list_count_], 0, 16U);
  resolving_list_sources_[resolving_list_count_] = 0U;
  return true;
}

bool BLESecurity::getResolvingIrk(uint8_t index, uint8_t irkOut[16]) const {
  if (index >= resolving_list_count_ || irkOut == nullptr) {
    return false;
  }

  memcpy(irkOut, resolving_list_irks_[index], 16U);
  return true;
}

bool BLESecurity::resolveResolvablePrivateAddress(const uint8_t address[6],
                                                  bool* outResolved,
                                                  uint16_t* outIndex) const {
  if (outResolved != nullptr) {
    *outResolved = false;
  }
  if (outIndex != nullptr) {
    *outIndex = 0xFFFFU;
  }
  if (resolving_list_count_ == 0U) {
    return false;
  }

  return manager().radio().resolveResolvablePrivateAddress(
      address, &resolving_list_irks_[0][0], resolving_list_count_,
      outResolved, outIndex);
}

void BLESecurity::setOobDataRequestCallback(oob_data_request_callback_t fp) {
  oob_data_request_callback_ = fp;
}

void serviceBluefruitBeforePollingState() {
  if (ScopedBluefruitUserCallback::active()) {
    return;
  }
  manager().idleService();
  manager().dispatchDeferredUserCallbacks();
}

static constexpr unsigned long kLinkCapacityWaitTimeoutMs = 2000UL;
static constexpr unsigned long kLinkCapacityRetryMs = 100UL;

bool linkValueFitsCurrentConnection(uint16_t valueLen) {
  if (!manager().radio().isConnected()) {
    return false;
  }

  const uint16_t requiredAttMtu = static_cast<uint16_t>(3U + valueLen);
  const uint16_t requiredDataLength = static_cast<uint16_t>(7U + valueLen);
  return (manager().radio().currentAttMtu() >= requiredAttMtu) &&
         (manager().radio().currentDataLength() >= requiredDataLength);
}

