lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
    if (attOpcode == responseOpcode) {
      result.outcome = AttWaitOutcome::kResponse;
      result.event = event;
      return result;
    }

    manager().handleClientConnectionEvent(event);
  }

  return result;
}

bool queueServiceDiscoveryRequest(const BLEUuid& uuid, bool reverse128 = false) {
  if (uuid.size() == 2U) {
    uint8_t request[9] = {kAttOpFindByTypeValueReq, 0U, 0U, 0U, 0U, 0U, 0U, 0U, 0U};
    writeLe16(&request[1], 0x0001U);
    writeLe16(&request[3], 0xFFFFU);
    writeLe16(&request[5], kUuidPrimaryService);
    writeLe16(&request[7], uuid.uuid16());
    return queueClientAttProcedure(
        [&]() { return manager().radio().queueAttRequest(request, sizeof(request)); });
  }
  if (uuid.size() == 16U) {
    uint8_t request[23] = {0};
    request[0] = kAttOpFindByTypeValueReq;
    writeLe16(&request[1], 0x0001U);
    writeLe16(&request[3], 0xFFFFU);
    writeLe16(&request[5], kUuidPrimaryService);
    for (uint8_t i = 0U; i < 16U; ++i) {
      request[7U + i] = reverse128 ? uuid.uuid128()[15U - i] : uuid.uuid128()[i];
    }
    return queueClientAttProcedure(
        [&]() { return manager().radio().queueAttRequest(request, sizeof(request)); });
  }
  return false;
}

bool discoverServiceRangeSync(const BLEUuid& uuid, uint16_t* startHandle,
                              uint16_t* endHandle) {
  ScopedClientSyncProcedure scopedProcedure;
  if (startHandle == nullptr || endHandle == nullptr) {
    return false;
  }
  if (uuid.size() != 16U) {
    if (!queueServiceDiscoveryRequest(uuid, false)) {
      return false;
    }

    const AttWaitResult wait =
        waitForAttOpcode(kAttOpFindByTypeValueReq, kAttOpFindByTypeValueRsp);
    const uint16_t payloadLength = wait.event.payloadLength;
    if (wait.outcome != AttWaitOutcome::kResponse ||
        !validAttFixedListLayout(payloadLength, 5U, 4U)) {
      return false;
    }

    uint16_t firstStart = 0U;
    uint16_t firstEnd = 0U;
    uint16_t previousEnd = 0U;
    for (uint16_t offset = 5U; offset + 4U <= payloadLength; offset += 4U) {
      const uint16_t candidateStart = readLe16(&wait.event.payload[offset]);
      const uint16_t candidateEnd = readLe16(&wait.event.payload[offset + 2U]);
      if (!validAttServiceGroupEntry(candidateStart, candidateEnd, 1U,
                                     0xFFFFU, previousEnd)) {
        return false;
      }
      if (firstStart == 0U) {
        firstStart = candidateStart;
        firstEnd = candidateEnd;
      }
      previousEnd = candidateEnd;
    }
    *startHandle = firstStart;
    *endHandle = firstEnd;
    return true;
  }

  {
    // A 128-bit Find By Type Value request is 23 ATT bytes, which becomes a
    // full 27-byte default LL data PDU before MTU/Data Length negotiation.
    // Walking primary services via Read By Group Type avoids that edge while
    // still discovering the same service range.
  }

  uint16_t searchStart = 0x0001U;
  while (true) {
    uint8_t request[7] = {kAttOpReadByGroupTypeReq, 0U, 0U, 0U, 0U, 0U, 0U};
    writeLe16(&request[1], searchStart);
    writeLe16(&request[3], 0xFFFFU);
    writeLe16(&request[5], kUuidPrimaryService);
    if (!queueClientAttProcedure(
            [&]() { return manager().radio().queueAttRequest(request, sizeof(request)); })) {
      return false;
    }

    const AttWaitResult groupWait =
        waitForAttOpcode(kAttOpReadByGroupTypeReq, kAttOpReadByGroupTypeRsp);
    if (groupWait.outcome == AttWaitOutcome::kError &&
        groupWait.errorCode == kAttErrAttributeNotFound) {
      return false;
    }
    const uint16_t payloadLength = groupWait.event.payloadLength;
    if (groupWait.outcome != AttWaitOutcome::kResponse ||
        payloadLength < kAttDiscoveryListPrefixLength) {
      return false;
    }

    const uint8_t entryLen = groupWait.event.payload[5];
    if (!validAttDiscoveryListLayout(payloadLength, entryLen, 6U, 20U)) {
      return false;
    }

    uint16_t lastEndHandle = static_cast<uint16_t>(searchStart - 1U);
    for (uint16_t offset = kAttDiscoveryListPrefixLength;
         offset + entryLen <= payloadLength; offset += entryLen) {
      const uint16_t candidateStart = readLe16(&groupWait.event.payload[offset]);
      const uint16_t candidateEnd = readLe16(&groupWait.event.payload[offset + 2U]);
      if (!validAttServiceGroupEntry(candidateStart, candidateEnd, searchStart,
                                     0xFFFFU, lastEndHandle)) {
        return false;
      }
      const uint8_t uuidLen = static_cast<uint8_t>(entryLen - 4U);
      const uint8_t* candidateUuid = &groupWait.event.payload[offset + 4U];
      lastEndHandle = candidateEnd;
      if (uuidMatches(uuid, candidateUuid, uuidLen)) {
        *startHandle = candidateStart;
        *endHandle = candidateEnd;
        return true;
      }
    }

    if (lastEndHandle == 0xFFFFU) {
      break;
    }
    searchStart = static_cast<uint16_t>(lastEndHandle + 1U);
  }

  return false;
}

bool discoverCharacteristicSync(uint16_t serviceStartHandle, uint16_t serviceEndHandle,
                                const BLEUuid& uuid, uint16_t* declHandle,
                                uint16_t* valueHandle, uint16_t* endHandle,
                                uint8_t* properties) {
  ScopedClientSyncProcedure scopedProcedure;
  if (declHandle == nullptr || valueHandle == nullptr || endHandle == nullptr ||
      serviceStartHandle == 0U || serviceEndHandle == 0U) {
    return false;
  }

  bool found = false;
  uint16_t searchStart = serviceStartHandle;
  uint16_t previousValueHandle = static_cast<uint16_t>(searchStart - 1U);
  *declHandle = 0U;
  *valueHandle = 0U;
  *endHandle = 0U;
  if (properties != nullptr) {
    *properties = 0U;
  }

  while (searchStart <= serviceEndHandle) {
    uint8_t request[7] = {kAttOpReadByTypeReq, 0U, 0U, 0U, 0U, 0U, 0U};
    writeLe16(&request[1], searchStart);
    writeLe16(&request[3], serviceEndHandle);
    writeLe16(&request[5], kUuidCharacteristic);
    if (!queueClientAttProcedure(
            [&]() { return manager().radio().queueAttRequest(request, sizeof(request)); })) {
      return false;
    }

    const AttWaitResult wait =
        waitForAttOpcode(kAttOpReadByTypeReq, kAttOpReadByTypeRsp);
    if (wait.outcome == AttWaitOutcome::kError &&
        wait.errorCode == kAttErrAttributeNotFound) {
      break;
    }
    const uint16_t payloadLength = wait.event.payloadLength;
    if (wait.outcome != AttWaitOutcome::kResponse ||
        payloadLength < kAttDiscoveryListPrefixLength) {
      return false;
    }

