lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
  return false;
}

uint16_t readHandleSync(uint16_t handle, uint8_t* buffer, uint16_t bufferLen) {
  ScopedClientSyncProcedure scopedProcedure;
  if (handle == 0U || buffer == nullptr || bufferLen == 0U) {
    return 0U;
  }

  uint16_t copied = 0U;
  bool firstRequest = true;
  while (copied < bufferLen) {
    const uint8_t requestOpcode = firstRequest ? kAttOpReadReq : kAttOpReadBlobReq;
    const uint8_t responseOpcode = firstRequest ? kAttOpReadRsp : kAttOpReadBlobRsp;
    bool queued = false;
    if (firstRequest) {
      queued = queueClientAttProcedure(
          [&]() { return manager().radio().queueAttReadRequest(handle); });
    } else {
      uint8_t request[5] = {kAttOpReadBlobReq, 0U, 0U, 0U, 0U};
      writeLe16(&request[1], handle);
      writeLe16(&request[3], copied);
      queued = queueClientAttProcedure(
          [&]() { return manager().radio().queueAttRequest(request, sizeof(request)); });
    }
    if (!queued) {
      return 0U;
    }

    const AttWaitResult wait = waitForAttOpcode(requestOpcode, responseOpcode);
    if (wait.outcome == AttWaitOutcome::kError && !firstRequest && copied > 0U &&
        (wait.errorCode == kAttErrInvalidOffset ||
         wait.errorCode == kAttErrAttributeNotLong)) {
      return copied;
    }
    if (wait.outcome != AttWaitOutcome::kResponse || wait.event.payloadLength < 5U) {
      return 0U;
    }

    const uint16_t fragmentLen =
        static_cast<uint16_t>(wait.event.payloadLength - 5U);
    const uint16_t remaining = static_cast<uint16_t>(bufferLen - copied);
    const uint16_t copyLen = min<uint16_t>(remaining, fragmentLen);
    if (copyLen > 0U) {
      memcpy(&buffer[copied], &wait.event.payload[5], copyLen);
      copied = static_cast<uint16_t>(copied + copyLen);
    }
    if (copyLen < fragmentLen || copied == bufferLen || fragmentLen == 0U) {
      return copied;
    }

    const uint16_t attMtu = manager().radio().currentAttMtu();
    const uint16_t dataLength = manager().radio().currentDataLength();
    const uint16_t attCapacity = (attMtu > 1U) ? (attMtu - 1U) : 0U;
    const uint16_t dataCapacity = (dataLength > 5U) ? (dataLength - 5U) : 0U;
    const uint16_t responseCapacity = min<uint16_t>(attCapacity, dataCapacity);
    if (responseCapacity == 0U || fragmentLen < responseCapacity) {
      return copied;
    }
    firstRequest = false;
  }
  return copied;
}

bool writeHandleSync(uint16_t handle, const uint8_t* data, uint8_t dataLen,
                     bool withResponse = true) {
  ScopedClientSyncProcedure scopedProcedure;
  if (!queueClientAttProcedure([&]() {
        return manager().radio().queueAttWriteRequest(handle, data, dataLen, withResponse);
      })) {
    return false;
  }
  if (!withResponse) {
    return true;
  }

  const AttWaitResult wait = waitForAttOpcode(kAttOpWriteReq, kAttOpWriteRsp);
  return wait.outcome == AttWaitOutcome::kResponse;
}

bool executePreparedWriteSync(bool execute) {
  if (!queueClientAttProcedure([&]() {
        return manager().radio().queueAttExecuteWriteRequest(execute);
      })) {
    return false;
  }

  const AttWaitResult wait =
      waitForAttOpcode(kAttOpExecuteWriteReq, kAttOpExecuteWriteRsp);
  return wait.outcome == AttWaitOutcome::kResponse;
}

bool writeLongHandleSync(uint16_t handle, const uint8_t* data, uint16_t dataLen) {
  ScopedClientSyncProcedure scopedProcedure;
  g_bluefruitLongWriteDiagCode = 0U;
  g_bluefruitLongWriteDiagSent = 0U;
  g_bluefruitLongWriteDiagChunk = 0U;
  g_bluefruitLongWriteDiagMtu = manager().radio().currentAttMtu();
  g_bluefruitLongWriteDiagDataLength = manager().radio().currentDataLength();
  g_bluefruitLongWriteDiagWaitOutcome = 0U;
  g_bluefruitLongWriteDiagAttError = 0U;
  g_bluefruitLongWriteDiagEventLength = 0U;
  g_bluefruitLongWriteDiagEventOpcode = 0U;
  if (handle == 0U || data == nullptr || dataLen == 0U ||
      dataLen > BleRadio::kCustomGattMaxValueLength) {
    g_bluefruitLongWriteDiagCode = 1U;
    return false;
  }

  uint16_t sent = 0U;
  while (sent < dataLen) {
    uint16_t attChunkMax = 0U;
    const uint16_t attMtu = manager().radio().currentAttMtu();
    if (attMtu > 5U) {
      attChunkMax = static_cast<uint16_t>(attMtu - 5U);
    }
    uint16_t dataChunkMax = 0U;
    const uint16_t dataLength = manager().radio().currentDataLength();
    if (dataLength > 9U) {
      dataChunkMax = static_cast<uint16_t>(dataLength - 9U);
    }
    // Keep Prepare Write chunks default-PDU safe for cross-stack reliability.
    // Zephyr interop must work before both sides converge on MTU/DLE timing.
    uint16_t chunkMax =
        min<uint16_t>(min<uint16_t>(attChunkMax, dataChunkMax), 18U);
    g_bluefruitLongWriteDiagMtu = attMtu;
    g_bluefruitLongWriteDiagDataLength = dataLength;
    g_bluefruitLongWriteDiagSent = sent;
    g_bluefruitLongWriteDiagChunk = chunkMax;
    if (chunkMax == 0U) {
      (void)executePreparedWriteSync(false);
      g_bluefruitLongWriteDiagCode = 2U;
      return false;
    }

    const uint16_t remaining = static_cast<uint16_t>(dataLen - sent);
    const uint8_t chunk =
        static_cast<uint8_t>(min<uint16_t>(remaining, chunkMax));
    g_bluefruitLongWriteDiagChunk = chunk;
    if (!queueClientAttProcedure([&]() {
          return manager().radio().queueAttPrepareWriteRequest(
              handle, sent, &data[sent], chunk);
        })) {
      (void)executePreparedWriteSync(false);
      g_bluefruitLongWriteDiagCode = 3U;
      return false;
    }

    const AttWaitResult wait =
        waitForAttOpcode(kAttOpPrepareWriteReq, kAttOpPrepareWriteRsp);
    g_bluefruitLongWriteDiagWaitOutcome =
        static_cast<uint32_t>(wait.outcome);
    g_bluefruitLongWriteDiagAttError = wait.errorCode;
    g_bluefruitLongWriteDiagEventLength = wait.event.payloadLength;
    g_bluefruitLongWriteDiagEventOpcode =
        (wait.event.payload != nullptr && wait.event.payloadLength >= 5U)
            ? wait.event.payload[4]
            : 0U;
    if (wait.outcome != AttWaitOutcome::kResponse ||
        wait.event.payloadLength < static_cast<uint8_t>(9U + chunk) ||
        readLe16(&wait.event.payload[5]) != handle ||
        readLe16(&wait.event.payload[7]) != sent ||
        memcmp(&wait.event.payload[9], &data[sent], chunk) != 0) {
      (void)executePreparedWriteSync(false);
      g_bluefruitLongWriteDiagCode = 4U;
      return false;
    }

    sent = static_cast<uint16_t>(sent + chunk);
  }

  const bool executed = executePreparedWriteSync(true);
  g_bluefruitLongWriteDiagSent = sent;
  g_bluefruitLongWriteDiagCode = executed ? 0U : 5U;
  return executed;
}

extern "C" uint32_t sd_ble_gatts_rw_authorize_reply(
    uint16_t conn_handle,
    const ble_gatts_rw_authorize_reply_params_t* reply_params) {
  if (reply_params == nullptr) {
    return NRF_ERROR_INVALID_ADDR;
  }
  if (conn_handle != 0U || !manager().radio().isConnected() ||
      manager().radio().connectionRole() != BleConnectionRole::kPeripheral) {
    return BLE_ERROR_INVALID_CONN_HANDLE;
  }

