lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
  BleGattAuthorizeType type = BleGattAuthorizeType::kInvalid;
  const ble_gatts_authorize_params_t* params = nullptr;
  if (reply_params->type == BLE_GATTS_AUTHORIZE_TYPE_READ) {
    type = BleGattAuthorizeType::kRead;
    params = &reply_params->params.read;
  } else if (reply_params->type == BLE_GATTS_AUTHORIZE_TYPE_WRITE) {
    type = BleGattAuthorizeType::kWrite;
    params = &reply_params->params.write;
  } else {
    return NRF_ERROR_INVALID_PARAM;
  }

  const BleGattAuthorizeReplyResult result =
      manager().radio().replyCustomGattAuthorization(
          type, params->gatt_status, params->update != 0U, params->offset,
          params->p_data, params->len);
  switch (result) {
    case BleGattAuthorizeReplyResult::kSuccess:
      return NRF_SUCCESS;
    case BleGattAuthorizeReplyResult::kInvalidConnection:
      return BLE_ERROR_INVALID_CONN_HANDLE;
    case BleGattAuthorizeReplyResult::kInvalidParameter:
      return NRF_ERROR_INVALID_PARAM;
    case BleGattAuthorizeReplyResult::kTimeout:
      return NRF_ERROR_TIMEOUT;
    case BleGattAuthorizeReplyResult::kBusy:
      return NRF_ERROR_BUSY;
    case BleGattAuthorizeReplyResult::kInvalidState:
    default:
      return NRF_ERROR_INVALID_STATE;
  }
}

extern "C" void nrf54l15_bluefruit_compat_idle_service(void) {
  if (ScopedBluefruitUserCallback::active()) {
    return;
  }
  manager().idleService();
}

extern "C" void nrf54l15_bluefruit_compat_yield_service(void) {
  if (ScopedBluefruitUserCallback::active()) {
    return;
  }
  manager().dispatchDeferredUserCallbacks();
}

extern "C" uint32_t nrf54l15_bluefruit_compat_idle_sleep_cap_us(void) {
  return manager().idleSleepCapUs();
}

BLEUuid::BLEUuid() : size_(0U), uuid16_(0U), uuid128_{0} {}

BLEUuid::BLEUuid(uint16_t uuid16) : BLEUuid() { set(uuid16); }

BLEUuid::BLEUuid(const uint8_t uuid128[16]) : BLEUuid() { set(uuid128); }

BLEUuid::BLEUuid(const char* str) : BLEUuid() { set(str); }

void BLEUuid::set(uint16_t uuid16) {
  size_ = 2U;
  uuid16_ = uuid16;
  memset(uuid128_, 0, sizeof(uuid128_));
}

void BLEUuid::set(const uint8_t uuid128[16]) {
  if (uuid128 == nullptr) {
    size_ = 0U;
    uuid16_ = 0U;
    memset(uuid128_, 0, sizeof(uuid128_));
    return;
  }
  size_ = 16U;
  uuid16_ = 0U;
  memcpy(uuid128_, uuid128, sizeof(uuid128_));
}

void BLEUuid::set(const char* str) {
  uint8_t parsed[16] = {0};
  uint8_t parsedSize = 0U;
  uint16_t parsed16 = 0U;
  if (!parseUuidString(str, parsed, &parsedSize, &parsed16)) {
    size_ = 0U;
    uuid16_ = 0U;
    memset(uuid128_, 0, sizeof(uuid128_));
    return;
  }
  if (parsedSize == 2U) {
    set(parsed16);
  } else {
    set(parsed);
  }
}

bool BLEUuid::get(uint16_t* uuid16) const {
  if (uuid16 == nullptr || size_ != 2U) {
    return false;
  }
  *uuid16 = uuid16_;
  return true;
}

bool BLEUuid::get(uint8_t uuid128[16]) const {
  if (uuid128 == nullptr || size_ != 16U) {
    return false;
  }
  memcpy(uuid128, uuid128_, sizeof(uuid128_));
  return true;
}

size_t BLEUuid::size() const { return size_; }

bool BLEUuid::begin() const { return size_ == 2U || size_ == 16U; }

String BLEUuid::toString() const {
  if (size_ == 2U) {
    char buffer[5] = {0};
    snprintf(buffer, sizeof(buffer), "%04X", uuid16_);
    return String(buffer);
  }
  if (size_ != 16U) {
    return String();
  }
  uint8_t bigEndian[16] = {0};
  for (size_t i = 0U; i < 16U; ++i) {
    bigEndian[i] = uuid128_[15U - i];
  }
  char buffer[37] = {0};
  snprintf(buffer, sizeof(buffer),
           "%02X%02X%02X%02X-%02X%02X-%02X%02X-%02X%02X-%02X%02X%02X%02X%02X%02X",
           bigEndian[0], bigEndian[1], bigEndian[2], bigEndian[3], bigEndian[4],
           bigEndian[5], bigEndian[6], bigEndian[7], bigEndian[8], bigEndian[9],
           bigEndian[10], bigEndian[11], bigEndian[12], bigEndian[13], bigEndian[14],
           bigEndian[15]);
  return String(buffer);
}

bool BLEUuid::operator==(const BLEUuid& rhs) const {
  if (size_ != rhs.size_) {
    return false;
  }
  if (size_ == 2U) {
    return uuid16_ == rhs.uuid16_;
  }
  if (size_ == 16U) {
    return memcmp(uuid128_, rhs.uuid128_, sizeof(uuid128_)) == 0;
  }
  return true;
}

bool BLEUuid::operator!=(const BLEUuid& rhs) const { return !(*this == rhs); }

uint16_t BLEUuid::uuid16() const { return uuid16_; }

const uint8_t* BLEUuid::uuid128() const { return uuid128_; }

BLEService::BLEService()
    : uuid(), _handle(0U), _read_perm(SECMODE_OPEN), _write_perm(SECMODE_OPEN),
      _begun(false) {}

BLEService::BLEService(BLEUuid bleuuid)
    : uuid(bleuuid), _handle(0U), _read_perm(SECMODE_OPEN), _write_perm(SECMODE_OPEN),
      _begun(false) {}

void BLEService::setUuid(BLEUuid bleuuid) { uuid = bleuuid; }

void BLEService::setPermission(SecureMode_t read_perm, SecureMode_t write_perm) {
  _read_perm = read_perm;
  _write_perm = write_perm;
}

void BLEService::getPermission(SecureMode_t* read_perm, SecureMode_t* write_perm) const {
  if (read_perm != nullptr) {
    *read_perm = _read_perm;
  }
  if (write_perm != nullptr) {
    *write_perm = _write_perm;
  }
}

err_t BLEService::begin() {
  if (!manager().begin(1U, 0U)) {
    return ERROR_INVALID_STATE;
  }
  if (_begun) {
    lastService = this;
    return ERROR_NONE;
  }

  bool ok = false;
  if (uuid.size() == 2U) {
    ok = manager().radio().addCustomGattService(uuid.uuid16(), &_handle);
  } else if (uuid.size() == 16U) {
    uint8_t canonicalUuid[16] = {0};
    bleUuid128ToCanonical(uuid.uuid128(), canonicalUuid);
    ok = manager().radio().addCustomGattService128(canonicalUuid, &_handle);
  }
  if (!ok) {
    return ERROR_INVALID_STATE;
  }

  _begun = true;
  lastService = this;
  manager().noteGattService(this);
  return ERROR_NONE;
}

BLECharacteristic::BLECharacteristic()
    : uuid(),
      _is_temp(false),
      _max_len(BleRadio::kCustomGattMaxValueLength),
      _fixed_len(false),
      _service(nullptr),
      _userbuf(nullptr),
      _userbufsize(0U),
      _properties(0U),
      _read_perm(SECMODE_OPEN),
      _write_perm(SECMODE_OPEN),
      _handles{0U, 0U, 0U, 0U},
      _value{0},
      _value_len(0U),
      _notify_enabled(false),
      _indicate_enabled(false),
      _usr_descriptor(nullptr),
      _report_ref_valid(false),
      _report_ref{0},
      _report_ref_read_perm_valid(false),
      _report_ref_read_perm(SECMODE_OPEN),
      _presentation_format_valid(false),
      _presentation_format{0},
      _wr_cb(nullptr),
      _cccd_wr_cb(nullptr),
      _rd_authorize_cb(nullptr),
      _wr_authorize_cb(nullptr) {}

