lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
BLEAdvertisingData::BLEAdvertisingData(bool scan_response)
    : data_{0}, len_(0U), scan_response_(scan_response), dirty_(true) {}

void BLEAdvertisingData::clearData() {
  memset(data_, 0, sizeof(data_));
  len_ = 0U;
  dirty_ = true;
}

bool BLEAdvertisingData::setData(const uint8_t* data, uint8_t len) {
  if ((data == nullptr && len > 0U) || len > sizeof(data_)) {
    return false;
  }
  memset(data_, 0, sizeof(data_));
  if (len > 0U) {
    memcpy(data_, data, len);
  }
  len_ = len;
  dirty_ = true;
  return true;
}

bool BLEAdvertisingData::addData(uint8_t type, const void* data, uint8_t len) {
  if ((data == nullptr && len > 0U) || (len_ + len + 2U) > sizeof(data_)) {
    return false;
  }
  data_[len_++] = static_cast<uint8_t>(len + 1U);
  data_[len_++] = type;
  if (len > 0U) {
    memcpy(&data_[len_], data, len);
    len_ = static_cast<uint8_t>(len_ + len);
  }
  dirty_ = true;
  return true;
}

bool BLEAdvertisingData::addFlags(uint8_t flags) { return addData(kAdTypeFlags, &flags, 1U); }

bool BLEAdvertisingData::addTxPower() {
  const int8_t txPower = Bluefruit.getTxPower();
  return addData(kAdTypeTxPower, &txPower, 1U);
}

bool BLEAdvertisingData::addName() {
  char name[CFG_MAX_DEVNAME_LEN + 1] = {0};
  const uint8_t nameLen = Bluefruit.getName(name, sizeof(name));
  if (nameLen == 0U) {
    return false;
  }
  const uint8_t maxLen = static_cast<uint8_t>((sizeof(data_) > (len_ + 2U))
                                                  ? (sizeof(data_) - len_ - 2U)
                                                  : 0U);
  if (maxLen == 0U) {
    return false;
  }
  const uint8_t actualLen = (nameLen > maxLen) ? maxLen : nameLen;
  const uint8_t type = (actualLen == nameLen) ? kAdTypeCompleteName : kAdTypeShortName;
  return addData(type, name, actualLen);
}

bool BLEAdvertisingData::addAppearance(uint16_t appearance) {
  return addData(kAdTypeAppearance, &appearance, sizeof(appearance));
}

bool BLEAdvertisingData::addManufacturerData(const void* data, uint8_t len) {
  return addData(kAdTypeManufacturer, data, len);
}

bool BLEAdvertisingData::addService(const BLEService& service) { return addService(service.uuid); }

bool BLEAdvertisingData::addService(const BLEClientService& service) {
  if (service.uuid.size() == 2U) {
    const uint16_t value = service.uuid.uuid16();
    const uint8_t encoded[2] = {static_cast<uint8_t>(value & 0xFFU),
                                static_cast<uint8_t>((value >> 8U) & 0xFFU)};
    return addData(kAdTypeSolicited16, encoded, sizeof(encoded));
  }
  if (service.uuid.size() == 16U) {
    return addData(kAdTypeSolicited128, service.uuid.uuid128(), 16U);
  }
  return false;
}

bool BLEAdvertisingData::addService(const BLEService& service1, const BLEService& service2) {
  const BLEUuid uuids[] = {service1.uuid, service2.uuid};
  return addUuid(uuids, 2U);
}

bool BLEAdvertisingData::addService(const BLEService& service1, const BLEService& service2,
                                    const BLEService& service3) {
  const BLEUuid uuids[] = {service1.uuid, service2.uuid, service3.uuid};
  return addUuid(uuids, 3U);
}

bool BLEAdvertisingData::addService(const BLEService& service1, const BLEService& service2,
                                    const BLEService& service3,
                                    const BLEService& service4) {
  const BLEUuid uuids[] = {service1.uuid, service2.uuid, service3.uuid, service4.uuid};
  return addUuid(uuids, 4U);
}

bool BLEAdvertisingData::addService(const BLEUuid& uuid) { return addUuid(uuid); }

bool BLEAdvertisingData::addUuid(const BLEUuid& uuid) {
  if (uuid.size() == 2U) {
    const uint16_t uuid16 = uuid.uuid16();
    return addData(kAdTypeComplete16, &uuid16, sizeof(uuid16));
  }
  if (uuid.size() == 16U) {
    return addData(kAdTypeComplete128, uuid.uuid128(), 16U);
  }
  return false;
}

bool BLEAdvertisingData::addUuid(const BLEUuid& uuid1, const BLEUuid& uuid2) {
  const BLEUuid uuids[] = {uuid1, uuid2};
  return addUuid(uuids, 2U);
}

bool BLEAdvertisingData::addUuid(const BLEUuid& uuid1, const BLEUuid& uuid2,
                                 const BLEUuid& uuid3) {
  const BLEUuid uuids[] = {uuid1, uuid2, uuid3};
  return addUuid(uuids, 3U);
}

bool BLEAdvertisingData::addUuid(const BLEUuid& uuid1, const BLEUuid& uuid2,
                                 const BLEUuid& uuid3, const BLEUuid& uuid4) {
  const BLEUuid uuids[] = {uuid1, uuid2, uuid3, uuid4};
  return addUuid(uuids, 4U);
}

bool BLEAdvertisingData::addUuid(const BLEUuid uuids[], uint8_t count) {
  if (uuids == nullptr) {
    return false;
  }

  uint8_t uuid16Data[31] = {0};
  uint8_t uuid16Len = 0U;
  uint8_t uuid128Data[31] = {0};
  uint8_t uuid128Len = 0U;
  for (uint8_t i = 0U; i < count; ++i) {
    if (uuids[i].size() == 2U) {
      if ((uuid16Len + sizeof(uint16_t)) > sizeof(uuid16Data)) {
        return false;
      }
      const uint16_t uuid16 = uuids[i].uuid16();
      memcpy(&uuid16Data[uuid16Len], &uuid16, sizeof(uuid16));
      uuid16Len = static_cast<uint8_t>(uuid16Len + sizeof(uuid16));
      continue;
    }
    if (uuids[i].size() == 16U) {
      if ((uuid128Len + 16U) > sizeof(uuid128Data)) {
        return false;
      }
      memcpy(&uuid128Data[uuid128Len], uuids[i].uuid128(), 16U);
      uuid128Len = static_cast<uint8_t>(uuid128Len + 16U);
      continue;
    }
    return false;
  }

  const uint16_t requiredLen =
      static_cast<uint16_t>((uuid16Len > 0U ? uuid16Len + 2U : 0U) +
                            (uuid128Len > 0U ? uuid128Len + 2U : 0U));
  if ((static_cast<uint16_t>(len_) + requiredLen) > sizeof(data_)) {
    return false;
  }

  if (uuid16Len > 0U && !addData(kAdTypeComplete16, uuid16Data, uuid16Len)) {
    return false;
  }
  if (uuid128Len > 0U && !addData(kAdTypeComplete128, uuid128Data, uuid128Len)) {
    return false;
  }
  return true;
}

uint8_t BLEAdvertisingData::count() const { return len_; }

uint8_t* BLEAdvertisingData::getData() { return data_; }

BLEAdvertising::BLEAdvertising()
    : BLEAdvertisingData(false),
      restart_on_disconnect_(true),
      interval_fast_(32U),
      interval_slow_(244U),
      fast_timeout_s_(30U),
      stop_timeout_s_(0U),
      adv_type_(BLE_GAP_ADV_TYPE_CONNECTABLE_SCANNABLE_UNDIRECTED),
      peer_addr_{},
      peer_addr_set_(false),
      running_(false),
      slow_callback_(nullptr),
      stop_callback_(nullptr) {}

void BLEAdvertising::restartOnDisconnect(bool enable) { restart_on_disconnect_ = enable; }

