lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
    memcpy(&payload.encoded_url[encodedLen], url, copyLen);
    encodedLen = static_cast<uint8_t>(encodedLen + copyLen);
    url += copyLen;

    if (expansion != nullptr) {
      payload.encoded_url[encodedLen++] = expansionCode;
      url += strlen(kEddystoneExpansions[expansionCode]);
    }
  }

  adv.clearData();
  return adv.addFlags(BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE) &&
         adv.addUuid(UUID16_SVC_EDDYSTONE) &&
         adv.addData(BLE_GAP_AD_TYPE_SERVICE_DATA, &payload,
                     static_cast<uint8_t>(5U + encodedLen));
}

BLEPeriph::BLEPeriph()
    : connect_callback_(nullptr),
      disconnect_callback_(nullptr),
      conn_interval_min_(BLE_GAP_CONN_MIN_INTERVAL_DFLT),
      conn_interval_max_(BLE_GAP_CONN_MAX_INTERVAL_DFLT),
      conn_latency_(BLE_GAP_CONN_SLAVE_LATENCY),
      conn_supervision_timeout_(BLE_GAP_CONN_SUPERVISION_TIMEOUT_MS / 10U) {}

void BLEPeriph::setConnectCallback(ble_connect_callback_t fp) { connect_callback_ = fp; }

void BLEPeriph::setDisconnectCallback(ble_disconnect_callback_t fp) {
  disconnect_callback_ = fp;
}

bool BLEPeriph::setConnInterval(uint16_t min_interval, uint16_t max_interval) {
  conn_interval_min_ = min_interval;
  conn_interval_max_ = (max_interval == 0U) ? min_interval : max_interval;
  manager().radio().setPreferredConnectionParameters(conn_interval_min_, conn_interval_max_,
                                                     conn_latency_,
                                                     conn_supervision_timeout_);
  return true;
}

bool BLEPeriph::setConnIntervalMS(uint16_t min_ms, uint16_t max_ms) {
  return setConnInterval(MS100TO125(min_ms), MS100TO125(max_ms));
}

bool BLEPeriph::setConnSlaveLatency(uint16_t latency) {
  conn_latency_ = latency;
  manager().radio().setPreferredConnectionParameters(conn_interval_min_, conn_interval_max_,
                                                     conn_latency_,
                                                     conn_supervision_timeout_);
  return true;
}

bool BLEPeriph::setConnSupervisionTimeout(uint16_t timeout) {
  conn_supervision_timeout_ = timeout;
  manager().radio().setPreferredConnectionParameters(conn_interval_min_, conn_interval_max_,
                                                     conn_latency_,
                                                     conn_supervision_timeout_);
  return true;
}

bool BLEPeriph::setConnSupervisionTimeoutMS(uint16_t timeout_ms) {
  return setConnSupervisionTimeout(timeout_ms / 10U);
}

void BLEPeriph::clearBonds() {
  (void)manager().radio().clearBondRecord();
  (void)Bluefruit.Security.refreshBondedPeerResolving();
}

BLEConnection::BLEConnection() : handle_(INVALID_CONNECTION_HANDLE) {}

uint16_t BLEConnection::handle() const { return handle_; }

bool BLEConnection::connected() const { return Bluefruit.connected(handle_); }

bool BLEConnection::bonded() const { return connected() && manager().radio().hasBondRecord(); }

bool BLEConnection::secured() const {
  return connected() && manager().radio().isConnectionEncrypted();
}

bool BLEConnection::authenticated() const {
  return connected() && manager().radio().isConnectionAuthenticated();
}

bool BLEConnection::getPeerName(char* name, uint16_t bufsize) const {
  if (name == nullptr || bufsize == 0U || !manager().radio().isConnected()) {
    return false;
  }
  BleConnectionInfo info{};
  if (!manager().radio().getConnectionInfo(&info)) {
    return false;
  }
  snprintf(name, bufsize, "%02X:%02X:%02X:%02X:%02X:%02X", info.peerAddress[5],
           info.peerAddress[4], info.peerAddress[3], info.peerAddress[2], info.peerAddress[1],
           info.peerAddress[0]);
  return true;
}

bool BLEConnection::disconnect() const { return Bluefruit.disconnect(handle_); }

bool BLEConnection::requestPHY(uint8_t phy) {
  if (!connected()) {
    return false;
  }
  const uint8_t normalized = normalizeBluefruitPhy(phy);
  if (normalized == BLE_GAP_PHY_AUTO) {
    return false;
  }
  if (ScopedBluefruitUserCallback::active()) {
    return manager().deferConnectionPhyRequest(normalized);
  }
  return manager().radio().requestPHY(normalized);
}

uint8_t BLEConnection::getPHY() const {
  return connected() ? manager().radio().getPHY() : BLE_GAP_PHY_AUTO;
}

uint16_t BLEConnection::getConnectionInterval() const {
  if (!connected()) {
    return 0U;
  }
  BleConnectionInfo info{};
  return manager().radio().getConnectionInfo(&info) ? info.intervalUnits : 0U;
}

uint16_t BLEConnection::getSlaveLatency() const {
  if (!connected()) {
    return 0U;
  }
  BleConnectionInfo info{};
  return manager().radio().getConnectionInfo(&info) ? info.latency : 0U;
}

uint16_t BLEConnection::getSupervisionTimeout() const {
  if (!connected()) {
    return 0U;
  }
  BleConnectionInfo info{};
  return manager().radio().getConnectionInfo(&info) ? info.supervisionTimeoutUnits : 0U;
}

uint16_t BLEConnection::getDataLength() const {
  return connected() ? manager().radio().currentDataLength() : 0U;
}

bool BLEConnection::requestDataLengthUpdate() {
  if (!connected()) {
    return false;
  }
  manager().noteExplicitDataLengthRequest();
  if (ScopedBluefruitUserCallback::active()) {
    return manager().deferConnectionDataLengthUpdate();
  }
  return manager().radio().requestDataLengthUpdate();
}

bool BLEConnection::requestMtuExchange(uint16_t mtu) {
  if (!connected()) {
    return false;
  }
  manager().noteExplicitCentralMtuRequest(mtu);
  if (ScopedBluefruitUserCallback::active()) {
    return manager().deferConnectionMtuExchange(mtu);
  }
  return manager().radio().requestAttMtuExchange(mtu);
}

uint16_t BLEConnection::getMtu() const {
  if (!connected()) {
    return 23U;
  }
  return manager().radio().currentAttMtu();
}

bool BLEConnection::requestPairing() const {
  if (!connected()) {
    return false;
  }
  return manager().radio().requestPairing();
}

bool BLEConnection::monitorRssi(uint8_t threshold) const {
  if (!connected()) {
    return false;
  }
  return manager().startRssiMonitor(threshold);
}

int8_t BLEConnection::getRssi() const {
  if (!connected()) {
    return 0;
  }
  return manager().currentConnectionRssi();
}

BLECentral::BLECentral() : connect_callback_(nullptr), disconnect_callback_(nullptr) {}

void BLECentral::setConnectCallback(ble_connect_callback_t fp) { connect_callback_ = fp; }

