lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
void BLECentral::setDisconnectCallback(ble_disconnect_callback_t fp) {
  disconnect_callback_ = fp;
}

bool BLECentral::connect(const ble_gap_evt_adv_report_t* report) {
  if (!manager().begin(0U, 1U)) {
    return false;
  }
  return manager().queueCentralConnect(report);
}

bool BLECentral::connected() const {
  serviceBluefruitBeforePollingState();
  return manager().radio().isConnected() &&
         manager().radio().connectionRole() == BleConnectionRole::kCentral;
}

void BLECentral::setMissingPeerDisconnectEvents(uint16_t events) {
  manager().radio().setCentralMissingPeerDisconnectEvents(events);
}

void BLECentral::clearBonds() {
  (void)manager().radio().clearBondRecord();
  (void)Bluefruit.Security.refreshBondedPeerResolving();
}

BLEScanner::BLEScanner()
    : rx_callback_(nullptr),
      interval_(160U),
      window_(80U),
      low_power_interval_(0U),
      low_power_window_(0U),
      low_power_after_ms_(0U),
      started_ms_(0UL),
      timeout_s_(0U),
      active_scan_(false),
      restart_on_disconnect_(false),
      running_(false),
      paused_(false),
      has_filter_uuid_(false),
      filter_uuid_(),
      has_filter_msd_(false),
      filter_msd_company_(0U),
      has_filter_rssi_(false),
      filter_rssi_dbm_(-127) {}

void BLEScanner::setRxCallback(rx_callback_t fp) { rx_callback_ = fp; }

void BLEScanner::setInterval(uint16_t interval, uint16_t window) {
  interval_ = interval;
  window_ = (window == 0U) ? interval : window;
}

void BLEScanner::setIntervalMS(uint16_t interval_ms, uint16_t window_ms) {
  setInterval(MS1000TO625(interval_ms),
              (window_ms == 0U) ? 0U : MS1000TO625(window_ms));
}

void BLEScanner::setLowPowerBackoffMS(uint32_t after_ms, uint16_t interval_ms,
                                      uint16_t window_ms) {
  low_power_after_ms_ = after_ms;
  low_power_interval_ = (interval_ms == 0U) ? 0U : MS1000TO625(interval_ms);
  low_power_window_ = (window_ms == 0U) ? 0U : MS1000TO625(window_ms);
}

void BLEScanner::useActiveScan(bool enabled) { active_scan_ = enabled; }

void BLEScanner::restartOnDisconnect(bool enabled) { restart_on_disconnect_ = enabled; }

void BLEScanner::filterUuid(const BLEUuid& uuid) {
  filter_uuid_ = uuid;
  has_filter_uuid_ = uuid.begin();
}

void BLEScanner::filterService(const BLEUuid& uuid) { filterUuid(uuid); }

void BLEScanner::filterService(const BLEClientService& service) { filterUuid(service.uuid); }

void BLEScanner::filterMSD(uint16_t company_id) {
  filter_msd_company_ = company_id;
  has_filter_msd_ = true;
}

void BLEScanner::filterRssi(int8_t min_rssi_dbm) {
  filter_rssi_dbm_ = min_rssi_dbm;
  has_filter_rssi_ = true;
}

void BLEScanner::start(uint16_t timeout) {
  if (!manager().begin(0U, 1U)) {
    return;
  }
  manager().resetScannerSchedule();
  timeout_s_ = timeout;
  started_ms_ = millis();
  running_ = true;
  paused_ = false;
}

bool BLEScanner::stop() {
  return manager().stopScanner();
}

void BLEScanner::resume() {
  if (manager().radio().isConnected()) {
    paused_ = true;
    return;
  }
  paused_ = false;
}

bool BLEScanner::checkReportForUuid(const ble_gap_evt_adv_report_t* report,
                                    const BLEUuid& uuid) const {
  return report != nullptr && adDataHasUuid(report->data.p_data, report->data.len, uuid);
}

bool BLEScanner::checkReportForUuid(const ble_gap_evt_adv_report_t* report,
                                    const uint8_t uuid128[16]) const {
  return (uuid128 != nullptr) && checkReportForUuid(report, BLEUuid(uuid128));
}

bool BLEScanner::checkReportForService(const ble_gap_evt_adv_report_t* report,
                                       const BLEUuid& uuid) const {
  return checkReportForUuid(report, uuid);
}

bool BLEScanner::checkReportForService(const ble_gap_evt_adv_report_t* report,
                                       const BLEClientService& service) const {
  return checkReportForService(report, service.uuid);
}

bool BLEScanner::checkReportForService(const ble_gap_evt_adv_report_t* report,
                                       const BLEClientUart& client_uart) const {
  return checkReportForService(report, client_uart.serviceUuid());
}

int BLEScanner::parseReportByType(const ble_gap_evt_adv_report_t* report, uint8_t type,
                                  void* buffer, uint8_t buffer_len) const {
  if (report == nullptr) {
    return 0;
  }
  return copyAdFieldByType(report->data.p_data, report->data.len, type, buffer, buffer_len);
}

BLEDiscovery::BLEDiscovery()
    : handle_range_{0x0001U, 0xFFFFU}, begun_(false) {}

void BLEDiscovery::begin() { begun_ = manager().begin(0U, 1U); }

void BLEDiscovery::setHandleRange(ble_gattc_handle_range_t handle_range) {
  handle_range_ = handle_range;
}

uint8_t BLEDiscovery::discoverCharacteristic(
    uint16_t conn_handle, BLEClientCharacteristic* characteristics[],
    uint8_t count) {
  if (!begun_) {
    begin();
  }
  if (!begun_ || !clientReady(conn_handle) || characteristics == nullptr ||
      count == 0U || handle_range_.start_handle == 0U ||
      handle_range_.start_handle > handle_range_.end_handle) {
    return 0U;
  }

  uint8_t found = 0U;
  for (uint8_t i = 0U; i < count; ++i) {
    BLEClientCharacteristic* characteristic = characteristics[i];
    bool duplicateObject = false;
    for (uint8_t priorIndex = 0U; priorIndex < i; ++priorIndex) {
      if (characteristics[priorIndex] == characteristic) {
        duplicateObject = true;
        break;
      }
    }
    if (characteristic == nullptr || duplicateObject ||
        !characteristic->begin()) {
      continue;
    }
    characteristic->resetDiscovery();

    uint16_t searchStart = handle_range_.start_handle;
    bool rangeExhausted = false;
    for (uint8_t priorIndex = 0U; priorIndex < i; ++priorIndex) {
      BLEClientCharacteristic* prior = characteristics[priorIndex];
      if (prior == nullptr || !prior->discovered_ ||
          prior->uuid != characteristic->uuid ||
          prior->end_handle_ < searchStart) {
        continue;
      }
      if (prior->end_handle_ == 0xFFFFU) {
        rangeExhausted = true;
        break;
      }
      searchStart = static_cast<uint16_t>(prior->end_handle_ + 1U);
    }
    if (rangeExhausted || searchStart > handle_range_.end_handle) {
      continue;
    }

    if (!discoverCharacteristicSync(
            searchStart, handle_range_.end_handle, characteristic->uuid,
            &characteristic->decl_handle_, &characteristic->value_handle_,
            &characteristic->end_handle_, &characteristic->properties_)) {
      continue;
    }
    characteristic->conn_handle_ = conn_handle;
    characteristic->discovery_generation_ = manager().connectionGeneration();
    if (characteristic->discovery_generation_ == 0U) {
      characteristic->resetDiscovery();
      continue;
    }
    characteristic->discovered_ = true;
    ++found;
  }
  return found;
}

uint8_t BLEDiscovery::discoverCharacteristic(uint16_t conn_handle,
                                             BLEClientCharacteristic& chr1) {
  BLEClientCharacteristic* characteristics[] = {&chr1};
  return discoverCharacteristic(conn_handle, characteristics, 1U);
}

uint8_t BLEDiscovery::discoverCharacteristic(uint16_t conn_handle,
                                             BLEClientCharacteristic& chr1,
                                             BLEClientCharacteristic& chr2) {
  BLEClientCharacteristic* characteristics[] = {&chr1, &chr2};
  return discoverCharacteristic(conn_handle, characteristics, 2U);
}

uint8_t BLEDiscovery::discoverCharacteristic(uint16_t conn_handle,
                                             BLEClientCharacteristic& chr1,
                                             BLEClientCharacteristic& chr2,
                                             BLEClientCharacteristic& chr3) {
  BLEClientCharacteristic* characteristics[] = {&chr1, &chr2, &chr3};
  return discoverCharacteristic(conn_handle, characteristics, 3U);
}

uint8_t BLEDiscovery::discoverCharacteristic(
    uint16_t conn_handle, BLEClientCharacteristic& chr1,
    BLEClientCharacteristic& chr2, BLEClientCharacteristic& chr3,
    BLEClientCharacteristic& chr4) {
  BLEClientCharacteristic* characteristics[] = {&chr1, &chr2, &chr3, &chr4};
  return discoverCharacteristic(conn_handle, characteristics, 4U);
}

uint8_t BLEDiscovery::discoverCharacteristic(
    uint16_t conn_handle, BLEClientCharacteristic& chr1,
    BLEClientCharacteristic& chr2, BLEClientCharacteristic& chr3,
    BLEClientCharacteristic& chr4, BLEClientCharacteristic& chr5) {
  BLEClientCharacteristic* characteristics[] = {&chr1, &chr2, &chr3, &chr4,
                                                 &chr5};
  return discoverCharacteristic(conn_handle, characteristics, 5U);
}

uint8_t BLEDiscovery::discoverCharacteristic(
    uint16_t conn_handle, BLEClientCharacteristic& chr1,
    BLEClientCharacteristic& chr2, BLEClientCharacteristic& chr3,
    BLEClientCharacteristic& chr4, BLEClientCharacteristic& chr5,
    BLEClientCharacteristic& chr6) {
  BLEClientCharacteristic* characteristics[] = {&chr1, &chr2, &chr3,
                                                 &chr4, &chr5, &chr6};
  return discoverCharacteristic(conn_handle, characteristics, 6U);
}

uint8_t BLEDiscovery::discoverCharacteristic(
    uint16_t conn_handle, BLEClientCharacteristic& chr1,
    BLEClientCharacteristic& chr2, BLEClientCharacteristic& chr3,
    BLEClientCharacteristic& chr4, BLEClientCharacteristic& chr5,
    BLEClientCharacteristic& chr6, BLEClientCharacteristic& chr7) {
  BLEClientCharacteristic* characteristics[] = {&chr1, &chr2, &chr3, &chr4,
                                                 &chr5, &chr6, &chr7};
  return discoverCharacteristic(conn_handle, characteristics, 7U);
}

uint8_t BLEDiscovery::discoverCharacteristic(
    uint16_t conn_handle, BLEClientCharacteristic& chr1,
    BLEClientCharacteristic& chr2, BLEClientCharacteristic& chr3,
    BLEClientCharacteristic& chr4, BLEClientCharacteristic& chr5,
    BLEClientCharacteristic& chr6, BLEClientCharacteristic& chr7,
    BLEClientCharacteristic& chr8) {
  BLEClientCharacteristic* characteristics[] = {&chr1, &chr2, &chr3, &chr4,
                                                 &chr5, &chr6, &chr7, &chr8};
  return discoverCharacteristic(conn_handle, characteristics, 8U);
}

BLEClientCharacteristic::BLEClientCharacteristic()
    : uuid(),
      begun_(false),
      discovered_(false),
      notify_callback_(nullptr),
      indicate_callback_(nullptr),
      service_(nullptr),
      conn_handle_(INVALID_CONNECTION_HANDLE),
      decl_handle_(0U),
      value_handle_(0U),
      end_handle_(0U),
      cccd_handle_(0U),
      properties_(0U),
      last_value_{0},
      last_value_len_(0U),
      notify_deferred_(true),
      indicate_deferred_(true),
      cccd_value_(0U),
      discovery_generation_(0U) {}

BLEClientCharacteristic::BLEClientCharacteristic(BLEUuid bleuuid)
    : BLEClientCharacteristic() {
  uuid = bleuuid;
}

BLEClientCharacteristic::~BLEClientCharacteristic() {
  if (begun_) {
    BluefruitCompatManager* activeManager = managerIfAlive();
    if (activeManager != nullptr) {
      activeManager->unregisterClientCharacteristic(this);
    }
  }
}

bool BLEClientCharacteristic::begin() {
  return begin(nullptr);
}

bool BLEClientCharacteristic::begin(BLEClientService* parent_service) {
  if (begun_) {
    return true;
  }
  if (!manager().begin(0U, 1U)) {
    return false;
  }
  service_ = (parent_service != nullptr) ? parent_service : BLEClientService::lastService;
  if (service_ == nullptr || !manager().registerClientCharacteristic(this)) {
    return false;
  }
  begun_ = true;
  return true;
}

BLEClientService& BLEClientCharacteristic::parentService() { return *service_; }

