lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
const BLEClientService& BLEClientCharacteristic::parentService() const { return *service_; }

void BLEClientCharacteristic::resetDiscovery() {
  manager().clearDeferredClientValueEvents(this);
  discovered_ = false;
  conn_handle_ = INVALID_CONNECTION_HANDLE;
  decl_handle_ = 0U;
  value_handle_ = 0U;
  end_handle_ = 0U;
  cccd_handle_ = 0U;
  properties_ = 0U;
  last_value_len_ = 0U;
  cccd_value_ = 0U;
  discovery_generation_ = 0U;
  memset(last_value_, 0, sizeof(last_value_));
}

bool BLEClientCharacteristic::discover(uint16_t conn_hdl) {
  if (!begin() || service_ == nullptr || !service_->discover(conn_hdl)) {
    resetDiscovery();
    return false;
  }
  return discover();
}

bool BLEClientCharacteristic::discover() {
  if (!begin() || service_ == nullptr || !service_->discovered_) {
    resetDiscovery();
    return false;
  }

  resetDiscovery();
  if (!retryClientProcedure([&]() {
        return discoverCharacteristicSync(service_->start_handle_, service_->end_handle_,
                                          uuid, &decl_handle_, &value_handle_,
                                          &end_handle_, &properties_);
      })) {
    return false;
  }
  conn_handle_ = service_->conn_handle_;
  discovery_generation_ = manager().connectionGeneration();
  if (discovery_generation_ == 0U) {
    resetDiscovery();
    return false;
  }
  discovered_ = true;
  return true;
}

uint16_t BLEClientCharacteristic::read(void* buffer, uint16_t len) {
  if (!discovered_ || buffer == nullptr || len == 0U) {
    return 0U;
  }
  uint8_t* output = static_cast<uint8_t*>(buffer);
  const uint16_t readLen = readHandleSync(value_handle_, output, len);
  if (readLen == 0U) {
    return 0U;
  }
  last_value_len_ = min<uint16_t>(readLen, sizeof(last_value_));
  memcpy(last_value_, output, last_value_len_);
  return readLen;
}

uint8_t BLEClientCharacteristic::read8() {
  uint8_t value = 0U;
  return (read(&value, sizeof(value)) == sizeof(value)) ? value : 0U;
}

uint16_t BLEClientCharacteristic::read16() {
  uint16_t value = 0U;
  return (read(&value, sizeof(value)) == sizeof(value)) ? value : 0U;
}

uint32_t BLEClientCharacteristic::read32() {
  uint32_t value = 0UL;
  return (read(&value, sizeof(value)) == sizeof(value)) ? value : 0UL;
}

uint16_t BLEClientCharacteristic::write(const void* buffer, uint16_t len) {
  const bool supportsWrite =
      (properties_ & xiao_nrf54l15::kBleGattPropWrite) != 0U;
  const bool supportsWriteWithoutResponse =
      (properties_ & xiao_nrf54l15::kBleGattPropWriteNoRsp) != 0U;
  const bool withResponse = supportsWrite || !supportsWriteWithoutResponse;
  return write(buffer, len, withResponse);
}

uint16_t BLEClientCharacteristic::write(const void* buffer, uint16_t len,
                                        bool withResponse) {
  if (!discovered_ || buffer == nullptr || len == 0U ||
      len > BleRadio::kCustomGattMaxValueLength) {
    return 0U;
  }
  const bool singleWriteFits =
      (static_cast<uint16_t>(3U + len) <= manager().radio().currentAttMtu()) &&
      (static_cast<uint16_t>(7U + len) <= manager().radio().currentDataLength());
  if (withResponse && !singleWriteFits) {
    return writeLongHandleSync(value_handle_, static_cast<const uint8_t*>(buffer), len)
               ? len
               : 0U;
  }
  if (!waitForLinkValueCapacity(len)) {
    return 0U;
  }
  return writeHandleSync(value_handle_, static_cast<const uint8_t*>(buffer), len,
                         withResponse) ? len
                                       : 0U;
}

uint16_t BLEClientCharacteristic::writeWithoutResponse(const void* buffer,
                                                       uint16_t len) {
  return write(buffer, len, false);
}

uint16_t BLEClientCharacteristic::writeSigned(const void* buffer, uint16_t len) {
  if (!discovered_ ||
      (properties_ & xiao_nrf54l15::kBleGattPropAuthenticatedSignedWrites) == 0U ||
      buffer == nullptr || len == 0U || len > 240U ||
      static_cast<uint16_t>(15U + len) > manager().radio().currentAttMtu()) {
    return 0U;
  }
  const bool queued = queueClientAttProcedure([&]() {
    return manager().radio().queueAttSignedWriteCommand(
        value_handle_, static_cast<const uint8_t*>(buffer),
        static_cast<uint8_t>(len));
  });
  return queued ? len : 0U;
}

uint16_t BLEClientCharacteristic::write8(uint8_t value) {
  return write(&value, sizeof(value));
}

uint16_t BLEClientCharacteristic::write16(uint16_t value) {
  return write(&value, sizeof(value));
}

uint16_t BLEClientCharacteristic::write32(uint32_t value) {
  return write(&value, sizeof(value));
}

uint16_t BLEClientCharacteristic::write32(int value) {
  const int32_t value32 = static_cast<int32_t>(value);
  return write(&value32, sizeof(value32));
}

uint16_t BLEClientCharacteristic::write8(uint8_t value, bool withResponse) {
  return write(&value, sizeof(value), withResponse);
}

uint16_t BLEClientCharacteristic::write8WithoutResponse(uint8_t value) {
  return writeWithoutResponse(&value, sizeof(value));
}

uint16_t BLEClientCharacteristic::write_resp(const void* buffer, uint16_t len) {
  return write(buffer, len, true);
}

uint16_t BLEClientCharacteristic::write8_resp(uint8_t value) {
  return write_resp(&value, sizeof(value));
}

uint16_t BLEClientCharacteristic::write16_resp(uint16_t value) {
  return write_resp(&value, sizeof(value));
}

uint16_t BLEClientCharacteristic::write32_resp(uint32_t value) {
  return write_resp(&value, sizeof(value));
}

uint16_t BLEClientCharacteristic::write32_resp(int value) {
  const int32_t value32 = static_cast<int32_t>(value);
  return write_resp(&value32, sizeof(value32));
}

bool BLEClientCharacteristic::writeCCCD(uint16_t value) {
  if (!discovered_ || (value & ~0x0003U) != 0U ||
      ((value & 0x0001U) != 0U &&
       (properties_ & xiao_nrf54l15::kBleGattPropNotify) == 0U) ||
      ((value & 0x0002U) != 0U &&
       (properties_ & xiao_nrf54l15::kBleGattPropIndicate) == 0U)) {
    return false;
  }
  if (cccd_handle_ == 0U &&
      !retryClientProcedure([&]() {
        return discoverCccdHandleSync(value_handle_, end_handle_, &cccd_handle_);
      })) {
    return false;
  }
  const uint8_t cccdValue[2] = {
      static_cast<uint8_t>(value & 0xFFU),
      static_cast<uint8_t>((value >> 8U) & 0xFFU)};
  const bool written = retryClientProcedure([&]() {
    return writeHandleSync(cccd_handle_, cccdValue, sizeof(cccdValue), true);
  });
  if (written) {
    cccd_value_ = value;
  }
  return written;
}

