lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
bool BLEClientCharacteristic::enableNotify() {
  return writeCCCD(static_cast<uint16_t>(cccd_value_ | 0x0001U));
}

bool BLEClientCharacteristic::disableNotify() {
  return writeCCCD(static_cast<uint16_t>(cccd_value_ & ~0x0001U));
}

bool BLEClientCharacteristic::enableIndicate() {
  return writeCCCD(static_cast<uint16_t>(cccd_value_ | 0x0002U));
}

bool BLEClientCharacteristic::disableIndicate() {
  return writeCCCD(static_cast<uint16_t>(cccd_value_ & ~0x0002U));
}

BLEClientCharacteristic::notify_cb_t
BLEClientCharacteristic::callbackForValueEvent(uint8_t att_opcode) const {
  if (att_opcode == kAttOpHandleValueInd && indicate_callback_ != nullptr) {
    return indicate_callback_;
  }
  if (att_opcode == kAttOpHandleValueNtf ||
      att_opcode == kAttOpHandleValueInd) {
    // Existing sketches historically received indications through the notify
    // callback. Preserve that fallback when no distinct indication callback is
    // installed.
    return notify_callback_;
  }
  return nullptr;
}

bool BLEClientCharacteristic::callbackForValueEventIsDeferred(
    uint8_t att_opcode) const {
  if (att_opcode == kAttOpHandleValueInd && indicate_callback_ != nullptr) {
    return indicate_deferred_;
  }
  return notify_deferred_;
}

void BLEClientCharacteristic::dispatchValueEventCallback(uint8_t att_opcode) {
  notify_cb_t callback = callbackForValueEvent(att_opcode);
  if (callback != nullptr) {
    invokeBluefruitUserCallback(callback, this, last_value_, last_value_len_);
  }
}

void BLEClientCharacteristic::handleValueEvent(
    const uint8_t* data, uint16_t len, uint8_t att_opcode,
    uint32_t connection_generation) {
  if (!discovered_ || discovery_generation_ == 0U ||
      discovery_generation_ != connection_generation) {
    return;
  }
  const uint16_t copyLen = min<uint16_t>(len, sizeof(last_value_));
  if (copyLen > 0U && data != nullptr) {
    memcpy(last_value_, data, copyLen);
  }
  last_value_len_ = copyLen;
  if (callbackForValueEvent(att_opcode) == nullptr) {
    return;
  }
  if (callbackForValueEventIsDeferred(att_opcode)) {
    (void)manager().enqueueDeferredClientValueEvent(
        this, data, copyLen, att_opcode, connection_generation);
  } else {
    manager().clearDeferredClientValueEvents(this);
    dispatchValueEventCallback(att_opcode);
  }
}

BLEClientService::BLEClientService()
    : uuid(),
      begun_(false),
      discovered_(false),
      conn_handle_(INVALID_CONNECTION_HANDLE),
      start_handle_(0U),
      end_handle_(0U) {}

BLEClientService::BLEClientService(BLEUuid bleuuid)
    : BLEClientService() {
  uuid = bleuuid;
}

BLEClientService::~BLEClientService() {
  if (begun_) {
    BluefruitCompatManager* activeManager = managerIfAlive();
    if (activeManager != nullptr) {
      activeManager->unregisterClientService(this);
    }
  }
}

bool BLEClientService::begin() {
  if (!manager().begin(0U, 1U) || !manager().registerClientService(this)) {
    return false;
  }
  begun_ = true;
  lastService = this;
  return true;
}

void BLEClientService::resetDiscovery() {
  discovered_ = false;
  conn_handle_ = INVALID_CONNECTION_HANDLE;
  start_handle_ = 0U;
  end_handle_ = 0U;
}

bool BLEClientService::discover(uint16_t conn_hdl) {
  resetDiscovery();
  if ((!begun_ && !begin()) || !clientReady(conn_hdl)) {
    return false;
  }
  if (!retryClientProcedure([&]() {
        return discoverServiceRangeSync(uuid, &start_handle_, &end_handle_);
      })) {
    return false;
  }
  conn_handle_ = conn_hdl;
  discovered_ = true;
  lastService = this;
  return true;
}

void BLEClientService::setHandleRange(
    ble_gattc_handle_range_t handle_range) {
  start_handle_ = handle_range.start_handle;
  end_handle_ = handle_range.end_handle;
}

ble_gattc_handle_range_t BLEClientService::getHandleRange() const {
  return ble_gattc_handle_range_t{start_handle_, end_handle_};
}

BLEClientUart* BLEClientUart::instances_[BLEClientUart::kMaxInstances] = {};
uint8_t BLEClientUart::instance_count_ = 0U;

BLEClientUart::BLEClientUart()
    : service_(BLEUART_UUID_SERVICE),
      txd_(BLEUART_UUID_CHR_TXD),
      rxd_(BLEUART_UUID_CHR_RXD),
      instance_registered_(false),
      discovered_(false),
      rx_callback_(nullptr),
      rx_fifo_{0},
      rx_head_(0U),
      rx_tail_(0U),
      rx_count_(0U) {
  if (instance_count_ < kMaxInstances) {
    instances_[instance_count_++] = this;
    instance_registered_ = true;
  }
}

BLEClientUart::~BLEClientUart() {
  if (!instance_registered_) {
    return;
  }
  for (uint8_t i = 0U; i < instance_count_; ++i) {
    if (instances_[i] != this) {
      continue;
    }
    for (uint8_t next = static_cast<uint8_t>(i + 1U);
         next < instance_count_; ++next) {
      instances_[next - 1U] = instances_[next];
    }
    --instance_count_;
    instances_[instance_count_] = nullptr;
    instance_registered_ = false;
    break;
  }
}

bool BLEClientUart::begin() {
  if (!instance_registered_) {
    if (instance_count_ >= kMaxInstances) {
      return false;
    }
    instances_[instance_count_++] = this;
    instance_registered_ = true;
  }
  txd_.setNotifyCallback(txdNotifyThunk);
  return service_.begin() && txd_.begin(&service_) && rxd_.begin(&service_);
}

bool BLEClientUart::discover(uint16_t conn_hdl) {
  discovered_ = false;
  rx_head_ = 0U;
  rx_tail_ = 0U;
  rx_count_ = 0U;
  if (!begin() || !service_.discover(conn_hdl) || !txd_.discover() || !rxd_.discover()) {
    return false;
  }
  discovered_ = true;
  return true;
}

bool BLEClientUart::enableTXD() { return discovered() && txd_.enableNotify(); }

int BLEClientUart::read() {
  if (rx_count_ == 0U) {
    return -1;
  }
  const int value = rx_fifo_[rx_tail_];
  rx_tail_ = static_cast<uint16_t>((rx_tail_ + 1U) % kRxFifoDepth);
  --rx_count_;
  return value;
}

int BLEClientUart::read(uint8_t* buffer, size_t size) {
  if (buffer == nullptr || size == 0U) {
    return 0;
  }

  size_t copied = 0U;
  while (copied < size) {
    const int value = read();
    if (value < 0) {
      break;
    }
    buffer[copied++] = static_cast<uint8_t>(value);
  }
  return static_cast<int>(copied);
}

int BLEClientUart::available() { return rx_count_; }

