lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
int BLEClientUart::peek() {
  if (rx_count_ == 0U) {
    return -1;
  }
  return rx_fifo_[rx_tail_];
}

void BLEClientUart::flush() {}

size_t BLEClientUart::write(uint8_t value) { return write(&value, 1U); }

size_t BLEClientUart::write(const uint8_t* buffer, size_t size) {
  if (!discovered() || buffer == nullptr || size == 0U || !clientReady(0U) ||
      rxd_.value_handle_ == 0U) {
    return 0U;
  }

  size_t sent = 0U;
  while (sent < size) {
    const uint16_t chunk = static_cast<uint16_t>(min<size_t>(
        BleRadio::kCustomGattMaxValueLength, size - sent));
    if (rxd_.write(&buffer[sent], chunk, true) != chunk) {
      break;
    }
    sent += chunk;
  }
  return sent;
}

const BLEUuid& BLEClientUart::serviceUuid() const { return service_.uuid; }

void BLEClientUart::handleTxdNotify(BLEClientCharacteristic* chr, uint8_t* data, uint16_t len) {
  (void)chr;
  for (uint16_t i = 0U; i < len; ++i) {
    if (rx_count_ >= kRxFifoDepth) {
      break;
    }
    rx_fifo_[rx_head_] = data[i];
    rx_head_ = static_cast<uint16_t>((rx_head_ + 1U) % kRxFifoDepth);
    ++rx_count_;
  }
  if (rx_callback_ != nullptr) {
    invokeBluefruitUserCallback(rx_callback_, *this);
  }
}

void BLEClientUart::txdNotifyThunk(BLEClientCharacteristic* chr, uint8_t* data, uint16_t len) {
  for (uint8_t i = 0U; i < instance_count_; ++i) {
    BLEClientUart* instance = instances_[i];
    if (instance != nullptr && (&instance->txd_ == chr)) {
      instance->handleTxdNotify(chr, data, len);
      return;
    }
  }
}

BLEClientDis::BLEClientDis()
    : BLEClientService(UUID16_SVC_DEVICE_INFORMATION),
      manufacturer_(UUID16_CHR_MANUFACTURER_NAME_STRING),
      model_(UUID16_CHR_MODEL_NUMBER_STRING) {}

bool BLEClientDis::begin() {
  return BLEClientService::begin() && manufacturer_.begin() && model_.begin();
}

bool BLEClientDis::discover(uint16_t conn_hdl) {
  if (!begin() || !BLEClientService::discover(conn_hdl)) {
    return false;
  }
  (void)manufacturer_.discover();
  (void)model_.discover();
  return true;
}

bool BLEClientDis::getManufacturer(char* buffer, uint16_t len) {
  if (buffer == nullptr || len == 0U) {
    return false;
  }
  buffer[0] = '\0';
  const uint16_t readLen =
      manufacturer_.discovered() ? manufacturer_.read(buffer, static_cast<uint16_t>(len - 1U))
                                 : 0U;
  buffer[readLen] = '\0';
  return readLen > 0U;
}

bool BLEClientDis::getModel(char* buffer, uint16_t len) {
  if (buffer == nullptr || len == 0U) {
    return false;
  }
  buffer[0] = '\0';
  const uint16_t readLen =
      model_.discovered() ? model_.read(buffer, static_cast<uint16_t>(len - 1U)) : 0U;
  buffer[readLen] = '\0';
  return readLen > 0U;
}

BLEClientBas::BLEClientBas()
    : BLEClientService(UUID16_SVC_BATTERY), battery_(UUID16_CHR_BATTERY_LEVEL) {}

bool BLEClientBas::begin() {
  return BLEClientService::begin() && battery_.begin();
}

bool BLEClientBas::discover(uint16_t conn_hdl) {
  if (!begin() || !BLEClientService::discover(conn_hdl)) {
    return false;
  }
  (void)battery_.discover();
  return true;
}

uint8_t BLEClientBas::read() {
  return battery_.discovered() ? battery_.read8() : 0U;
}

BLEClientCts::BLEClientCts()
    : BLEClientService(UUID16_SVC_CURRENT_TIME),
      Time{},
      LocalInfo{},
      current_time_(UUID16_CHR_CURRENT_TIME),
      local_info_(UUID16_CHR_LOCAL_TIME_INFORMATION),
      adjust_callback_(nullptr) {}

bool BLEClientCts::begin() {
  current_time_.setNotifyCallback(currentTimeNotifyThunk);
  return BLEClientService::begin() && current_time_.begin(this) && local_info_.begin(this);
}

bool BLEClientCts::discover(uint16_t conn_hdl) {
  if (!begin() || !BLEClientService::discover(conn_hdl)) {
    return false;
  }
  (void)current_time_.discover();
  (void)local_info_.discover();
  return current_time_.discovered();
}

bool BLEClientCts::getCurrentTime() {
  return current_time_.discovered() &&
         current_time_.read(&Time, sizeof(Time)) == sizeof(Time);
}

bool BLEClientCts::getLocalTimeInfo() {
  if (!local_info_.discovered()) {
    memset(&LocalInfo, 0, sizeof(LocalInfo));
    return false;
  }
  return local_info_.read(&LocalInfo, sizeof(LocalInfo)) == sizeof(LocalInfo);
}

bool BLEClientCts::enableAdjust() { return current_time_.enableNotify(); }

void BLEClientCts::handleCurrentTimeNotify(uint8_t* data, uint16_t len) {
  if (data == nullptr || len == 0U) {
    return;
  }
  const uint16_t copyLen = min<uint16_t>(len, sizeof(Time));
  memcpy(&Time, data, copyLen);
  if (copyLen < sizeof(Time)) {
    memset(reinterpret_cast<uint8_t*>(&Time) + copyLen, 0, sizeof(Time) - copyLen);
  }
  if (adjust_callback_ != nullptr) {
    invokeBluefruitUserCallback(adjust_callback_, Time.adjust_reason);
  }
}

void BLEClientCts::currentTimeNotifyThunk(BLEClientCharacteristic* chr, uint8_t* data,
                                          uint16_t len) {
  if (chr == nullptr) {
    return;
  }
  static_cast<BLEClientCts&>(chr->parentService()).handleCurrentTimeNotify(data, len);
}

namespace {
const uint8_t kAncsServiceUuid[16] = {0xD0U, 0x00U, 0x2DU, 0x12U, 0x1EU, 0x4BU, 0x0FU, 0xA4U,
                                      0x99U, 0x4EU, 0xCEU, 0xB5U, 0x31U, 0xF4U, 0x05U, 0x79U};
const uint8_t kAncsControlUuid[16] = {0xD9U, 0xD9U, 0xAAU, 0xFDU, 0xBDU, 0x9BU, 0x21U, 0x98U,
                                      0xA8U, 0x49U, 0xE1U, 0x45U, 0xF3U, 0xD8U, 0xD1U, 0x69U};
const uint8_t kAncsNotificationUuid[16] = {0xBDU, 0x1DU, 0xA2U, 0x99U, 0xE6U, 0x25U, 0x58U, 0x8CU,
                                           0xD9U, 0x42U, 0x01U, 0x63U, 0x0DU, 0x12U, 0xBFU, 0x9FU};
const uint8_t kAncsDataUuid[16] = {0xFBU, 0x7BU, 0x7CU, 0xCEU, 0x6AU, 0xB3U, 0x44U, 0xBEU,
                                   0xB5U, 0x4BU, 0xD6U, 0x24U, 0xE9U, 0xC6U, 0xEAU, 0x22U};
}  // namespace

BLEAncs::BLEAncs()
    : BLEClientService(kAncsServiceUuid),
      control_(kAncsControlUuid),
      notification_(kAncsNotificationUuid),
      data_(kAncsDataUuid),
      notification_callback_(nullptr),
      response_{} {}

bool BLEAncs::begin() {
  notification_.setNotifyCallback(notificationThunk);
  // Attribute getters synchronously wait for a fragmented Data Source stream,
  // including when called from the deferred Notification Source callback.
  data_.setNotifyCallback(dataThunk, false);
  return BLEClientService::begin() && control_.begin(this) && notification_.begin(this) &&
         data_.begin(this);
}

bool BLEAncs::discover(uint16_t conn_handle) {
  if (!begin() || !BLEClientService::discover(conn_handle)) {
    return false;
  }
  const bool foundControl = control_.discover();
  const bool foundNotification = notification_.discover();
  const bool foundData = data_.discover();
  return foundControl && foundNotification && foundData;
}

void BLEAncs::setNotificationCallback(notification_callback_t fp) {
  notification_callback_ = fp;
}

bool BLEAncs::enableNotification() {
  return data_.enableNotify() && notification_.enableNotify();
}

bool BLEAncs::disableNotification() {
  bool ok = true;
  if (notification_.discovered()) {
    ok = notification_.disableNotify() && ok;
  }
  if (data_.discovered()) {
    ok = data_.disableNotify() && ok;
  }
  return ok;
}

uint16_t BLEAncs::getAttribute(uint32_t uid, uint8_t attr, void* buffer, uint16_t bufsize) {
  if (buffer != nullptr && bufsize > 0U) {
    static_cast<uint8_t*>(buffer)[0] = 0U;
  }
  if (!control_.discovered() || !data_.discovered() ||
      attr >= ANCS_ATTR_INVALID || buffer == nullptr || bufsize == 0U ||
      response_.active) {
    return 0U;
  }
  const uint16_t outputCapacity = static_cast<uint16_t>(bufsize - 1U);
  if (outputCapacity == 0U) {
    return 0U;
  }

  uint8_t command[8] = {ANCS_CMD_GET_NOTIFICATION_ATTR,
                        static_cast<uint8_t>(uid & 0xFFU),
                        static_cast<uint8_t>((uid >> 8U) & 0xFFU),
                        static_cast<uint8_t>((uid >> 16U) & 0xFFU),
                        static_cast<uint8_t>((uid >> 24U) & 0xFFU), attr, 0U,
                        0U};
  uint16_t commandLength = 6U;
  if (attr == ANCS_ATTR_TITLE || attr == ANCS_ATTR_SUBTITLE ||
      attr == ANCS_ATTR_MESSAGE) {
    command[6] = static_cast<uint8_t>(outputCapacity & 0xFFU);
    command[7] = static_cast<uint8_t>((outputCapacity >> 8U) & 0xFFU);
    commandLength = sizeof(command);
  }

  beginAttributeResponse(command, 5U, attr, buffer, outputCapacity);
  if (control_.write(command, commandLength, true) != commandLength ||
      !waitForAttributeResponse()) {
    static_cast<uint8_t*>(buffer)[response_.valueCopied] = 0U;
    cancelAttributeResponse();
    return 0U;
  }

  const uint16_t copied = response_.valueCopied;
  static_cast<uint8_t*>(buffer)[copied] = 0U;
  cancelAttributeResponse();
  return copied;
}

uint16_t BLEAncs::getAppAttribute(const char* appid, uint8_t attr, void* buffer,
                                  uint16_t bufsize) {
  if (buffer != nullptr && bufsize > 0U) {
    static_cast<uint8_t*>(buffer)[0] = 0U;
  }
  if (!control_.discovered() || !data_.discovered() || appid == nullptr ||
      appid[0] == '\0' || attr >= ANCS_APP_ATTR_INVALID || buffer == nullptr ||
      bufsize == 0U || response_.active) {
    return 0U;
  }
  const uint16_t outputCapacity = static_cast<uint16_t>(bufsize - 1U);
  if (outputCapacity == 0U) {
    return 0U;
  }

