lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
bool BLEHidAdafruit::mouseReport(uint8_t buttons, int8_t x, int8_t y, int8_t wheel, int8_t pan) {
  return mouseReport(BLE_CONN_HANDLE_INVALID, buttons, x, y, wheel, pan);
}

bool BLEHidAdafruit::mouseButtonPress(uint8_t buttons) {
  return mouseButtonPress(BLE_CONN_HANDLE_INVALID, buttons);
}

bool BLEHidAdafruit::mouseButtonRelease(void) {
  return mouseButtonRelease(BLE_CONN_HANDLE_INVALID);
}

bool BLEHidAdafruit::mouseMove(int8_t x, int8_t y) {
  return mouseMove(BLE_CONN_HANDLE_INVALID, x, y);
}

bool BLEHidAdafruit::mouseScroll(int8_t scroll) {
  return mouseScroll(BLE_CONN_HANDLE_INVALID, scroll);
}

bool BLEHidAdafruit::mousePan(int8_t pan) { return mousePan(BLE_CONN_HANDLE_INVALID, pan); }

bool BLEHidAdafruit::mouseReport(uint16_t conn_hdl, hid_mouse_report_t* report) {
  if (report == nullptr || !hidLinkEncrypted(conn_hdl)) {
    return false;
  }
  if (zephyr_compatible_mouse_) {
    const uint8_t compactReport[3] = {
        static_cast<uint8_t>(report->buttons & 0x07U),
        static_cast<uint8_t>(report->x),
        static_cast<uint8_t>(report->y),
    };
    return mouse_input_.notify(conn_hdl, compactReport, sizeof(compactReport));
  }
  if (report_protocol_mode_) {
    return mouse_input_.notify(conn_hdl, report, sizeof(*report));
  }
  const uint8_t bootReport[3] = {
      static_cast<uint8_t>(report->buttons & 0x07U),
      static_cast<uint8_t>(report->x),
      static_cast<uint8_t>(report->y),
  };
  return boot_mouse_input_.notify(conn_hdl, bootReport, sizeof(bootReport));
}

bool BLEHidAdafruit::mouseReport(uint16_t conn_hdl, uint8_t buttons, int8_t x, int8_t y,
                                 int8_t wheel, int8_t pan) {
  mouse_buttons_ = buttons;
  hid_mouse_report_t report{buttons, x, y, wheel, pan};
  return mouseReport(conn_hdl, &report);
}

bool BLEHidAdafruit::mouseNotifyEnabled() {
  return mouseNotifyEnabled(BLE_CONN_HANDLE_INVALID);
}

bool BLEHidAdafruit::mouseNotifyEnabled(uint16_t conn_hdl) {
  BLECharacteristic& reportCharacteristic =
      report_protocol_mode_ ? mouse_input_ : boot_mouse_input_;
  return reportCharacteristic.notifyEnabled(conn_hdl);
}

bool BLEHidAdafruit::mouseButtonPress(uint16_t conn_hdl, uint8_t buttons) {
  mouse_buttons_ |= buttons;
  return mouseReport(conn_hdl, mouse_buttons_, 0, 0, 0, 0);
}

bool BLEHidAdafruit::mouseButtonRelease(uint16_t conn_hdl) {
  mouse_buttons_ = 0U;
  return mouseReport(conn_hdl, mouse_buttons_, 0, 0, 0, 0);
}

bool BLEHidAdafruit::mouseMove(uint16_t conn_hdl, int8_t x, int8_t y) {
  return mouseReport(conn_hdl, mouse_buttons_, x, y, 0, 0);
}

bool BLEHidAdafruit::mouseScroll(uint16_t conn_hdl, int8_t scroll) {
  return mouseReport(conn_hdl, mouse_buttons_, 0, 0, scroll, 0);
}

bool BLEHidAdafruit::mousePan(uint16_t conn_hdl, int8_t pan) {
  return mouseReport(conn_hdl, mouse_buttons_, 0, 0, 0, pan);
}

BLEHidGamepad::BLEHidGamepad()
    : BLEService(UUID16_SVC_HUMAN_INTERFACE_DEVICE),
      protocol_mode_(UUID16_CHR_PROTOCOL_MODE),
      hid_info_(UUID16_CHR_HID_INFORMATION),
      report_map_(UUID16_CHR_REPORT_MAP),
      hid_control_(UUID16_CHR_HID_CONTROL_POINT),
      gamepad_input_(UUID16_CHR_REPORT) {}

err_t BLEHidGamepad::begin() {
  const err_t status = BLEService::begin();
  if (status != ERROR_NONE) {
    return status;
  }

  const uint8_t protocol = kHidProtocolModeReport;
  err_t result =
      beginFixedCharacteristic(protocol_mode_, CHR_PROPS_READ | CHR_PROPS_WRITE_WO_RESP,
                               SECMODE_ENC_NO_MITM, SECMODE_ENC_NO_MITM,
                               &protocol, sizeof(protocol));
  if (result != ERROR_NONE) {
    return result;
  }

  result = beginFixedCharacteristic(hid_info_, CHR_PROPS_READ, SECMODE_ENC_NO_MITM,
                                    SECMODE_NO_ACCESS, kHidInfoValue,
                                    sizeof(kHidInfoValue));
  if (result != ERROR_NONE) {
    return result;
  }

  result = beginFixedCharacteristic(report_map_, CHR_PROPS_READ, SECMODE_ENC_NO_MITM,
                                    SECMODE_NO_ACCESS, kHidGamepadReportMap,
                                    sizeof(kHidGamepadReportMap));
  if (result != ERROR_NONE) {
    return result;
  }

  hid_gamepad_report_t emptyGamepad{};
  gamepad_input_.setReportRefDescriptor(kHidGamepadReportId, kHidReportTypeInput);
  result = beginFixedCharacteristic(gamepad_input_, CHR_PROPS_READ | CHR_PROPS_NOTIFY,
                                    SECMODE_ENC_NO_MITM, SECMODE_NO_ACCESS,
                                    &emptyGamepad, sizeof(emptyGamepad));
  if (result != ERROR_NONE) {
    return result;
  }

  uint8_t control = 0U;
  result = beginFixedCharacteristic(hid_control_, CHR_PROPS_WRITE_WO_RESP,
                                    SECMODE_NO_ACCESS, SECMODE_ENC_NO_MITM,
                                    &control, sizeof(control));
  if (result != ERROR_NONE) {
    return result;
  }

#if defined(ARDUINO_NRF54LM20A) || defined(ARDUINO_NRF54LM20B)
  Bluefruit.Periph.setConnInterval(24, 40);
#else
  Bluefruit.Periph.setConnInterval(9, 12);
#endif
  return ERROR_NONE;
}

bool BLEHidGamepad::report(hid_gamepad_report_t* report) {
  return this->report(BLE_CONN_HANDLE_INVALID, report);
}

bool BLEHidGamepad::report(uint16_t conn_hdl, hid_gamepad_report_t* report) {
  if (report == nullptr || !hidLinkEncrypted(conn_hdl)) {
    return false;
  }
  return gamepad_input_.notify(conn_hdl, report, sizeof(*report));
}

BLEDis::BLEDis()
    : BLEService(UUID16_SVC_DEVICE_INFORMATION), values_{nullptr}, lengths_{0}, auto_serial_{0} {}

void BLEDis::setSystemID(const char* system_id, uint8_t length) {
  values_[0] = system_id;
  lengths_[0] = length;
}

void BLEDis::setModel(const char* model, uint8_t length) {
  values_[1] = model;
  lengths_[1] = length;
}

void BLEDis::setSerialNum(const char* serial_num, uint8_t length) {
  values_[2] = serial_num;
  lengths_[2] = length;
}

void BLEDis::setFirmwareRev(const char* firmware_rev, uint8_t length) {
  values_[3] = firmware_rev;
  lengths_[3] = length;
}

void BLEDis::setHardwareRev(const char* hw_rev, uint8_t length) {
  values_[4] = hw_rev;
  lengths_[4] = length;
}

void BLEDis::setSoftwareRev(const char* sw_rev, uint8_t length) {
  values_[5] = sw_rev;
  lengths_[5] = length;
}

void BLEDis::setManufacturer(const char* manufacturer, uint8_t length) {
  values_[6] = manufacturer;
  lengths_[6] = length;
}

void BLEDis::setRegCertList(const char* reg_cert_list, uint8_t length) {
  values_[7] = reg_cert_list;
  lengths_[7] = length;
}

