lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
void BLEDis::setPNPID(const char* pnp_id, uint8_t length) {
  values_[8] = pnp_id;
  lengths_[8] = length;
}

err_t BLEDis::begin() {
  static const uint16_t kCharacteristicUuids[9] = {
      UUID16_CHR_SYSTEM_ID,        UUID16_CHR_MODEL_NUMBER_STRING,
      UUID16_CHR_SERIAL_NUMBER_STRING, UUID16_CHR_FIRMWARE_REVISION_STRING,
      UUID16_CHR_HARDWARE_REVISION_STRING, UUID16_CHR_SOFTWARE_REVISION_STRING,
      UUID16_CHR_MANUFACTURER_NAME_STRING, UUID16_CHR_REGULATORY_CERT_DATA_LIST,
      UUID16_CHR_PNP_ID};
  static constexpr char kDefaultManufacturer[] = "Seeed Studio";
  static constexpr char kDefaultModel[] = "XIAO nRF54L15";
  static constexpr char kDefaultHardwareRev[] = "XIAO nRF54L15";
#if defined(ARDUINO_NRF54LM20A) || defined(ARDUINO_NRF54LM20B)
  static constexpr char kDefaultPnpId[] = {
      0x02,       // Vendor ID source: USB Implementers Forum
      0x86, 0x28, // Seeed USB VID 0x2886
      0x68, 0x00, // XIAO nRF54LM20 CMSIS-DAP USB PID 0x0068
      0x01, 0x00  // Product version 0.1
  };
#else
  static constexpr char kDefaultPnpId[] = {
      0x02,       // Vendor ID source: USB Implementers Forum
      0x86, 0x28, // Seeed USB VID 0x2886
      0x66, 0x00, // XIAO nRF54L15 CMSIS-DAP USB PID 0x0066
      0x01, 0x00  // Product version 0.1
  };
#endif

  const err_t status = BLEService::begin();
  if (status != ERROR_NONE) {
    return status;
  }

  if (values_[1] == nullptr || lengths_[1] == 0U) {
    setModel(kDefaultModel);
  }
  if (values_[2] == nullptr || lengths_[2] == 0U) {
    snprintf(auto_serial_, sizeof(auto_serial_), "%08" PRIX32 "%08" PRIX32,
             NRF_FICR->INFO.DEVICEID[1], NRF_FICR->INFO.DEVICEID[0]);
    setSerialNum(auto_serial_);
  }
  if (values_[3] == nullptr || lengths_[3] == 0U) {
    setFirmwareRev(NRF54L15_CLEAN_CORE_VERSION_STRING);
  }
  if (values_[4] == nullptr || lengths_[4] == 0U) {
    setHardwareRev(kDefaultHardwareRev);
  }
  if (values_[5] == nullptr || lengths_[5] == 0U) {
    setSoftwareRev(NRF54L15_CLEAN_CORE_VERSION_STRING);
  }
  if (values_[6] == nullptr || lengths_[6] == 0U) {
    setManufacturer(kDefaultManufacturer);
  }
  if (values_[8] == nullptr || lengths_[8] == 0U) {
    setPNPID(kDefaultPnpId, sizeof(kDefaultPnpId));
  }

  for (uint8_t i = 0U; i < 9U; ++i) {
    if (values_[i] == nullptr || lengths_[i] == 0U) {
      continue;
    }
    const uint8_t len =
        static_cast<uint8_t>(min<uint16_t>(clampValueLen(lengths_[i]), 0xFFU));
    if (!manager().radio().addCustomGattCharacteristic(
            _handle, kCharacteristicUuids[i], xiao_nrf54l15::kBleGattPropRead,
            reinterpret_cast<const uint8_t*>(values_[i]), len, nullptr, nullptr)) {
      return ERROR_INVALID_STATE;
    }
  }
  return ERROR_NONE;
}

BLEDfu::BLEDfu() : BLEService(kUuidDfuService) {}

err_t BLEDfu::begin() {
  return ERROR_NOT_SUPPORTED;
}

BLEBas::BLEBas() : BLEService(UUID16_SVC_BATTERY) {}

err_t BLEBas::begin() {
  _begun = true;
  lastService = this;
  return ERROR_NONE;
}

bool BLEBas::write(uint8_t level) {
  return manager().radio().writeGattBatteryLevel(level);
}

bool BLEBas::notify(uint8_t level) { return notify(0U, level); }

bool BLEBas::notify(uint16_t conn_hdl, uint8_t level) {
  if (conn_hdl != 0U) {
    return false;
  }
  return manager().radio().notifyGattBatteryLevel(level);
}

BLEUart::BLEUart(uint16_t fifo_depth)
    : BLEService(BLEUART_UUID_SERVICE),
      _txd(BLEUART_UUID_CHR_TXD),
      _rxd(BLEUART_UUID_CHR_RXD),
      _rx_fifo_depth((fifo_depth == 0U) ? 1U : fifo_depth),
      _rx_fifo(new uint8_t[(fifo_depth == 0U) ? 1U : fifo_depth]),
      _rx_head(0U),
      _rx_tail(0U),
      _rx_count(0U),
      _tx_fifo(nullptr),
      _tx_fifo_count(0U),
      _tx_buffered(false),
      _rx_cb(nullptr),
      _notify_cb(nullptr),
      _overflow_cb(nullptr) {}

BLEUart::~BLEUart() {
  delete[] _rx_fifo;
  delete[] _tx_fifo;
}

err_t BLEUart::begin() {
  const err_t status = BLEService::begin();
  if (status != ERROR_NONE) {
    return status;
  }

  _txd.setProperties(CHR_PROPS_NOTIFY);
  _txd.setPermission(SECMODE_OPEN, SECMODE_NO_ACCESS);
  _txd.setMaxLen(BleRadio::kCustomGattMaxValueLength);
  _txd.setCccdWriteCallback(bleuart_txd_cccd_cb);
  if (_txd.begin() != ERROR_NONE) {
    return ERROR_INVALID_STATE;
  }

  _rxd.setProperties(CHR_PROPS_WRITE | CHR_PROPS_WRITE_WO_RESP);
  _rxd.setPermission(SECMODE_NO_ACCESS, SECMODE_OPEN);
  _rxd.setMaxLen(BleRadio::kCustomGattMaxValueLength);
  _rxd.setWriteCallback(bleuart_rxd_cb);
  if (_rxd.begin() != ERROR_NONE) {
    return ERROR_INVALID_STATE;
  }

  return ERROR_NONE;
}

bool BLEUart::notifyEnabled() { return _txd.notifyEnabled(); }

bool BLEUart::notifyEnabled(uint16_t conn_hdl) { return _txd.notifyEnabled(conn_hdl); }

void BLEUart::setRxCallback(rx_callback_t fp, bool deferred) {
  (void)deferred;
  _rx_cb = fp;
}

void BLEUart::setRxOverflowCallback(rx_overflow_callback_t fp) { _overflow_cb = fp; }

void BLEUart::setNotifyCallback(notify_callback_t fp) { _notify_cb = fp; }

void BLEUart::bufferTXD(bool enable) {
  if (enable && _tx_fifo == nullptr) {
    _tx_fifo = new uint8_t[BLUEFRUIT_GATT_VALUE_MAX_LEN];
  }
  _tx_buffered = enable && _tx_fifo != nullptr;
  if (!_tx_buffered) {
    _tx_fifo_count = 0U;
  }
}

bool BLEUart::flushTXD() { return flushTXD(0U); }

bool BLEUart::flushTXD(uint16_t conn_hdl) {
  BLEConnection* conn = Bluefruit.Connection(conn_hdl);
  if (conn == nullptr) {
    return false;
  }
  if (!_tx_buffered || _tx_fifo == nullptr || _tx_fifo_count == 0U) {
    return true;
  }
  if (!notifyEnabled(conn_hdl)) {
    return false;
  }

  uint32_t stalledAtMs = 0U;
  while (_tx_fifo_count > 0U) {
    const uint16_t mtu = conn->getMtu();
    const uint16_t maxChunk =
        (mtu > 3U) ? static_cast<uint16_t>(mtu - 3U) : 20U;
    const uint16_t chunk = min<uint16_t>(
        min<uint16_t>(BLUEFRUIT_GATT_VALUE_MAX_LEN, maxChunk),
        _tx_fifo_count);
    if (!_txd.notify(conn_hdl, _tx_fifo, chunk)) {
      if (!conn->connected() || !notifyEnabled(conn_hdl)) {
        return false;
      }
      if (stalledAtMs == 0U) {
        stalledAtMs = millis();
      } else if ((millis() - stalledAtMs) > 1000UL) {
        return false;
      }
      yield();
      if (!conn->connected() || !notifyEnabled(conn_hdl)) {
        return false;
      }
      continue;
    }
    stalledAtMs = 0U;
    _tx_fifo_count = static_cast<uint16_t>(_tx_fifo_count - chunk);
    if (_tx_fifo_count > 0U) {
      memmove(_tx_fifo, &_tx_fifo[chunk], _tx_fifo_count);
    }
  }
  return true;
}

