lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
void AdafruitBluefruit::setName(const char* str) {
  if (str == nullptr) {
    return;
  }
  strncpy(device_name_, str, CFG_MAX_DEVNAME_LEN);
  device_name_[CFG_MAX_DEVNAME_LEN] = '\0';
  manager().radio().setGattDeviceName(device_name_);
  manager().markAdvertisingDirty();
}

uint8_t AdafruitBluefruit::getName(char* name, uint16_t bufsize) {
  if (name == nullptr || bufsize == 0U) {
    return 0U;
  }
  const size_t len = strlen(device_name_);
  const uint16_t copyLen = min<uint16_t>(bufsize - 1U, static_cast<uint16_t>(len));
  memcpy(name, device_name_, copyLen);
  name[copyLen] = '\0';
  return static_cast<uint8_t>(copyLen);
}

bool AdafruitBluefruit::setTxPower(int8_t power) {
  tx_power_ = power;
  manager().markAdvertisingDirty();
  return manager().radio().setTxPowerDbm(power);
}

int8_t AdafruitBluefruit::getTxPower() const { return tx_power_; }

bool AdafruitBluefruit::setAppearance(uint16_t appearance) {
  appearance_ = appearance;
  return manager().radio().setGattAppearance(appearance);
}

uint16_t AdafruitBluefruit::getAppearance() const { return appearance_; }

void AdafruitBluefruit::autoConnLed(bool enabled) {
  auto_conn_led_ = enabled;
  if (enabled) {
    pinMode(LED_BUILTIN, OUTPUT);
    digitalWrite(LED_BUILTIN,
                 manager().radio().isConnected() ? kLedOnState : kLedOffState);
  }
}

void AdafruitBluefruit::setConnLedInterval(uint32_t ms) { conn_led_interval_ms_ = ms; }

uint8_t AdafruitBluefruit::connected() const {
  serviceBluefruitBeforePollingState();
  return manager().radio().isConnected() ? 1U : 0U;
}

bool AdafruitBluefruit::connected(uint16_t conn_hdl) const {
  serviceBluefruitBeforePollingState();
  return (conn_hdl == 0U) && manager().radio().isConnected();
}

uint8_t AdafruitBluefruit::getConnectedHandles(uint16_t* hdl_list, uint8_t max_count) const {
  if (hdl_list == nullptr || max_count == 0U || !manager().radio().isConnected()) {
    return 0U;
  }
  hdl_list[0] = 0U;
  return 1U;
}

uint16_t AdafruitBluefruit::connHandle() const {
  return manager().radio().isConnected() ? 0U : INVALID_CONNECTION_HANDLE;
}

bool AdafruitBluefruit::disconnect(uint16_t conn_hdl) {
  if (conn_hdl != 0U || !manager().radio().isConnected()) {
    return false;
  }
  return manager().radio().requestDisconnect();
}

bool AdafruitBluefruit::getLastDisconnectReason(
    uint8_t* reason, bool* remote_terminated) const {
  if (reason == nullptr || !last_disconnect_reason_valid_) {
    return false;
  }
  *reason = last_disconnect_reason_;
  if (remote_terminated != nullptr) {
    *remote_terminated = last_disconnect_reason_remote_;
  }
  return true;
}

uint8_t AdafruitBluefruit::getLastDisconnectReason() const {
  return last_disconnect_reason_valid_ ? last_disconnect_reason_
                                       : BLE_HCI_STATUS_CODE_SUCCESS;
}

const char* AdafruitBluefruit::disconnectReasonName(uint8_t reason) const {
  return disconnectReasonNameFromHci(reason);
}

uint16_t AdafruitBluefruit::getMaxMtu(uint8_t role) {
  return (role == BLE_GAP_ROLE_PERIPH) ? periph_requested_mtu_ : central_requested_mtu_;
}

void AdafruitBluefruit::setRssiCallback(void (*fp)(uint16_t conn_hdl, int8_t rssi)) {
  rssi_callback_ = fp;
}

BLEConnection* AdafruitBluefruit::Connection(uint16_t conn_hdl) {
  if (conn_hdl != 0U || !manager().radio().isConnected()) {
    return nullptr;
  }
  return manager().connection();
}

xiao_nrf54l15::BleRadio& AdafruitBluefruit::rawRadio() {
  return manager().radio();
}

const xiao_nrf54l15::BleRadio& AdafruitBluefruit::rawRadio() const {
  return manager().radio();
}

void AdafruitBluefruit::debugPrintLongWriteState(Stream& out) {
  out.print("LONGWRITE code=");
  out.print(g_bluefruitLongWriteDiagCode);
  out.print(" sent=");
  out.print(g_bluefruitLongWriteDiagSent);
  out.print(" chunk=");
  out.print(g_bluefruitLongWriteDiagChunk);
  out.print(" mtu=");
  out.print(g_bluefruitLongWriteDiagMtu);
  out.print(" dle=");
  out.print(g_bluefruitLongWriteDiagDataLength);
  out.print(" wait=");
  out.print(g_bluefruitLongWriteDiagWaitOutcome);
  out.print(" att_err=");
  out.print(g_bluefruitLongWriteDiagAttError);
  out.print(" event_len=");
  out.print(g_bluefruitLongWriteDiagEventLength);
  out.print(" event_op=0x");
  if (g_bluefruitLongWriteDiagEventOpcode < 16U) {
    out.print('0');
  }
  out.println(g_bluefruitLongWriteDiagEventOpcode, HEX);
}

void AdafruitBluefruit::debugPrintEncryptionCounters(Stream& out) {
  xiao_nrf54l15::BleEncryptionDebugCounters c{};
  manager().radio().getEncryptionDebugCounters(&c);
  out.print("ENCDBG encReq=");
  out.print(c.mainEncReqSeen);
  out.print(" encRspTxOk=");
  out.print(c.mainEncRspTxOk);
  out.print(" fastSeen=");
  out.print(c.fastEncReqSeen);
  out.print(" fastTxOk=");
  out.print(c.fastEncRspTxOk);
  out.print(" firstTry=");
  out.print(c.fastEncRspFirstTry);
  out.print(" firstOk=");
  out.print(c.fastEncRspFirstTxOk);
  out.print(" retxTry=");
  out.print(c.fastEncRspRetxTry);
  out.print(" retxOk=");
  out.print(c.fastEncRspRetxTxOk);
  out.print(" fastNoEnd=");
  out.print(c.fastEncRejectNoEnd);
  out.print(" fastBusy=");
  out.print(c.fastEncRejectBusy);
  out.print(" fastAck=");
  out.print(c.fastEncRejectAck);
  out.print(" fastBuild=");
  out.print(c.fastEncRejectBuild);
  out.print(" fastHdr=0x");
  if (c.fastEncLastHdr < 16U) {
    out.print('0');
  }
  out.print(c.fastEncLastHdr, HEX);
  out.print(" fastLen=");
  out.print(c.fastEncLastLen);
  out.print(" fastNesn=");
  out.print(c.fastEncLastNesn);
  out.print(" fastSn=");
  out.print(c.fastEncLastSn);
  out.print(" fastPeerAck=");
  out.print(c.fastEncLastPeerAcked);
  out.print(" fastNew=");
  out.print(c.fastEncLastPacketNew);
  out.print(" fastSmpAck=");
  out.print(c.fastEncLastSmpProgressAck);
  out.print(" firstHdr=0x");
  if (c.fastEncFirstTxHdr < 16U) {
    out.print('0');
  }
  out.print(c.fastEncFirstTxHdr, HEX);
  out.print(" firstLag=");
  out.print(c.fastEncFirstLagUs);
  out.print(" firstComp=");
  out.print(c.fastEncFirstCompUs);
  out.print(" firstRxEnd=");
  out.print(c.fastEncFirstRxEndUs);
  out.print(" firstTarget=");
  out.print(c.fastEncFirstTargetUs);
  out.print(" firstArm=");
  out.print(c.fastEncFirstArmUs);
  out.print(" firstPeerAck=");
  out.print(c.fastEncFirstPeerAcked);
  out.print(" firstNew=");
  out.print(c.fastEncFirstPacketNew);
  out.print(" firstSmpAck=");
  out.print(c.fastEncFirstSmpProgressAck);
  out.print(" startReq=");
  out.print(c.mainStartEncReqSeen);
  out.print(" startReqDec=");
  out.print(c.mainStartEncReqSeenDecrypted);
  out.print(" startPendCtl=");
  out.print(c.startPendingControlRxSeen);
  out.print(" startPendEvt=");
  out.print(c.startPendingLastEventCounter);
  out.print(" startPendCh=");
  out.print(c.startPendingLastDataChannel);
  out.print(" startPendHdr=0x");
  if (c.startPendingLastHdr < 16U) {
    out.print('0');
  }
  out.print(c.startPendingLastHdr, HEX);
  out.print(" startPendLen=");
  out.print(c.startPendingLastLenRaw);
  out.print(" startPendOp=0x");
  if (c.startPendingLastByte0 < 16U) {
    out.print('0');
  }
  out.print(c.startPendingLastByte0, HEX);
  out.print(" startPendB1=0x");
  if (c.startPendingLastByte1 < 16U) {
    out.print('0');
  }
  out.print(c.startPendingLastByte1, HEX);
  out.print(" startPendNew=");
  out.print(c.startPendingLastPacketNew);
  out.print(" startPendAck=");
  out.print(c.startPendingLastPeerAcked);
  out.print(" startPendDec=");
  out.print(c.startPendingLastDecrypted);
  out.print(" followSeen=");
  out.print(c.followupEndSeen);
  out.print(" followTimeout=");
  out.print(c.connFollowupRxTimeoutCount);
  out.print(" txTimeout=");
  out.print(c.connTxTimeoutCount);
  out.print(" txLag=");
  out.print(c.txenLagLastUs);
  out.print(" txLagMax=");
  out.print(c.txenLagMaxUs);
  out.print(" txLate=");
  out.print(c.txenLateCount);
  out.print(" encRspLag=");
  out.print(c.encRspTxenLagLastUs);
  out.print(" encRspLagMax=");
  out.print(c.encRspTxenLagMaxUs);
  out.print(" followBudget=");
  out.print(c.connLastFollowupListenBudgetUs);
  out.print(" encRspHdr=0x");
  if (c.encRspLastTxHdr < 16U) {
    out.print('0');
  }
  out.print(c.encRspLastTxHdr, HEX);
  out.print(" encRspPlainLen=");
  out.print(c.encRspLastTxPlainLen);
  out.print(" encRspAirLen=");
  out.print(c.encRspLastTxAirLen);
  out.print(" encRspFresh=");
  out.print(c.encRspLastTxWasFresh);
  out.print(" txHdr=0x");
  if (c.encLastTxHdr < 16U) {
    out.print('0');
  }
  out.print(c.encLastTxHdr, HEX);
  out.print(" txPlainLen=");
  out.print(c.encLastTxPlainLen);
  out.print(" txAirLen=");
  out.print(c.encLastTxAirLen);
  out.print(" micFail=");
  out.print(c.encRxMicFailCount);
  out.print(" shortRx=");
  out.print(c.encRxShortPduCount);
  out.print(" clr=");
  out.print(c.encClearCount);
  out.print(" clrReason=0x");
  if (c.encLastClearReason < 16U) {
    out.print('0');
  }
  out.print(c.encLastClearReason, HEX);
  out.print(" disc=0x");
  if (c.connLastDisconnectReason < 16U) {
    out.print('0');
  }
  out.print(c.connLastDisconnectReason, HEX);
  out.print(" discRemote=");
  out.print(c.connLastDisconnectRemote);
  out.print(" discValid=");
  out.print(c.connLastDisconnectValid);
  out.print(" prefetchUse=");
  out.print(c.encRandomPrefetchUseCount);
  out.print(" prefetchFill=");
  out.print(c.encRandomPrefetchFillCount);
  out.print(" hwRnd=");
  out.print(c.encRandomHardwareCount);
  out.print(" fbRnd=");
  out.print(c.encRandomFallbackCount);
  auto printHexBytes = [&](const char* label, const uint8_t* data,
                           size_t len) {
    out.print(' ');
    out.print(label);
    out.print('=');
    for (size_t i = 0; i < len; ++i) {
      if (data[i] < 16U) {
        out.print('0');
      }
      out.print(data[i], HEX);
    }
  };
  printHexBytes("skdm", c.encLastSkdm, sizeof(c.encLastSkdm));
  printHexBytes("ivm", c.encLastIvm, sizeof(c.encLastIvm));
  printHexBytes("skds", c.encLastSkds, sizeof(c.encLastSkds));
  printHexBytes("ivs", c.encLastIvs, sizeof(c.encLastIvs));
  printHexBytes("stk", c.encLastStk, sizeof(c.encLastStk));
  out.println();
}

void AdafruitBluefruit::debugPrintDisconnectDebug(Stream& out) {
  xiao_nrf54l15::BleDisconnectDebug d{};
  if (!manager().radio().getDisconnectDebug(&d)) {
    out.println("DISCDBG valid=0");
    return;
  }

  auto printHex8 = [&](const char* label, uint8_t value) {
    out.print(' ');
    out.print(label);
    out.print("=0x");
    if (value < 16U) {
      out.print('0');
    }
    out.print(value, HEX);
  };

  out.print("DISCDBG valid=");
  out.print(d.valid);
  out.print(" seq=");
  out.print(d.sequence);
  out.print(" reason=");
  out.print(d.reason);
  out.print(" role=");
  out.print(d.role);
  printHex8("err", d.errorCode);
  out.print(" evt=");
  out.print(d.eventCounter);
  out.print(" missed=");
  out.print(d.missedEventCount);
  out.print(" int=");
  out.print(d.intervalUnits);
  out.print(" winSize=");
  out.print(d.connectWindowSize);
  out.print(" winOff=");
  out.print(d.connectWindowOffset);
  out.print(" firstListenUs=");
  out.print(d.firstEventListenUs);
  out.print(" syncLeft=");
  out.print(d.syncAttemptsRemaining);
  out.print(" nextUs=");
  out.print(d.nextEventUs);
  out.print(" expRxSn=");
  out.print(d.expectedRxSn);
  out.print(" txSn=");
  out.print(d.txSn);
  out.print(" fresh=");
  out.print(d.freshTxAllowed);
  out.print(" hist=");
  out.print(d.txHistoryValid);
  out.print(" pend=");
  out.print(d.pendingTxValid);
  out.print(" pendLlid=");
  out.print(d.pendingTxLlid);
  out.print(" pendLen=");
  out.print(d.pendingTxLength);
  out.print(" lastTxLlid=");
  out.print(d.lastTxLlid);
  out.print(" lastTxLen=");
  out.print(d.lastTxLength);
  printHex8("lastTxOp", d.lastTxOpcode);
  out.print(" lastRxLlid=");
  out.print(d.lastRxLlid);
  out.print(" lastRxLen=");
  out.print(d.lastRxLength);
  printHex8("lastRxOp", d.lastRxOpcode);
  out.print(" lastRxNesn=");
  out.print(d.lastRxNesn);
  out.print(" lastRxSn=");
  out.print(d.lastRxSn);
  out.print(" lastNew=");
  out.print(d.lastPacketIsNew);
  out.print(" lastAck=");
  out.print(d.lastPeerAckedLastTx);
  out.println();
}

void AdafruitBluefruit::debugPrintSecureConnectionsState(Stream& out) {
  xiao_nrf54l15::BleSecureConnectionsDebugState s{};
  manager().radio().getSecureConnectionsDebugState(&s);
  out.print("SCDBG valid=");
  out.print(s.valid);
  out.print(" active=");
  out.print(s.active);
  out.print(" state=");
  out.print(s.pairingState);
  out.print(" init=");
  out.print(s.localInitiator);
  out.print(" wireBE=");
  out.print(s.wireFormatBigEndian);
  out.print(" peerPk=");
  out.print(s.peerPublicKeyValid);
  out.print(" pkSent=");
  out.print(s.publicKeySent);
  out.print(" confSent=");
  out.print(s.confirmSent);
  out.print(" randSent=");
  out.print(s.randomSent);
  out.print(" dhReady=");
  out.print(s.dhKeyReady);
  out.print(" chkReady=");
  out.print(s.checkValuesReady);
  out.print(" dhSent=");
  out.print(s.dhKeyCheckSent);
  out.print(" dhRx=");
  out.print(s.receivedDhKeyCheckValid);
  out.print(" defPk=");
  out.print(s.deferredPublicKey);
  out.print(" defConf=");
  out.print(s.deferredConfirm);
  out.print(" defRand=");
  out.print(s.deferredRandom);
  out.print(" defDh=");
  out.print(s.deferredDhKeyCheck);
  out.print(" pkFail=");
  out.print(s.lastPublicKeyDecodeFailed);
  out.print(" pkLen=");
  out.print(s.lastPublicKeyDecodeLength);
  out.print(" keyUs=");
  out.print(s.localKeypairTimeUs);
  out.print(" dhUs=");
  out.print(s.dhKeyTimeUs);
  out.print(" chkUs=");
  out.print(s.checkValuesTimeUs);
  out.print(" coop=");
  out.print(s.cooperateHookCount);
  out.print(" bg=");
  out.print(s.backgroundServiceCount);
  auto printHexBytes = [&](const char* label, const uint8_t* data,
                           size_t len) {
    out.print(' ');
    out.print(label);
    out.print('=');
    for (size_t i = 0; i < len; ++i) {
      if (data[i] < 16U) {
        out.print('0');
      }
      out.print(data[i], HEX);
    }
  };
  printHexBytes("localX", s.localPublicKeyX, sizeof(s.localPublicKeyX));
  printHexBytes("peerX", s.peerPublicKeyX, sizeof(s.peerPublicKeyX));
  size_t pkLen = s.lastPublicKeyDecodeLength;
  if (pkLen > sizeof(s.lastPublicKeyWire)) {
    pkLen = sizeof(s.lastPublicKeyWire);
  }
  if (pkLen > 0U) {
    printHexBytes("lastPk", s.lastPublicKeyWire, pkLen);
  }
  out.println();
}
